{
  "categoryId": "aws",
  "categoryName": "AWS",
  "articles": [
    {
      "id": "8ef7726ca3407bdab01ad968389d236778419e5d",
      "title": "Amazon Application Recovery Controller Region switch が 3 つの新機能のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-application-recovery-controller-region-switch-new-capabilities",
      "pubDate": "2025-12-19T15:00:00.000Z",
      "contentSnippet": "Amazon Application Recovery Controller (ARC) Region switch を使用すると、マルチリージョンアプリケーションが別の AWS リージョンの外で動作するよう切り替えるための特定の手順を調整して、アプリケーションにリージョンの障害が発生した場合の復旧時間を制限できます。Region switch により、これまでフェイルオーバーの手順を完了したり、カスタムダッシュボードを作成したり、組織全体で複数の AWS アカウントでホストされているアプリケーションについて復旧が成功した証拠を手動で収集したりするために必要だったエンジニアリングの労力を削減し、運用上のオーバーヘッドをなくすことができます。本日、Region switch の 3 つの新機能を発表します。\n  AWS GovCloud (米国) サポート: AWS GovCloud (米国東部および米国西部) リージョンで ARC Region switch の一般提供が開始されました。\n  プラン実行レポート: Region switch により、各プラン実行から包括的なレポートが自動的に生成され、選択した Amazon S3 バケットに保存されるようになりました。各レポートには、復旧操作に関係するイベントの詳細なタイムライン、リージョンスイッチの対象となるリソース、アプリケーションステータスアラーム (オプション) のアラーム状態、目標復旧時間 (RTO) の計算が含まれます。これにより、コンプライアンスの責任者および監査人用の証拠やドキュメントをまとめるためにこれまで必要だった手作業の労力が不要になります。\n  DocumentDB グローバルクラスター実行ブロック: Region switch は、9 つの実行ブロックのカタログに加えて、マルチリージョンデータベース自動復旧用の Amazon DocumentDB グローバルクラスター実行ブロックをサポートするようになりました。この機能により、DocumentDB グローバルクラスターのフェイルオーバーおよびスイッチオーバー操作をリージョンスイッチプラン内で調整できます。\n  利用を開始するには、ARC コンソール、API、または CLI を使用してリージョンスイッチプランを作成します。各リージョンで利用できるサービスの情報については、AWS リージョン別のサービス表をご覧ください。ホームページにアクセスするか、ドキュメントをお読みください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "f364e0aebd16d9e48a709eb2a5af118bd5167686",
      "title": "AWS Private CA OCSP が中国および AWS GovCloud (米国) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-private-ca-ocsp-china-govcloud-us-regions",
      "pubDate": "2025-12-19T15:00:00.000Z",
      "contentSnippet": "AWS Private Certificate Authority (AWS Private CA) は、中国および AWS GovCloud (米国) リージョンでオンライン証明書ステータスプロトコル (OCSP) をサポートするようになりました。AWS Private CA はフルマネージドのプライベート認証局サービスで、独自の CA インフラストラクチャを実行することによる運用上のオーバーヘッドなしで組織のプライベート証明書を簡単に作成および管理できます。OCSP では証明書をリアルタイムで認証できるため、アプリケーションが証明書失効リスト (CRL) ファイルをダウンロードしなくても個々の証明書の失効ステータスをオンデマンドで確認できます。\n  OCSP サポートにより、これらのリージョンのお客様は、数百キロバイト以上の大規模な証明書失効リスト (CRL) をダウンロードする代わりに、通常はクエリごとに数百バイトしか必要としない最小限の帯域幅の、より効率的な証明書の検証を実装できます。これにより、社内のマイクロサービス通信の検証、ゼロトラストセキュリティアーキテクチャの実装、IoT デバイスの認証といったユースケースにおけるリアルタイムの失効チェックが可能になります。AWS Private CA が OCSP 自動応答インフラストラクチャを完全に管理するので、OCSP サーバーをデプロイしたり、維持したりする必要なしに高可用性が実現します。\n  OCSP が中国 (北京)、中国 (寧夏)、AWS GovCloud (米国東部)、AWS GovCloud (米国西部) の AWS リージョンでもご利用いただけるようになりました。\n  認証局で OCSP を有効にするには、AWS Private CA コンソール、AWS CLI、または API を使用してください。OCSP について詳しくは、AWS Private CA ユーザーガイドの証明書の失効を参照してください。料金情報については、AWS Private CA の料金ページを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "08c5ac89a4a95c100e9eb9a2225ba25f175afd10",
      "title": "Amazon SageMaker Studio がコンテナの起動時間を短縮できる SOCI インデックス作成のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-sagemaker-nbi-soci/",
      "pubDate": "2025-12-19T15:00:00.000Z",
      "contentSnippet": "本日、AWS は Amazon SageMaker Studio における SOCI (Seekable Open Container Initiative) インデックス作成のサポートを発表しました。これにより、カスタムイメージを使用する場合のコンテナ起動時間が 30～50% 短縮されます。Amazon SageMaker Studio は、エンドツーエンドの機械学習開発用の完全に統合されたブラウザベースの環境です。SageMaker Studio には、TensorFlow、PyTorch、Scikit-learn などの一般的な ML フレームワーク向けにあらかじめ構築されたコンテナイメージが用意されており、環境をすばやくセットアップできます。しかし、特定のユースケースに合わせて環境を調整するために追加のライブラリ、依存関係、設定を使用する必要がある場合、データサイエンティストは、あらかじめ設定されたコンポーネントを使用してカスタムコンテナイメージの構築と登録を行い、プロジェクト間の一貫性を確保できます。ML ワークロードが複雑さを増すにつれて、これらのカスタムコンテナイメージのサイズが拡大し、起動時間に数分を要するようになると、迅速な実験とプロトタイピングが不可欠な反復的 ML 開発でボトルネックが発生します。\n  SOCI インデックス作成はコンテナイメージの遅延読み込みを可能にし、必要なコンポーネントのみをダウンロードしてアプリケーションを起動し、必要に応じて追加のファイルをオンデマンドで読み込むことでこの課題に対処します。ユーザーは、カスタムイメージのダウンロードが完了するまで数分待つことなく、数秒のうちに生産的な作業を開始でき、その間にバックグラウンドで環境の初期化が完了します。SOCI インデックス作成を使用するには、Finch CLI、nerdctl、または Docker with SOCI CLI などのツールを使用してカスタムコンテナイメージの SOCI インデックスを作成し、インデックス化されたイメージを Amazon Elastic Container Registry (ECR) にプッシュし、SageMaker イメージリソースの作成時にイメージインデックスの URI を参照してください。\n  SOCI インデックス作成は、Amazon SageMaker Studio が提供されているすべての AWS リージョンでご利用いただけます。SageMaker Studio カスタムイメージに SOCI インデックス作成を実装する方法の詳細については、Amazon SageMaker デベロッパーガイドの独自の SageMaker イメージの利用を参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "27a23143259aea74e95a84a3f57b835dde0bf31a",
      "title": "Amazon RDS のオブザーバビリティが強化され、スナップショットの Amazon S3 へのエクスポートが可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-rds-observability-snapshot-exports-s3",
      "pubDate": "2025-12-19T14:00:00.000Z",
      "contentSnippet": "Amazon Relational Database Service (RDS) のオブザーバビリティが強化され、Amazon S3 にスナップショットをエクスポートできるようになり、エクスポートの進行状況、失敗、および各タスクのパフォーマンスに関する詳細なインサイトが得られるようになりました。これらの通知により、エクスポートをより詳細にモニタリングし、予測可能性を高めることができます。\n  S3 へのスナップショットのエクスポートにより、RDS データベースのスナップショットから Apache Parquet 形式で Amazon S3 バケットにデータをエクスポートできます。今回のリリースでは、現在のエクスポートの進行状況や長時間実行されているテーブルのテーブルレベルの通知を含む 4 つの新しいイベントタイプが導入され、スナップショットのエクスポートパフォーマンスのより詳細な可視性と、エクスポート操作の問題のトラブルシューティングに関する推奨事項が提供されます。さらに、エクスポートされたテーブル数や保留中のテーブル数などのエクスポートの進行状況を、エクスポートされたデータサイズとともに表示できるため、操作とワークフローをより適切に計画できます。Amazon Simple Notification Service (SNS) を通じてこれらのイベントを登録すると、通知を受け取って、エクスポートされたイベントを AWS マネジメントコンソール、AWS CLI、または SDK で表示できます。\n  この機能は、RDS が一般利用可能なすべての商用リージョンの RDS PostgreSQL、RDS MySQL、および RDS MariaDB エンジンでご利用いただけます。\n  新しいイベントタイプについて詳しくは、RDS のイベントカテゴリを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "deb1d19b403cb1186fd4ba17da7b0eff920ffcb1",
      "title": "コスト配分タグによるアカウントタグのサポートを発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/cost-allocation-tags/",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "contentSnippet": "AWS は、AWS コスト管理製品におけるコスト配分タグによるアカウントタグのサポートを発表しました。これにより、複数のメンバーアカウントを持つお客様は、既存の AWS Organizations アカウントタグをコスト管理ツールで直接利用できるようになります。アカウントタグは AWS Organizations においてアカウントレベルで適用され、タグ付けされたアカウント内で測定されるすべての使用量に自動的に適用されます。これにより、AWS Cost Explorer、コストと使用状況レポート、AWS Budgets、Cost Categories で、個別のアカウントグループを手動で設定および管理する必要がなくなります。\n  アカウントタグのサポートにより、お客様は Cost Explorer およびコストと使用状況レポート (CUR 2.0 および FOCUS) でアカウントタグごとに直接コストを分析できます。お客様は、アカウント ID のリストを設定しなくても、アカウントのグループに AWS Budgets と AWS コスト異常検出アラートを設定できます。お客様は、アカウントタグの上に複雑なコストカテゴリを構築して、さらに詳細な分類を行うこともできます。アカウントタグを使用すると、タグ付けされないリソースのコスト配分が可能になります。これには、払い戻し、クレジット、リソースレベルでタグ付けできない特定のサービス料金などが含まれます。新規アカウントが組織に加わったり、既存のアカウントが削除されたりしても、お客様は関連するタグを追加または更新するだけで、変更がすべてのコスト管理製品に自動的に適用されます。使用を開始するには、お客様は AWS Organizations コンソールでアカウントにタグを適用してから、Billing and Cost Management コンソールの [コスト配分タグ] ページからそれらのアカウントタグを有効にします。この機能は、GovCloud (米国) リージョンと中国 (北京) と中国 (寧夏) リージョンを除くすべての AWS リージョンで一般提供されます。\n  詳しくは、AWS コスト配分タグを使用したコストの整理と追跡を参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "64692cc659f7616ec9fcdbb52ee23551a3d6eb22",
      "title": "Timestream for InfluxDB が再起動 API コールのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/timestream-influxdb-restart-api",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "contentSnippet": "Amazon Timestream for InfluxDB が InfluxDB バージョン 2 と 3 の両方で再起動 API の提供を開始しました。この新機能により、お客様は AWS マネジメントコンソール、API、または CLI を使用してデータベースインスタンスのシステム再起動を直接トリガーできるようになるため、時系列データベース環境の運用管理を合理化できます。\n  再起動 API により、お客様は耐障害性テストを実行してデータベース再起動時のアプリケーションの動作を検証し、サポートの介入なしで医療関連の問題に対処できます。この機能により、ミッションクリティカルなワークロードを管理する DevOps チームの運用上の柔軟性が強化されます。データベースインスタンスのライフサイクル運用を直接管理できるようになって、より包括的なテスト戦略を実装し、パフォーマンスの懸念に迅速に対応できるようになります。\n  Amazon Timestream for InfluxDB の再起動機能は、Timestream for InfluxDB が提供されているすべてのリージョンでご利用いただけます。\n  Amazon Timestream for InfluxDB 3 の使用を開始するには、Amazon Timestream for InfluxDB コンソールにアクセスしてください。詳細については、Amazon Timestream for InfluxDB ドキュメントおよび料金ページを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "5407be46b2aca5f32ca05a2b075dbf51ad23724d",
      "title": "セルフマネージドデータベースソース用のゼロ ETL が 7 つの新しいリージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/zero-etl-for-self-managed-databases-in-additional-regions",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "contentSnippet": "AWS Glue は、7 つの新しいリージョンでセルフマネージドデータベースソース用のゼロ ETL をサポートするようになりました。Glue のゼロ ETL を使用して、複雑な設定が排除されたシンプルな操作で、オンプレミスまたは AWS EC2 上にある Oracle、SQL Server、MySQL、PostgreSQL データベースから Redshift にデータを複製するための統合をセットアップできます。\n  セルフマネージドデータベースソース用の AWS ゼロ ETL は、シンプルでコード不要のインターフェイスを使用して、オンプレミスまたは EC2 のデータベースからの継続的なデータレプリケーション用の統合を自動的に作成します。Oracle、SQL Server、MySQL、PostgreSQL の各データベースから Redshift にデータをレプリケートできるようになりました。この機能により、ユーザーの運用上の負担がさらに軽減され、セルフマネージドデータベースから Redshift にデータを取り込むためのデータパイプラインの設計、構築、テストに必要な数週間のエンジニアリング作業の手間を省くことができます。\n  セルフマネージドデータベースソース用の AWS Glue ゼロ ETL が、新しくアジアパシフィック (香港)、アジアパシフィック (東京)、アジアパシフィック (シンガポール)、アジアパシフィック (シドニー)、欧州 (ロンドン)、南米 (サンパウロ)、米国 (バージニア) の AWS リージョンでご利用いただけるようになりました。使用を開始するには、AWS マネジメントコンソールにサインインしてください。詳細については、AWS Glue ページを参照するか、AWS Glue ゼロ ETL のドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "e7c5fc0f870af5301daca32c20e0c248ac162099",
      "title": "Amazon Redshift ODBC 2.x ドライバーが Apple macOS のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/redshift-odbc-2-x-driver-apple-macos/",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "contentSnippet": "Amazon Redshift ODBC 2.x ドライバーが Apple macOS をサポートするようになり、デベロッパーおよびアナリストのためにプラットフォームの互換性が拡張されました。この拡張機能により、Apple macOS ユーザーは最新の Amazon Redshift ODBC 2.x ドライバーバージョンを使用して Amazon Redshift クラスターに接続することができます。ODBC 接続を使用して、多くのサードパーティー SQL クライアントツールやアプリケーションから Amazon Redshift クラスターに接続できます。\n  Amazon Redshift ODBC 2.x のネイティブドライバーサポートにより、データ共有書き込み機能や Amazon IAM アイデンティティセンターの統合など、Amazon Redshift ドライバー経由でなければ利用できない Amazon Redshift 機能にアクセスできます。Apple macOS のネイティブサポートにより、抽出、変換、読み込み (ETL) およびビジネスインテリジェンス (BI) ツールとのシームレスな統合が可能になり、Amazon Redshift の全機能にアクセスしながら Apple macOS を使用できます。\n  最新の Amazon Redshift ODBC 2.x ドライバーバージョンにアップグレードして新機能にアクセスすることをお勧めします。インストール手順とシステム要件については、Amazon Redshift ODBC 2.x ドライバーのドキュメントを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "b1db203d963db2fddcf4d3e6f5be46682b28116a",
      "title": "Amazon Bedrock データオートメーションがドキュメントブループリント命令の最適化を開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/bedrock-data-automation-optimization-document-blueprints/",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "contentSnippet": "Amazon Bedrock Data Automation (BDA) はブループリント命令の最適化をサポートするようになりました。これにより、Ground Truth のラベルが付いた少数のサンプルドキュメントアセットを使用するだけで、カスタムフィールド抽出の精度を向上させることができます。BDA は、生成 AI を利用したアプリケーション向けに、ドキュメント、画像、音声、動画といった非構造化マルチモーダルコンテンツからのインサイトの生成を自動化します。ブループリント命令の最適化により、ブループリントの自然言語命令が自動的に改善されるため、モデルトレーニングやファインチューニングを行わなくても数分で本番環境対応の精度を達成できます。\n  ブループリント命令の最適化により、本番環境のワークロードから代表的なドキュメントアセットを最大 10 個取り出して、各フィールドに正しい期待値を提供できるようになりました。ブループリント命令の最適化は、期待される結果とデータオートメーションの推論結果の相違を分析し、自然言語命令を改善してサンプル全体の抽出精度を向上させます。インテリジェントなドキュメント処理アプリケーションでは、請求書の明細項目、契約条件、納税フォームのフィールド、医療請求コードなどの情報を抽出する精度を向上させることができるようになりました。最適化が完了すると、実際の状況に照らして測定された完全一致率や F1 スコアなどの詳細な評価指標が届き、ブループリントを本番環境にデプロイする準備が整ったことを確認できます。\n  ドキュメント用のデータオートメーションブループリント命令の最適化は、Amazon Bedrock データオートメーションがサポートされているすべての AWS リージョンでご利用いただけます。\n  詳細については、Bedrock Data Automation のユーザーガイドと Amazon Bedrock の料金ページをご覧ください。ブループリント命令の最適化を開始するには、Amazon Bedrock コンソールでブループリントに移動し、[データオートメーション] に移動し、ドキュメントのカスタム出力を選択して、[最適化を開始] を選択します。",
      "siteName": "AWS What's New"
    },
    {
      "id": "b4bad7fdb7a4b1da2ce4d7f522a4777df7de9e32",
      "title": "Amazon WorkSpaces Applications が Microsoft Windows Server 2025 のサポートを開始",
      "link": "https://aws.amazon.com/jpabout-aws/whats-new/2025/12/amazon-workspaces-applications-supports-microsoft-windows-server",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "contentSnippet": "Amazon WorkSpaces Applications は、Microsoft Windows Server 2025 を利用したイメージの提供を開始しました。これにより、お客様は Microsoft の最新のサーバーオペレーティングシステムから最新の機能や拡張機能を使用してストリーミングインスタンスを開始できます。このアップデートにより、アプリケーションストリーミング環境でセキュリティやパフォーマンスが向上し、最新の機能を利用できます。\n  Windows Server 2025 のサポートにより、Microsoft Windows 11 デスクトップエクスペリエンスをエンドユーザーに提供できるため、特定のアプリケーションやデスクトップストリーミングのニーズに適したオペレーティングシステムをより柔軟に選択できるようになります。ビジネスクリティカルなアプリケーションを実行している場合でも、専用ソフトウェアへのリモートアクセスを提供している場合でも、選択肢が広がって、独自のワークロード要件や組織の基準に合わせてインフラストラクチャを決定できるようになりました。AWS が提供するパブリックイメージから選択することも、Image Builder を使用して独自の要件に合わせたカスタムイメージを作成することもできます。\n  Microsoft Windows Server 2025 のサポートの一般提供が、Amazon WorkSpaces Applications が提供されているすべての AWS リージョンで開始しました。\n  Microsoft Windows Server 2025 イメージの使用を開始するには、Amazon WorkSpaces Applications のドキュメントを参照してください。料金の詳細については、Amazon WorkSpaces Applications の料金ページを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "15824a9b568044554d1846e29e16b225128220b2",
      "title": "AWS IoT がオブザーバビリティコストの最適化に役立つイベントベースのログ記録の提供を開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-iot-event-based-logging/",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "contentSnippet": "AWS IoT はイベントベースのログ記録のサポートを開始しました。これは、デベロッパーが Amazon CloudWatch のコストを削減すると同時にログ管理の効率を向上させる上で役立つ新機能です。この機能により、カスタマイズ可能なログレベルと Amazon CloudWatch ロググループの送信先を使用して、ターゲットを絞った個々のイベントのログ記録が可能になります。\n イベントベースのログ記録では、運用上の重要性に基づいて、さまざまなタイプの IoT イベントにさまざまなログレベルを設定できます。例えば、certificateProvider イベントには INFO レベルのログ記録を設定しながら、接続イベントなどの重要度の低いアクティビティには ERROR レベルのログ記録を維持できます。この詳細な設定により、あらゆるアクティビティが同じ詳細度レベルでログに記録されるというオーバーヘッドを回避しつつ、IoT 運用の包括的な可視性を維持し、コスト削減に役立てると同時にログの検索性と分析効率を向上させることができます。\n AWS IoT がサポートされているすべての AWS リージョンで、AWS IoT コンソール、CLI、API を使用してイベントレベルのログ記録を設定できるようになりました。イベントベースのログ記録の設定について詳しくは、AWS IoT デベロッパーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "6b9bdcdc95d0b7c1db2e9f7ee15c2ed6a7a61826",
      "title": "Amazon ECR がプッシュ時のリポジトリ作成のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ecr-creating-repositories-on-push/",
      "pubDate": "2025-12-19T08:00:00.000Z",
      "contentSnippet": "Amazon Elastic Container Registry (ECR) が、イメージプッシュ時のリポジトリの自動作成をサポートするようになりました。この新機能により、イメージのプッシュ時にリポジトリが存在しない場合は ECR によって自動的に作成されるようになり、コンテナイメージをプッシュする前にお客様がリポジトリを事前に作成する必要がなくなって、コンテナのワークフローが簡素化されます。これにより、お客様がイメージをプッシュすると、定義されたリポジトリ作成テンプレート設定に従って ECR が自動的にリポジトリを作成します。\n  プッシュ時の作成は、AWS のすべての商用リージョンと AWS GovCloud (米国) リージョンでご利用いただけます。リポジトリ作成テンプレートについて詳しくは、ドキュメントをご覧ください。Amazon ECR を使用したコンテナイメージとアーティファクトの保存、管理、デプロイや開始方法の詳細については、製品ページとユーザーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "a8e2f475b97552d6a1fde2c130fed82fc391daf5",
      "title": "Amazon EC2 がすべての API でアベイラビリティーゾーン ID をサポート",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-az-id-api-support",
      "pubDate": "2025-12-18T20:55:00.000Z",
      "contentSnippet": "Amazon EC2 はアベイラビリティーゾーン ID (AZ ID) パラメータをサポートするようになりました。これにより、一貫したゾーン識別子を使用してインスタンス、ボリューム、サブネットなどのリソースを作成および管理できます。AZ ID は、すべての AWS アカウントで同じ物理ロケーションを表す一貫性のある静的な識別子で、リソースの配置を最適化するのに役立ちます。\n  今回のリリース以前は、リソースの作成時に AZ 名を使用する必要がありましたが、これらの名前は物理的に異なる場所にマップされる可能性がありました。このマッピングにより、特に複数のアカウントで運用している場合に、リソースを常に同じ場所に配置することが困難になっていました。今後は、EC2 API で AZ ID パラメータを直接指定することで、リソースの一貫した配置を保証できます。AZ ID はすべてのアカウントで常に同じ物理的なロケーションを参照しているため、アカウント全体で AZ 名を手動でマッピングしたり、ゾーンの追跡や調整の煩雑さに対処したりする必要がなくなります。この機能は、インスタンス、起動テンプレート、ホスト、リザーブドインスタンス、フリート、スポットインスタンス、ボリューム、キャパシティ予約、ネットワークインサイト、VPC エンドポイントとサブネット、ネットワークインターフェイス、高速スナップショット復元、インスタンス接続などのリソースで利用できるようになりました。\n  この機能は、中国リージョンと AWS GovCloud (米国) リージョンを含むすべての AWS リージョンで利用できます。アベイラビリティーゾーン ID の詳細については、ドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "7b1751d6510eba88c158cb2c5cb32211df159690",
      "title": "Amazon Aurora が PostgreSQL 17.7、16.11、15.15、14.20、13.23 のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-aurora-postgresql-17-7-16-11-15-15-14-20-13-23",
      "pubDate": "2025-12-18T17:00:00.000Z",
      "contentSnippet": "Amazon Aurora PostgreSQL 互換エディションは、PostgreSQL バージョン 17.7、16.11、15.15、14.20、13.23 をサポートするようになりました。このアップデートには、PostgreSQL コミュニティの製品改善とバグ修正に加えて、Aurora 固有の機能強化も含まれています。\n  このリリースには、ブルー/グリーンデプロイの改善が含まれており、プライマリインスタンスでの新しいコミットが制限されることでスイッチオーバーの時間が短縮されました。また、クエリプラン管理 (QPM) も強化され、データベース復旧中のコミットログの読み込みを最適化することでインスタンスの復旧時間が短縮されました。\n  Amazon RDS マネジメントコンソールから数回のクリックで、新しい Aurora PostgreSQL 互換データベースを作成し、この最新バージョンを利用できます。既存のデータベースをアップグレードすることもできます。アップグレードについて詳しくは、Aurora のドキュメントをご確認ください。アップグレードの頻度やアップグレードプロセスの計画方法を決定する際には、Aurora バージョンポリシーを参照してください。今回の更新は、AWS のすべての商用リージョンと AWS GovCloud (米国) リージョンでご利用いただけます。\n  Amazon Aurora は MySQL および PostgreSQL との完全な互換性を備えており、圧倒的な高いパフォーマンスおよび可用性を世界規模で実現するように設計されています。このサービスは、組み込みのセキュリティ、継続的なバックアップ、サーバーレスコンピューティング、最大 15 のリードレプリカ、自動化されたマルチリージョンレプリケーション、AWS の他のサービスとの統合を提供します。Amazon Aurora の使用を開始するには、開始方法のページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "e6ccdfc10fb11a4aa8399e348fdd388ff6aaa00c",
      "title": "Amazon WorkSpaces Applications が Ubuntu Pro 24.04 LTS を利用した Elastic Fleet を発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-workspaces-ubuntu-elasticfleets",
      "pubDate": "2025-12-18T16:00:00.000Z",
      "contentSnippet": "Amazon WorkSpaces Applications は、Elastic Fleet で Ubuntu Pro 24.04 LTS をサポートするようになりました。これにより、独立系ソフトウェアベンダー (ISV) や中央 IT 組織は、AWS クラウドの柔軟性、スケーラビリティ、費用対効果を活用しながら、Ubuntu デスクトップアプリケーションをユーザーにストリーミングできるようになりました。\n  Amazon WorkSpaces Applications は、どこからでもデスクトップとアプリケーションに即座にアクセスできるようにする、セキュアなデスクトップとアプリケーションのフルマネージドストリーミングサービスです。Amazon WorkSpaces Applications 内では、Elastic Fleet は AWS マネージドのストリーミングインスタンスのプールからエンドユーザーにデスクトップアプリケーションをストリーミングできるようにするサーバーレスのフリートタイプで、使用量を予測したり、スケーリングポリシーを作成および管理したり、イメージを作成したりする必要はありません。Elastic Fleet タイプは、容量を管理したり、WorkSpaces Applications イメージを作成したりすることなく、アプリケーションをユーザーにストリーミングしたいお客様向けに設計されています。\n  使用を開始するには、WorkSpaces Applications 管理コンソールにサインインし、任意の AWS リージョンを 1 つ選択します。WorkSpaces Applications が利用可能なリージョンの一覧については、AWS リージョン表をご覧ください。Amazon WorkSpaces Applications は従量制料金です。詳細については、Amazon WorkSpaces Applications の料金を参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "6e10f59cf6c19a420643be74d3aa5a7eec22abcf",
      "title": "Amazon ECS マネージドインスタンスが Amazon EC2 スポットインスタンスをサポート",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ecs-managed-instances-ec2-spot-instances",
      "pubDate": "2025-12-18T15:00:00.000Z",
      "contentSnippet": "Amazon ECS マネージドインスタンスは Amazon EC2 スポットインスタンスをサポートするようになり、AWS マネージドインフラストラクチャで利用できる機能の範囲が広がりました。今回のリリースにより、AWS がインフラストラクチャ管理を担当する一方で、フォールトトレラントワークロードのオンデマンド価格と比較して最大 90％ の割引で予備の EC2 容量を活用できます。\n  ECS マネージドインスタンスは、インフラストラクチャ管理のオーバーヘッドを排除し、ワークロード要件に合わせてEC2インスタンスを動的にスケールし、タスク配置を継続的に最適化してインフラストラクチャコストを削減するように設計されたフルマネージドコンピューティングオプションです。vCPU の数、メモリサイズ、CPU アーキテクチャなどのタスク要件を定義するだけで、Amazon ECS が AWS 制御のアクセスを使用して AWS アカウント内で最適な EC2 インスタンスを自動的にプロビジョニング、設定、運用します。マネージドインスタンスのキャパシティープロバイダー設定で、GPU 高速化、ネットワーク最適化、バーストパフォーマンスなど、必要なインスタンスタイプを指定して、望ましいインスタンスファミリーでワークロードを実行することもできます。本日のリリースにより、キャパシティプロバイダー構成で新しいパラメーターである capacityOptionType を spot または on-demand として追加で設定できます。\n  EC2 スポットインスタンスのサポートは、Amazon ECS マネージドインスタンスが利用可能なすべての AWS リージョンで利用できます。Amazon EC2 のコストに加えて、プロビジョニングされたコンピューティングの管理料金が請求されます。ECS マネージドインスタンスの詳細については、機能ページ、ドキュメント、AWS ニュースリリースブログをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "f07a6fcd9cc1114bccf14be763dd4aab0a35f84d",
      "title": "Amazon EC2 C8a インスタンスが欧州 (スペイン) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-c8a-instances-europe-spain-region",
      "pubDate": "2025-12-18T15:00:00.000Z",
      "contentSnippet": "本日より、コンピューティング最適化 Amazon EC2 C8a インスタンスが欧州 (スペイン) リージョンで利用できるようになりました。C8a インスタンスは、最大周波数が 4.5 GHz の第 5 世代 AMD EPYC プロセッサ (旧コード名 Turin) を搭載しており、C7a インスタンスと比較してパフォーマンスが最大 30%、コスト効率が最大 19% 向上します。\n  C8a インスタンスは C7a インスタンスと比較して、メモリ帯域幅が 33% 広いため、レイテンシーの影響を受けやすいワークロードに理想的です。Amazon EC2 C7a インスタンスと比較すると、GroovyJVM の場合は最大 57% 高速になり、Java ベースのアプリケーションの応答時間が短縮されます。C8a インスタンスには、2 つのベアメタルサイズを含む 12 のサイズがあります。さまざまなインスタンスサイズが用意されているため、お客様はワークロード要件に正確に対応できます。\n  C8a インスタンスは AWS Nitro System 上に構築され、バッチ処理、分散分析、ハイパフォーマンスコンピューティング (HPC)、広告配信、高度にスケーラブルなマルチプレイヤーゲーム、ビデオエンコーディングなど、パフォーマンスが高く計算量の多いアプリケーションに最適です。\n  使用を開始するには、AWS マネジメントコンソールにサインインしてください。このインスタンスは、Savings Plans、オンデマンドインスタンス、スポットインスタンスでご購入いただけます。詳細については、Amazon EC2 C8a インスタンスのページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "674e22734d0d6265d44116fc72f747860a039d43",
      "title": "Amazon MSK Connect が新しいコネクタでデュアルスタック (IPv4 と IPv6) 接続をサポート",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-msk-connect-dual-stack-ipv-and-ipv/",
      "pubDate": "2025-12-18T15:00:00.000Z",
      "contentSnippet": "Amazon Managed Streaming for Apache Kafka (Amazon MSK) は、Amazon MSK Connect の新しいコネクタでデュアルスタック接続 (IPv4 と IPv6) をサポートするようになりました。この機能により、お客様は既存の IPv4 専用オプションに加えて、IPv4 プロトコルと IPv6 プロトコルの両方を使用して MSK Connect でコネクタを作成できます。これにより、お客様は IPv4 の互換性を維持しながら IPv6 環境向けにアプリケーションをモダナイズできるため、コンプライアンス要件への対応や将来のネットワークアーキテクチャへの準備が容易になります。\n  Amazon MSK Connect は、フルマネージド環境で Apache Kafka Connect コネクタをデプロイおよび運用できるようにするフルマネージドサービスです。以前は、MSK Connect のコネクタはすべての接続オプションで IPv4 アドレスしかサポートしていませんでした。この新機能により、お客様は Amazon MSK コンソール、AWS CLI、SDK、または CloudFormation を使用して、コネクタの作成時にネットワークタイプパラメータを設定することで、新しいコネクタでデュアルスタック接続 (IPv4 と IPv6) を有効にできるようになりました。MSK Connect のすべてのコネクタは、新しいコネクタの作成時にデュアルスタックを明示的に選択しない限り、デフォルトで IPv4 のみの接続を使用します。既存のコネクタは引き続き IPv4 接続を使用します。これを変更するには、コネクタを削除して再作成する必要があります。\n  MSK Connect の新しいコネクタのデュアルスタック接続は、Amazon MSK Connect が利用可能なすべての AWS リージョンで、追加料金なしで利用できるようになりました。Amazon MSK のデュアルスタックのサポート詳細については、Amazon MSK デベロッパーガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "3a9ca41506f48af04027b3a629304cf68d95ca59",
      "title": "Amazon WorkSpaces が IPv6 をサポート",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-workspaces-ipv6/",
      "pubDate": "2025-12-18T15:00:00.000Z",
      "contentSnippet": "Amazon WorkSpaces は WorkSpaces ドメインと外部エンドポイントで IPv6 をサポートするようになりました。これにより、ユーザーは互換性のあるクライアントから IPv4/IPv6 デュアルスタック構成を介して接続できるようになりました (SAML 認証を除く)。これは、お客様が IPv6 のコンプライアンス要件を満たすのに役立ち、IPv4 と IPv6 間のアドレス変換を処理するための高価なネットワーク機器が不要になります。\n  WorkSpaces のデュアルスタックサポートは、IPv4 よりもはるかに大きなアドレス空間を提供することで、IP アドレスに対するインターネットの需要の高まりに対応します。これにより、仮想プライベートクラウド (VPC) 内で重複するアドレス範囲を管理する必要がなくなります。お客様は、既存の IPv4 システムとの下位互換性を維持しながら、IPv4 プロトコルと IPv6 プロトコルの両方をサポートするデュアルスタックを通じて WorkSpaces をデプロイできます。また、お客様は IPv6 経由で PrivateLink VPC エンドポイントを介して WorkSpaces に接続できるため、パブリックインターネット経由でトラフィックをルーティングすることなく、プライベートにサービスにアクセスできます。\n  IPv4/IPv6 デュアルスタック構成による Amazon WorkSpaces への接続は、AWS GovCloud (米国東部および米国西部) リージョンを含め、Amazon WorkSpaces が利用可能なすべての AWS リージョンでサポートされています。この機能に追加費用は発生しません。\n  IPv6 を有効にするには、Windows、macOS、Linux、PCoIP ゼロクライアント、またはウェブアクセス用の最新の WorkSpaces クライアントアプリケーションを使用する必要があります。Amazon WorkSpaces での IPv6 サポートの詳細については、Amazon WorkSpaces 管理ガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "1a6551300d9086ca66dd6d4c4b08690a0bb863d9",
      "title": "AWS IoT Core が HTTP ルールアクションにメッセージのバッチ処理を追加",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-iot-core-message-batching-http-rule-action",
      "pubDate": "2025-12-18T15:00:00.000Z",
      "contentSnippet": "AWS IoT Core では、メッセージをダウンストリームの HTTP エンドポイントにルーティングする前に、複数の IoT メッセージを 1 つの HTTP ルールアクションにまとめることができるようになりました。この拡張機能により、IoT ワークロードからテレメトリを取り込む際のコストとスループットのオーバーヘッドを削減できます。\n  AWS IoT Core は、数百万台の IoT デバイスを AWS クラウドに安全に接続するフルマネージド型サービスです。AWS IoT のルールを使用すると、デバイスデータをフィルタリング、処理、デコードし、データを HTTP エンドポイントにルーティングする HTTP ルールアクションなど、20 種類以上の AWS IoT ルールアクションを介して AWS サービスまたはサードパーティのエンドポイントにそのデータをルーティングできます。この新機能により、メッセージのデータセットをダウンストリームの HTTP エンドポイントにルーティングする前に、メッセージをバッチ処理できるようになりました。\n  新しいバッチ機能を使用して IoT メッセージを効率的に処理するには、IoT デバイスを AWS IoT Core に接続し、目的のバッチパラメータを使用して HTTP ルールアクションを定義します。その後、AWS IoT Core はその仕様に従って受信メッセージを処理し、指定された HTTP エンドポイントにメッセージをルーティングします。たとえば、複数のスマートホームデバイスから公開された IoT メッセージを 1 つのバッチにまとめて、スマートホームプラットフォームの HTTP エンドポイントにルーティングできるようになります。\n  この新機能は、AWS GovCloud (米国) と Amazon 中国リージョンを含む、AWS IoT Core が利用可能なすべての AWS リージョンで利用できます。詳細については、デベロッパーガイド、料金ページ、API ドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "6aa02e327c76f951b4edd03dd5b5b115ad09fa00",
      "title": "AWS Clean Rooms が既存のコラボレーションの変更リクエストをサポート",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/clean-rooms-change-requests-existing-collaborations/",
      "pubDate": "2025-12-18T08:00:00.000Z",
      "contentSnippet": "AWS Clean Rooms は、既存のコラボレーション設定を変更する変更リクエストをサポートするようになりました。これにより、お客様はコラボレーションの管理およびパートナーとの新しいユースケース開発をより柔軟に行うことができるようになります。この新機能により、新しいメンバーの追加、メンバー権限の更新、コラボレーションの自動承認設定の変更など、コラボレーションに関する変更リクエストを送信できます。セキュリティを維持するために、更新が有効になるにはすべてのコラボレーションメンバーが変更リクエストを承認する必要があり、既存のプライバシーコントロールは確実に保護されます。透明性を高めるため、すべての変更リクエストは変更履歴に記録され、メンバーが確認できるようになります。たとえば、パブリッシャーが広告主と Clean Rooms コラボレーションを行う場合、パブリッシャーは広告主のマーケティングエージェンシーを新しいメンバーとして追加し、このメンバーは分析結果をアカウントで直接受け取ることができます。これにより、インサイトを得るまでの時間が短縮され、パブリッシャーとのキャンペーン最適化を合理化できます。このアプローチにより、お客様とパートナーの既存のプライバシーコントロールを維持しながら、オンボーディング時間を短縮できます。\n  AWS Clean Rooms を利用すると、お客様は安全なデータクリーンルームを数分で作成でき、AWS または Snowflake 上で他の企業と協力して、広告キャンペーン、投資についての意思決定、および研究開発に関する独自のインサイトを得ることができます。AWS Clean Rooms を利用できる AWS リージョンの詳細については、AWS リージョン表をご覧ください。AWS Clean Rooms を使用したコラボレーションの詳細については、AWS Clean Rooms をご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "aa5c065dd6d64bf0a5912241247a3e3ad1f23158",
      "title": "Amazon MSK が Apache Kafka v3.9 を使用する Express ブローカー向けの KRaft サポートを導入",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-msk-express-brokers-support-kraft/",
      "pubDate": "2025-12-18T08:00:00.000Z",
      "contentSnippet": "Amazon Managed Streaming for Apache Kafka (MSK) で、Express ブローカー向けに Apache Kafka バージョン 3.9 がサポートされるようになりました。このリリースでは、メタデータ管理のための Apache ZooKeeper への依存を排除する Apache Kafka の新しいコンセンサスプロトコルである KRaft (Kafka Raft) のサポートが導入されました。KRaft は、Kafka クラスター内のメタデータ管理を外部の Apache ZooKeeper ノードから Kafka 内のコントローラーのグループに移行します。この変更により、メタデータを Kafka ブローカー内でトピックとして保存およびレプリケートできるようになり、メタデータの伝播速度が上がります。\n \nKafka v3.9を使用して作成された新しい Express ブローカークラスターは、メタデータ管理モードとして自動的に KRaft を使用するため、最初からこの最新のアーキテクチャのメリットを享受できます。既存のクラスターを v3.9 にアップグレードする機能は、今後のリリースで利用可能になる予定です。\n \nKafka v3.9 を利用する Amazon MSK Express ブローカーは、MSK Express がサポートされているすべての AWS リージョンでご利用いただけます。使用を開始するには、新しい Express ブローカークラスターを作成し、AWS マネジメントコンソールで、または AWS CLI あるいは AWS SDK を使用して Kafka バージョン 3.9 を選択します。",
      "siteName": "AWS What's New"
    },
    {
      "id": "93a8950f92910ca745aece3eb39b702a0ec5ec09",
      "title": "Amazon ECS で AWS Fargate でのタスク廃止をスケジュールするための週次イベントウィンドウが定義可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ecs-weekly-windows-scheduling-task-retirements-fargate/",
      "pubDate": "2025-12-18T08:00:00.000Z",
      "contentSnippet": "Amazon ECS では、AWS Fargate でタスクの廃止をスケジュールするための週次イベントウィンドウを定義できるようになりました。この機能により、インフラストラクチャの更新やタスクの置き換えをいつ行うかを正確に制御できるため、業務時間のピーク時にミッションクリティカルなワークロードが中断されるのを防ぐことができます。\n  AWS Fargate は、サーバーレスで従量制料金のコンピューティングエンジンであり、サーバーを管理することなくアプリケーションの構築に集中することができます。AWS 責任共有モデルの一環として、Fargate はプラットフォームを定期的に更新して基盤となるインフラストラクチャを維持しています。Fargate はこれらの更新に合わせて自動的にタスクを廃止し、今後のタスクの廃止についてメールと AWS Health Dashboard で通知します。デフォルトでは、タスクは通知から 7 日後に廃止されますが、fargateTaskRetirementWaitPeriod アカウント設定を構成して、廃止期間を 14 日間に延長したり、即時廃止 (0 日) を開始したりできます。以前は、タスクの廃止通知と待機期間を使用して自動化を構築し、サービスの更新やタスクの置き換えを自分のペースで実行できました。本日のリリースにより、Amazon EC2 イベントウィンドウインターフェイスを使用して毎週のイベントウィンドウを定義し、Fargate タスクが廃止されるタイミングを正確に制御できるようになりました。たとえば、週末にのみ廃止が発生するように設定することで、平日に高い稼働時間を必要とするミッションクリティカルなサービスのタスク廃止をスケジュールできます。\n  使用を開始するには、AWS アカウント設定の fargateEventWindows を 1 回限りのセットアップとして有効に設定してください。有効にしたら、時間範囲を指定して Amazon EC2 イベントウィンドウを設定し、関連ターゲットとして Amazon ECS 管理タグを選択して、イベントウィンドウを ECS タスクに関連付けます。ECS クラスター内のタスクをターゲットにする場合は aws:ecs:clusterArn タグ、ECS サービスの場合は aws:ecs:serviceArn タグ、すべての Fargate タスクにウィンドウを適用する場合は aws:ecs:fargateTask を値を true に設定して使用します。この機能は、すべての商用 AWS リージョンでご利用いただけるようになりました。詳細については、ドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "383e09f3577d48b5a999b075b6599441c0c5f6d2",
      "title": "AWS Control Tower の 176 個の新しい AWS Security Hub コントロールの発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/176-security-hub-controls-control-tower/",
      "pubDate": "2025-12-18T08:00:00.000Z",
      "contentSnippet": "本日、AWS は、AWS Control Tower の Control Catalog において、セキュリティ、コスト、耐久性、運用などのさまざまなユースケースに対応する 176 個の Security Hub コントロールを新たにサポートすることを発表しました。今回のリリースにより、これらの追加コントロールを AWS Control Tower から直接、検索、検出、有効化、管理でき、マルチアカウント環境においてより多くのユースケースを管理できるようになりました。\n  使用を開始するには、AWS Control Tower で Control Catalog に移動し、[コントロールオーナー] フィルターが AWS Security Hub に設定されているコントロールを検索すると、Catalog にあるすべての AWS Security Hub コントロールが表示されます。目的に合致するコントロールが見つかったら、AWS Control Tower コンソールからそのコントロールを直接有効にできます。また、ListControls API、GetControl API、EnableControl API を使用することもできます。\n  新しい AWS Config ルールは、AWS GovCloud (米国) を含む AWS Control Tower が利用可能なすべての AWS リージョンで検索できます。ルールをデプロイする場合は、そのルールがサポートされているリージョンのリストを参照して、有効化できるかどうかをご確認ください。詳細については、AWS Control Tower ユーザーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "fece98e93a60a5edaf50aadd1700c7cb1593245a",
      "title": "Amazon SES がメール検証を発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ses-email-validation/",
      "pubDate": "2025-12-18T08:00:00.000Z",
      "contentSnippet": "本日、Amazon Simple Email Service (SES) はメール検証機能を発表しました。これは、送信前にメールアドレスを検証することで、お客様がバウンス率を減らし、送信者の評判を保護するのに役立つ新機能です。お客様は、API コールを使用して個々のアドレスを検証したり、すべての送信メールの自動検証を有効にしたりできます。\n \nメール検証は、送信者の評判を損なう可能性のある無効なアドレスを特定することで、お客様がリストの衛生状態を維持し、バウンスを減らし、配信を改善するのに役立ちます。API は、構文チェックや DNS レコードなどの詳細な検証情報を提供します。自動検証を有効にすると、SES はすべての送信メールアドレスを自動的に確認するようになり、コードの変更はいっさい必要ありません。自動検証は、AWS コンソールのシンプルなトグルを使用してアカウントレベルまたは構成セットレベルで設定できるため、既存のワークフローとシームレスに統合できます。\n \nメールの検証は、Amazon SES が利用可能なすべての AWS リージョンで利用できます。\n \n詳細については、Amazon SES デベロッパーガイドでメール検証に関するドキュメントを参照してください。メール検証の使用を開始するには、Amazon SES コンソールにアクセスしてください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "ac5f30808ef878536268ffed26474cabfc2d8ef6",
      "title": "Amazon EC2 の R8i および R8i-flex インスタンスを利用できる AWS リージョンが拡大",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-r8i-r8i-flex-instances-additional-regions/",
      "pubDate": "2025-12-18T08:00:00.000Z",
      "contentSnippet": "本日より、Amazon Elastic Compute Cloud (Amazon EC2) の R8i および R8i-flex インスタンスをアジアパシフィック (ソウル)、南米 (サンパウロ)、アジアパシフィック (東京) の各リージョンでご利用いただけます。これらのインスタンスは、AWS でのみ利用可能なカスタム Intel Xeon 6 プロセッサを搭載しており、クラウド内の同等の Intel プロセッサの中で最高のパフォーマンスと最速のメモリ帯域幅を提供します。R8i インスタンスと R8i-flex インスタンスは、前世代の Intel ベースのインスタンスと比較して、コストパフォーマンスが最大 15% 向上し、メモリ帯域幅も 2.5 倍向上しています。R7i インスタンスと比較した場合、パフォーマンスは 20% 向上し、特定のワークロードではさらに高いパフォーマンスが実現します。また、R7i インスタンスと比較して、PostgreSQL データベースでは最大 30%、NGINX ウェブアプリケーションでは最大 60%、AI 深層学習レコメンデーションモデルでは最大 40%高速化されます。\n  R8i-flex は、AWS 初のメモリ最適化 Flex インスタンスです。メモリ負荷の高いほとんどのワークロードにおいて、最も手軽にコストパフォーマンスの利点を得られる選択肢です。large から 16xlarge までの非常に一般的なサイズを提供しており、すべてのコンピューティングリソースをフルに活用しきれていないアプリケーションに最適な選択肢です。\n  R8i インスタンスは、メモリ負荷の高いワークロード全般に適しています。特に、最大のインスタンスサイズや継続的に高い CPU 使用率を必要とするワークロードに最適です。R8i インスタンスは、13 種類のサイズで提供されています。そのうち 2 つはベアメタルサイズで、大規模なアプリケーションに対応する新しいサイズ 96xlarge も追加されています。R8i インスタンスは、SAP 認定を受けており、オンプレミス環境とクラウド環境の同等のマシンにおいて最高となる 142,100 個の aSAPS を達成しています。そのため、ミッションクリティカルな SAP ワークロードにおいて優れたパフォーマンスを発揮します。\n  使用を開始するには、AWS マネジメントコンソールにサインインしてください。このインスタンスは、Savings Plans、オンデマンドインスタンス、スポットインスタンスでご購入いただけます。この新しい R8i と R8i-flex のインスタンスの詳細については、AWS ニュースブログをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "b83f87b05b92720f4555696690fee9dc926a3301",
      "title": "AWS Direct Connect が AWS Fault Injection Service による耐障害性テストのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/direct-connect-resilience-testing-fault-injection-service/",
      "pubDate": "2025-12-18T08:00:00.000Z",
      "contentSnippet": "AWS Direct Connect が、AWS Fault Injection Service (FIS) による耐障害性テストのサポートを開始しました。FIS は、制御されたフォールトインジェクション実験を行ってアプリケーションのパフォーマンス、オブザーバビリティ、耐障害性を高めるためのフルマネージド型サービスです。この機能により、仮想インターフェイス上のボーダーゲートウェイプロトコル (BGP) セッションが中断されたときにアプリケーションがどのように反応するかをテストおよび観察し、耐障害性メカニズムを検証できます。\n  この新機能を使用して、制御された環境でアプリケーションが Direct Connect BGP フェイルオーバーをどのように処理するかをテストできます。たとえば、プライマリ仮想インターフェイスの BGP セッションが中断され、アプリケーションが想定どおりに機能し続けた場合、トラフィックが冗長仮想インターフェイスにルーティングされたことを検証できます。この機能は、ネットワーク接続の維持にフェイルオーバーが不可欠な Direct Connect アーキテクチャを積極的にテストする場合に特に役立ちます。\n  この新しいアクションは、AWS FIS が提供されているすべての AWS 商用リージョンで利用できます。詳細については、AWS FIS 製品ページと Direct Connect FIS アクションのユーザーガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "c5d0dfdcb8c8a03f39e7f553f3cb5f946a5bbe48",
      "title": "Amazon Neptune Database が AWS の欧州 (チューリッヒ) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-neptune-zurich-region",
      "pubDate": "2025-12-18T08:00:00.000Z",
      "contentSnippet": "Amazon Neptune Database のエンジンバージョン 1.4.5.0 以降が欧州 (チューリッヒ) リージョンで利用可能になりました。AWS の欧州 (チューリッヒ) リージョンで R5、R5d、R6g、R6i、X2iedn、T4g、T3 インスタンスタイプを使用して Neptune クラスターを作成できるようになりました。\n  Amazon Neptune Database は高速かつ信頼性の高いフルマネージド Graph Database as a Service です。このサービスでは、高度に接続されたデータセットと連携するアプリケーションを簡単に構築および実行できます。Property Graph モデルで Apache TinkerPop Gremlin または openCypher を使用するか、W3C Resource Description Framework (RDF) で SPARQL クエリ言語を使用してアプリケーションを構築できます。また Neptune は高可用性、自動バックアップ、ネットワーク分離などのエンタープライズ機能を提供し、お客様がアプリケーションを本番環境に迅速にデプロイできるようにします。\n  使用を開始するには、AWS マネジメントコンソール、AWS CLI、またはクイックスタート AWS CloudFormation テンプレートを使用することで、新しい Neptune クラスターを作成できます。料金と利用可能なリージョンについては、Neptune の料金ページと AWS リージョン表を参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "d701fd9d7ee861857d4893afc11d890d2becf24a",
      "title": "AWS Lambda の永続関数が新たに 14 の AWS リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/lambda-durable-functions-14-additional-regions/",
      "pubDate": "2025-12-18T08:00:00.000Z",
      "contentSnippet": "AWS Lambda の永続関数は、デベロッパーが Lambda の開発エクスペリエンスの中で信頼性の高いマルチステップアプリケーションや AI ワークフローを構築できるようにします。本日より、米国東部 (バージニア北部)、米国西部 (オレゴン)、欧州 (アイルランド)、欧州 (フランクフルト)、欧州 (ミラノ)、欧州 (ストックホルム)、欧州 (スペイン)、アジアパシフィック (シドニー)、アジアパシフィック (香港)、アジアパシフィック (東京)、アジアパシフィック (シンガポール)、アジアパシフィック (ムンバイ)、アジアパシフィック (マレーシア)、アジアパシフィック (タイ) の 14 の AWS リージョンで新たに永続関数が利用できるようになりました。\n  Lambda の永続関数は、イベントハンドラーに「steps」や「waits」などの新しいプリミティブを追加して Lambda プログラミングモデルを拡張します。これにより、オンデマンド関数の計算料金を発生させることなく、進行状況のチェックポイント、障害からの自動回復、実行の一時停止が可能になります。今回のリージョン拡大により、注文ワークフロー、ユーザーオンボーディング、AI 支援タスクなどの複雑なプロセスをユーザーとデータの近くでオーケストレーションできるため、単一のサーバーレスプログラミングモデルで標準化しながら、低レイテンシーとデータレジデンシーの要件を満たすことができます。\n  AWS Lambda API、AWS マネジメントコンソール、または AWS SDK を使用して、新しい Python (バージョン 3.13 と 3.14) または Node.js (バージョン 22 と 24) ベースの Lambda 関数で永続関数をアクティブにできます。AWS Cloud Formation、AWS サーバーレスアプリケーションモデル (AWS SAM)、AWS Cloud Development Kit (AWS CDK) などの Infrastructure as Code (IaC) ツールを使用することもできます。\n  永続関数の詳細については、AWS Lambda デベロッパーガイドをご覧ください。料金については、AWS Lambda の料金をご覧ください。最新のリージョン対応状況については、AWS 機能 (リージョン別) ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "a650ac43305983a4051eb34a1146d22c2046ef3e",
      "title": "Amazon WorkSpaces Applications が追加の正常性とパフォーマンスのメトリクスを発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-workspaces-applications-health-performance-metrics",
      "pubDate": "2025-12-17T18:00:00.000Z",
      "contentSnippet": "本日、Amazon WorkSpaces Applications は、フリート、セッション、インスタンス、ユーザーの正常性とパフォーマンスをモニタリングする新しい Amazon CloudWatch メトリクスのセットを発表しました。管理者やサポート操作の担当者は、フリートル全体のモニタリングを Amazon CloudWatch コンソールから簡単に有効にできます。これらのメトリクスはトラブルシューティングを簡略化し、重要なパフォーマンスメトリクスの最新状態を反映するための動的な更新も実行します。\n  ユーザーは、利用可能なメトリクスのパフォーマンスしきい値を、パフォーマンスや予算の条件に合致するように設定すると、サイズ設定やエンドユーザーのストリーミングインスタンスについて情報に基づいた決定を下すことができます。インスタンスとセッションのパフォーマンスメトリクスを参照すると、エンドユーザーのストリーミングセッションに関連した問題をトラブルシューティングできます。\n  フリートインスタンスに対してこの機能を有効にするには、2025 年 12 月 6 日以降にリリースされた最新のエージェントを使用している WorkSpaces Applications イメージか、2025 年 12 月 5 日以降にリリースされたマネージド WorkSpaces Applications イメージの更新を使用して更新された WorkSpaces Applications イメージを使用する必要があります。\n \nこれらの CloudWatch メトリクスは、現在 Amazon WorkSpaces Applications が利用可能なすべての AWS 商用リージョンと AWS GovCloud (米国) リージョンで利用できます。使用を開始する場合や、詳細を知りたい場合は、Amazon WorkSpaces Applications のメトリクスとディメンションに関するドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "2c0e8beddaf11091630ec57ca0067cc556ae7a4c",
      "title": "Vercel マーケットプレイスで AWS データベースが入手可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-databases-are-available-on-the-vercel/",
      "pubDate": "2025-12-17T18:00:00.000Z",
      "contentSnippet": "現在 Vercel マーケットプレイスで、Amazon Aurora PostgreSQL、Amazon Aurora DSQL、Amazon DynamoDB を含む AWS データベースが一般提供中なので、Vercel から直接 AWS データベースを数秒で作成して接続できます。\n  使用を開始するには、Vercel から新しい AWS アカウントを作成できます。このアカウントには、3 つのデータベースへのアクセス権と 100 USD のクレジットが含まれます。このクレジットは、これらのどのデータベースオプションでも最長 6 か月間使用できます。アカウントを設定すると、数秒で本番対応の Aurora データベースや DynamoDB テーブルを使用して Vercel プロジェクトを稼働できるようになります。また、Vercel ダッシュボードから AWS 設定ポータルにアクセスして、プランの管理、支払い情報の追加、使用状況の詳細の表示をいつでも行うことができます。詳細については、Vercel マーケットプレイスの AWS のランディングページをご覧ください。\n  この統合には、Amazon Aurora PostgreSQL、Amazon Aurora DSQL、Amazon DynamoDB のサーバーレスオプションが含まれており、アプリケーションのニーズを簡略化し、使用していないときにゼロにスケーリングしてコストを削減することができます。データベースは、米国東部 (バージニア北部)、米国東部 (オハイオ)、米国西部 (オレゴン)、欧州 (アイルランド)、欧州 (フランクフルト)、アジアパシフィック (東京)、アジアパシフィック (ムンバイ) の各 AWS リージョンで作成でき、今後さらにリージョンが追加される予定です。\n  AWS データベースは、次なる大きなアイデアのプロトタイプを作成する場合でも、本番環境で AI やデータ駆動型アプリケーションを実行する場合でも、運用上のオーバーヘッドなしでセキュリティ、信頼性、コストパフォーマンスを向上させます。詳細については、AWS データベースのウェブページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "b709f05943046f9ecbf4fe02cb06335409836d0b",
      "title": "Amazon EC2 M8Gn および M8GB インスタンスの一般提供を開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/generally-available-amazon-ec2-m8gn-m8gb-instances",
      "pubDate": "2025-12-17T18:00:00.000Z",
      "contentSnippet": "AWS は本日、新しい Amazon Elastic Compute Cloud (Amazon EC2) M8gn および M8gb インスタンスの一般提供を開始しました。このインスタンスは AWS Graviton4 プロセッサを搭載しており、AWS Graviton3 プロセッサと比較して最大 30% 優れたコンピューティングパフォーマンスを発揮します。M8gn インスタンスには最新の第 6 世代 AWS Nitro Card が搭載されており、最大 600 Gbps のネットワーク帯域幅を提供します。これは、ネットワーク最適化 EC2 インスタンスの中で最も高いネットワーク帯域幅です。M8gb は、最大 150 Gbps の EBS 帯域幅で、同じサイズの同等の Graviton4 ベースインスタンスよりも高い EBS パフォーマンスを実現します。\n  M8gn は、高性能ファイルシステム、分散ウェブスケールインメモリキャッシュ、キャッシングフリート、リアルタイムのビッグデータ分析、5G User Plane Function (UPF) などの通信事業者アプリケーションのような、ネットワーク集約型のワークロードにとって最適です。M8gb は、ハイパフォーマンスデータベースや NoSQL データベースのような、高いブロックストレージパフォーマンスが必要なワークロードにとって最適です。\n \nM8gn インスタンスでは、最大 48xlarge、最大 768 GiB メモリ、最大 600 Gbps のネットワーク帯域幅、Amazon Elastic Block Store (EBS) への最大 60 Gbps の帯域幅までのインスタンスサイズが用意されています。また 16xlarge、24xlarge、48xlarge のサイズの EFA ネットワークをサポートしています。\n  M8gb インスタンスでは、最大 24xlarge、最大 768 GiB メモリ、最大 150 Gbps の EBS 帯域幅、最大 200 Gbps のネットワーク帯域幅までのサイズが用意されています。これは 16xlarge と 24xlarge のサイズの Elastic Fabric Adapter (EFA) ネットワークをサポートしています。これにより、密結合のクラスター上にデプロイされたワークロードのレイテンシーを低減し、クラスターのパフォーマンスを改善できます。\n \nこの新しいインスタンスは、米国東部 (バージニア北部) と米国西部 (オレゴン) の AWS リージョンで利用できます。\n  詳細については、Amazon EC2 M8Gn および M8GB インスタンスに関するページを参照してください。Graviton の利用を開始するには、「AWS Graviton でコンピューティングをレベルアップする」ページにアクセスしてください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "7fbdb3f01a4f4f0465b3ebb7330a329db09a3ce7",
      "title": "Amazon Aurora が Amazon RDS データベースプレビュー環境で PostgreSQL 18.1 のサポートを開始 ",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-aurora-postgresql-18-1-rds-database-preview",
      "pubDate": "2025-12-17T17:00:00.000Z",
      "contentSnippet": "Amazon Aurora PostgreSQL 互換エディションでは、Amazon RDS データベースプレビュー環境で PostgreSQL バージョン 18.1 のサポートを開始しました。これにより、Amazon Aurora PostgreSQL で PostgreSQL 18.1 を評価できます。PostgreSQL 18.1 は、2025 年 9 月 9 日に PostgreSQL コミュニティによってリリースされました。 \n  PostgreSQL 18.1 では、複数列の B ツリーインデックスに対する「スキップスキャン」がサポートされており、OR 条件および IN 条件の WHERE 句の処理が改善されています。また、並列 GIN インデックスの構築が導入され、結合操作が更新されています。オブザーバビリティの改善により、クエリ実行中のバッファ使用回数とインデックスルックアップ、および接続ごとの I/O 使用状況のメトリクスが表示されます。PostgreSQL 18.1 の詳細については、 こちらをご覧ください。\n  \n RDS データベースプレビュー環境のデータベースインスタンスでは、Aurora PostgreSQL データベースソフトウェアのプレビューバージョンを手動インストール、プロビジョニング、管理することなく、新しいデータベースエンジンをテストできます。クラスターは最大 60 日間保持された後、この保持期間後に自動的に削除されます。Amazon RDS データベースプレビュー環境のデータベースインスタンスの料金は、米国東部 (オハイオ) リージョンで作成された本番環境の Aurora インスタンスと同じです。\n  \n Amazon Aurora は MySQL および PostgreSQL との完全な互換性を備えており、圧倒的な高いパフォーマンスおよび可用性を世界規模で実現するように設計されています。このサービスは、組み込みのセキュリティ、継続的なバックアップ、サーバーレスコンピューティング、最大 15 のリードレプリカ、自動化されたマルチリージョンレプリケーション、AWS の他のサービスとの統合を提供します。Amazon Aurora の使用を開始するには、開始方法のページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "7e4119e1de10b1e1364a2b4c2580a95d7289a608",
      "title": "AWS が AWS Billing Conductor 向けのカスタム明細の管理の強化を発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/enhanced-custom-line-item-controls-aws-billing-conductor",
      "pubDate": "2025-12-17T16:00:00.000Z",
      "contentSnippet": "本日より、AWS Billing Conductor でカスタム明細項目の使用時の柔軟性が向上します。\n  1 つの AWS サービスか選択した AWS サービスのセットを対象とするサービス固有のカスタム明細項目を作成できるようになりました。また、請求ページ、Cost Explorer、コストと使用状況レコードなどのプロフォーマの請求アーティファクトでこれらの明細項目がどのように表示されるか選択できます。\n  これらの機能強化により、お客様の料金体系をより的確に反映した、より正確な調整済みのチャージバックと再請求の戦略を作成し、プロフォーマのユーザーの追跡可能性に関する環境を向上させることができます。この機能を使用して、Saving Plans の料金に割引率を適用したり、AWS サポートのサービスに基づいて共有の均一なサポート料金を割り当てたりできます。サービス固有のカスタム明細項目は、選択した料金プランのタイプに関係なく標準的な請求グループで使用できます。ただし、お客様が管理する料金プランを選択すると、請求転送の請求グループでのみ使用できます。\n  まず、AWS Billing Conductor コンソールまたは API を使用してカスタムの明細項目を作成し、コスト参照値 (1 つまたは複数の AWS サービス) と表示設定オプション (選択したサービスに基づいて項目別または一括) を指定します。 カスタム明細項目の詳細については、 AWS Billing Conductor に関するドキュメントをご覧ください。\n  この機能は、Sinnet 運営の AWS 中国 (北京) リージョン、NWCD 運営の AWS 中国 (寧夏) リージョンを除く、すべての AWS 商用リージョンでご利用いただけるようになりました。",
      "siteName": "AWS What's New"
    },
    {
      "id": "3171085d34f21ebc5916e03fb3e4acd8f1bbf30f",
      "title": "EC2 Auto Scaling で Auto Scaling グループ内のインスタンスを起動するための同期 API の提供を開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-auto-scaling-synchronous-api-launch-instances-auto-scaling-group",
      "pubDate": "2025-12-17T15:00:00.000Z",
      "contentSnippet": "本日、EC2 Auto Scaling は LaunchInstances という新しい API をリリースします。これにより、お客様は EC2 Auto Scaling がインスタンスをプロビジョニングする方法をより柔軟に制御できると同時に、利用可能なキャパシティに関するフィードバックを即座に得ることができます。\n  EC2 Auto Scaling は自動フリート管理に使用されています。スケーリングポリシーに従い、EC2 Auto Scaling は、需要が急増した場合は自動的にインスタンスを追加し、トラフィックが減少した場合はインスタンスを削除できるため、お客様のアプリケーションに常に適切な量のコンピューティングを確保できます。EC2 Auto Scaling には、異常なインスタンスを監視して置き換える機能もあります。特定のユースケースで、お客様が EC2 Auto Scaling が追加のインスタンスを起動する場所を正確に指定したい場合や、利用可能なキャパシティに関するフィードバックをすぐに必要とする場合があります。新しい LaunchInstances API を使用すると、Auto Scaling グループ内の任意のアベイラビリティーゾーンやサブネットのオーバーライドを指定することで、インスタンスを起動する場所を正確に制御できると同時に、利用可能なキャパシティに関するフィードバックを即座に得ることができます。この同期オペレーションにより、お客様はスケーリング操作をリアルタイムで把握でき、必要に応じて代替戦略を迅速に実装できます。柔軟性を高めるため、API にはオプションの非同期再試行が含まれており、必要なキャパシティに達するのに役立ちます。\n  この機能は現在、すべての  AWS リージョンと AWS GovCloud (米国) リージョンで、標準的な EC2 と EBS の使用料以外の追加料金なしで利用できます。使用を開始するには、AWS コマンドラインインターフェイス (CLI) と AWS SDK を参照してください。この機能の詳細については、AWS ドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "1b1bd64f2b1f80cb7976f5db297d16b8830491fb",
      "title": "Amazon ECR Public が米国東部 (バージニア北部) の SDK エンドポイントに対する PrivateLink のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ecr-public-privatelink-us-east-n-virginia-sdk-endpoint",
      "pubDate": "2025-12-17T15:00:00.000Z",
      "contentSnippet": "Amazon Elastic Container Registry (ECR) Public が米国東部 (バージニア北部) の SDK エンドポイントに対して PrivateLink のサポートを開始し、ネットワークのセキュリティとプライベート接続が強化されています。この更新により、プライベートネットワーク接続を介してこの ECR Public の SDK エンドポイントにアクセスできるようになり、パブリックインターネットへの露出が軽減されます。\n  この機能強化により、ECR Public リポジトリを作成して管理しながら、Amazon Virtual Private Cloud (VPC) から ECR Public の SDK エンドポイントへのプライベート接続を確立できるようになりました。したがって、組織はネットワークのプライバシーとセキュリティを維持し、機密性の高いネットワークトラフィックの露出を減らし、準拠するネットワークセキュリティ要件を厳格化し、ECR Public リソースにアクセスするためのネットワークアーキテクチャを簡略化できます。\n  今すぐ米国東部 (バージニア北部) の ECR Public の SDK エンドポイントの使用を開始しましょう。\n \n詳細については、ECR に関するドキュメントをご参照ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "b38ff137a706255112f976903a58b85cb232fe7a",
      "title": "Amazon EC2 C8g、M8g、R8g インスタンスを利用可能なリージョンが増加",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-c8g-m8g-r8g-instances-additional-regions",
      "pubDate": "2025-12-17T15:00:00.000Z",
      "contentSnippet": "本日より、Amazon Elastic Compute Cloud (Amazon EC2) C8g および M8g インスタンスが AWS GovCloud (米国西部) で、また R8g および M8g インスタンスが AWS GovCloud (米国東部) リージョンで利用できるようになりました。これらのインスタンスは AWS Graviton4 プロセッサを搭載しており、Graviton3 ベースのインスタンスよりも最大 30% 高いパフォーマンスを発揮します。これらは、CPU 仮想化、ストレージ、およびネットワーク機能を専用のハードウェアとソフトウェアにオフロードして、ワークロードのパフォーマンスとセキュリティを強化する AWS Nitro System 上に構築されています。\n  AWS Graviton4 ベースの Amazon EC2 インスタンスは、Amazon EC2 で実行される幅広いワークロードに最高のパフォーマンスとエネルギー効率をもたらします。これらのインスタンスは、Graviton3 ベースの Amazon C8g、M8g、R8g インスタンスと比較して、インスタンスサイズが大きく、最大 3 倍の vCPU とメモリを備えています。AWS Graviton4 プロセッサは、AWS Graviton3 プロセッサに比べて、データベースでは最大 40%、ウェブアプリケーションでは 30%、大規模な Java アプリケーションでは 45% 高速です。C8g および R8g インスタンスは、2 つのベアメタルサイズを含む 12 種類のインスタンスサイズで利用できます。これらは、Amazon Elastic Block Store (Amazon EBS) に最大 50 Gbps の拡張ネットワーク帯域幅と最大 40 Gbps の帯域幅を提供します。\n  詳細については、Amazon EC2 C8g インスタンス、Amazon EC2 M8g インスタンス、Amazon EC2 R8g インスタンスの各ページを参照してください。ワークロードを Graviton ベースのインスタンスに移行する方法を調べるには、AWS Graviton Fast Start プログラムと Porting Advisor for Graviton をご覧ください。利用を開始するには、AWS GovCloud (米国) コンソールを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "323d4af14d16050ac76d1adc7917c15057acf90c",
      "title": "Amazon EC2 C8g インスタンスが欧州 (チューリッヒ) で利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-c8g-instances-europe-zurich",
      "pubDate": "2025-12-17T15:00:00.000Z",
      "contentSnippet": "本日より、Amazon Elastic Compute Cloud (Amazon EC2) C8g インスタンスが AWS 欧州 (チューリッヒ) リージョンで利用可能になりました。これらのインスタンスは AWS Graviton4 プロセッサを搭載しており、Graviton3 ベースのインスタンスよりも最大 30% 高いパフォーマンスを発揮します。Amazon EC2 C8g インスタンスは、ハイパフォーマンスコンピューティング (HPC)、バッチ処理、ゲーム、動画エンコーディング、科学的モデリング、分散分析、CPU ベースの機械学習 (ML) 推論、広告配信などのコンピューティングを多用するワークロードに最適です。これらのインスタンスは、CPU 仮想化、ストレージ、およびネットワーク機能を専用のハードウェアとソフトウェアにオフロードして、ワークロードのパフォーマンスとセキュリティを強化する AWS Nitro System 上に構築されています。\n  AWS Graviton4 ベースの Amazon EC2 インスタンスは、Amazon EC2 で実行される幅広いワークロードに最高のパフォーマンスとエネルギー効率をもたらします。これらのインスタンスは、Graviton3 ベースの Amazon C7g インスタンスと比較して、インスタンスサイズが大きく、最大 3 倍の vCPU とメモリを備えています。AWS Graviton4 プロセッサは、AWS Graviton3 プロセッサに比べて、データベースでは最大 40%、ウェブアプリケーションでは 30%、大規模な Java アプリケーションでは 45% 高速です。C8g インスタンスは、2 つのベアメタルサイズを含む 12 種類のインスタンスサイズで利用できます。これらは、Amazon Elastic Block Store (Amazon EBS) に最大 50 Gbps の拡張ネットワーク帯域幅と最大 40 Gbps の帯域幅を提供します。\n  詳細については、Amazon EC2 C8g インスタンスをご覧ください。使用を開始するには、AWS マネジメントコンソールをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "70eda0c8bba1d7210422500e7ee9c7e53ba4248a",
      "title": "Amazon OpenSearch Service が新しい OI2 インスタンスを発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-opensearch-service-oi2-instances/",
      "pubDate": "2025-12-17T14:00:00.000Z",
      "contentSnippet": "Amazon OpenSearch Service では、OI2 インスタンスが導入され、OpenSearch 最適化インスタンスファミリーが拡張されました。新しい OI2 インスタンスは、内部ベンチマークでは OR2 インスタンスと比較して最大 9%、I8g インスタンスと比較して最大 33% 高いインデックス作成スループットを提供します。\n \n新しい OI2 OpenSearch 最適化インスタンスは OR2 インスタンスと同じアーキテクチャを使用しており、Amazon S3 などのクラス最高のクラウドテクノロジーを活用して高い耐久性とコストパフォーマンスを実現し、高いインデックススループットを実現して負荷の高いワークロードのインデックス作成に向いています。各 OpenSearch 最適化インスタンスには、コンピューティング、キャッシュ用の第 3 世代の AWS Nitro SSD、リモート Amazon S3 ベースのマネージドストレージがプロビジョニングされています。OI2 では、従量制料金のリザーブドインスタンスが提供され、NVMe ストレージを含むインスタンスや、プロビジョニングされたマネージドストレージに対して単純な時間単位の料金が適用されます。 OI2 インスタンスには「large」から「24xlarge」までのサイズがあり、コンピューティング、メモリ、最大 22.5 TB のストレージを選択できます。料金の詳細については、Amazon OpenSearch Service の料金ページをご覧ください。\n  OI2 インスタンスファミリーは、米国東部 (バージニア北部、オハイオ)、米国西部 (オレゴン)、カナダ (中部)、アジアパシフィック (ムンバイ、シンガポール、シドニー、東京)、欧州 (フランクフルト、アイルランド、ロンドン、スペイン) の世界 12 リージョンで Amazon OpenSearch Service 上で利用できるようになりました。",
      "siteName": "AWS What's New"
    },
    {
      "id": "038d3ec98f5a49a9130b32f13839dc9d5021fe52",
      "title": "AWS Payment Cryptography がシドニーで AS2805 サポート付きで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-payment-cryptography-in-sydney/",
      "pubDate": "2025-12-17T08:00:00.000Z",
      "contentSnippet": "本日より、AWS Payment Cryptography がオーストラリア (シドニー) リージョンに拡大され、AS2805 機能をサポートするようになりました。この拡張は、このサービスの世界で 13 番目の AWS リージョンとなります。AS2805 の機能により、お客様はこの標準を利用する他社との運用性を維持しながら、より多くの決済ワークロードを AWS に移行できます。\n  オーストラリア、ニュージーランド、その他いくつかの国では、カード決済における組織間の暗号管理の一貫したアプローチとして、Australia Standards 2805 (AS2805) を採用しています。従来、これらの企業は、これらの操作を準拠した互換性のある方法で実行するためにハードウェアセキュリティモジュール (HSM) を必要としていました。AWS Payment Cryptography は、伸縮自在なスケーラブルサービスで、ノード間のユースケースに同等の機能を提供するようになりました。これにより、スタンドアロンハードウェアの調達と管理の運用上の負担がなくなります。お客様は、AWS IAM や AWS CloudTrail と統合された API を使用しながら、サービスの PCI 認定 HSM の使用を全体的なコンプライアンスプログラムの一部として活用できます。\n  AWS Payment Cryptography は、カナダ (モントリオール)、米国東部 (オハイオ、バージニア北部)、米国西部 (オレゴン)、欧州 (アイルランド、フランクフルト、ロンドン)、アフリカ (ケープタウン)、アジアパシフィック (シンガポール、東京、大阪、ムンバイ)、オーストラリア (シドニー) の AWS リージョンでご利用いただけます。\n  サービスの使用を開始するには、最新の AWS CLI/SDK をダウンロードし、追加のコンプライアンス詳細を含め、AWS Payment Cryptography ユーザーガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "a64acda3b7ea19da1388cb59235c93c15a14c932",
      "title": "Amazon Redshift Serverless が IPv6 をサポートするデュアルスタックモードの一般提供開始を発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-redshift-serverless-announces-dual-stack-mode-ipv6/",
      "pubDate": "2025-12-17T08:00:00.000Z",
      "contentSnippet": "Amazon Redshift Serverless は、インターネットプロトコルバージョン 6 (IPv6) をサポートするデュアルスタックモードの一般提供開始を発表しました。この機能強化により、ネットワークインフラストラクチャを最新化し、増大するインターネット接続の需要に対応できます。\n  Redshift Serverless は、IPv4 アドレスと IPv6 アドレスの両方を使用する (デュアルスタック) Redshift ワークグループの設定、または AWS Virtual Private Cloud (VPC) 内での IPv4 のみの設定をサポートしています。新しく Redshift Serverless ワークグループを作成する際に IPv6 サポートを有効にしたり、IPv6 アドレス指定をサポートするように既存のワークグループを変更したりできます。この機能により、IPv6 対応の VPC サブネット内に Redshift ウェアハウスをデプロイし、拡大するアプリケーションのアドレススペース要件に対応するようにネットワーク設定を構成できます。アプリケーションが IPv4 または IPv6 プロトコルを使用して Redshift ウェアハウスと通信できるようになり、既存の、さらには将来のネットワークアーキテクチャとの互換性が確保されます。\n \nこの機能は、Redshift Serverless が提供されているすべての AWS 商用リージョンでご利用いただけます。利用を開始するには、ドキュメントとブログをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "0b05bb3f8730a4b22ce5dc69667a335b4f49201c",
      "title": "AWS Security Incident Response が、さらに 10 の AWS リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/security-incident-response-ten-regions/",
      "pubDate": "2025-12-17T08:00:00.000Z",
      "contentSnippet": "AWS Security Incident Response が、アフリカ (ケープタウン)、アジアパシフィック (香港、ハイデラバード、ジャカルタ、メルボルン)、欧州 (チューリッヒ、ミラノ、スペイン)、中東 (UAE、バーレーン) のさらに 10 のオプトイン AWS リージョンで利用できるようになりました。これらの追加リージョンを使用して、セキュリティイベントへの備え、対応、復旧をより迅速かつ効果的に行うことができるようになりました。\n  AWS Security Incident Response は、自動化されたセキュリティ検出結果の監視とトリアージ、AI を活用した調査、封じ込め機能により、セキュリティインシデント対応ライフサイクルのすべてのステップを合理化します。専門的な専門知識が必要な場合、セキュリティインシデントレスポンスを利用すると、AWS のセキュリティ専門家の専任グループに 24 時間 365 日直接連絡でき、数分以内にお客様のリクエストに対応します。この自動化と専門知識の強力な組み合わせにより、セキュリティ運用を確実に拡大できるため、イノベーションと成長に集中できます。\n  詳細については、AWS Security Incident Response ページとドキュメントを参照してください。リージョンと言語のサポートについては、サポートされる設定に関するページを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "bb7adb32119f7de86157cca0e636b0aa0c57ded4",
      "title": "AWS IAM アイデンティティセンターがアジアパシフィック (台北) AWS リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-iam-identity-center-asia-pacific-taipei-region/",
      "pubDate": "2025-12-17T08:00:00.000Z",
      "contentSnippet": "アジアパシフィック (台北) を含む 37 の AWS リージョンに AWS IAM アイデンティティセンターをデプロイできるようになりました。\n  IAM アイデンティティセンターは、AWS アプリケーションへの従業員によるアクセスを管理するために推奨されるサービスです。IAM アイデンティティセンターを使用すると、従業員の既存の ID ソースを AWS に一度接続するだけで、AWS 全体でユーザーにシングルサインオン環境を提供できます。また、Amazon Q などの AWS アプリケーションが提供するパーソナライズされたエクスペリエンスを向上させ、Amazon Redshift といった AWS のサービスのデータに対するユーザー認識アクセスを定義および監査する機能を強化します。また、複数の AWS アカウントへのアクセスを一元的に管理できます。IAM アイデンティティセンターは、こちらの AWS リージョンで追加料金なしで利用できます。\n  IAM アイデンティティセンターの詳細については、製品の詳細ページをご覧ください。使用を開始するには、IAM アイデンティティセンターユーザーガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "7cd21ebebf7ae3b45e48510300cc1f7d6af634a2",
      "title": "AWS Payment Cryptography が API の料金を最大 63% 値下げし、キーの階層化された料金を導入",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-payment-cryptography-lower-pricing/",
      "pubDate": "2025-12-17T08:00:00.000Z",
      "contentSnippet": "本日、AWS Payment Cryptography は、既存のすべての層にわたる API リクエストの最大 63% の大幅な値下げを発表し、新しい第 4 層を導入しました。この変更により、すべてのリージョンで価格が統一されるので、料金を気にせずより大量のワークロードをサービスに移行できるようになります。今回の更新の一環として、キーの料金を均一料金から階層化された料金に移行し、大量の暗号化キーを管理する必要があるお客様へのサポートを強化しました。この新しい料金モデルにより、キー管理と支払い処理の両方の業務をコスト効率の高い方法でスケールでき、同時に量にかかわらずコストを最適化できます。\n  AWS Payment Cryptography は、専用の決済ハードウェアセキュリティモジュール (HSM) インスタンスを調達しなくても、Payment Card Industry (PCI) のセキュリティ基準に従って支払い処理に使用される暗号化機能とキー管理へのアクセスを提供するマネージド型 AWS サービスです。このサービスにより、買収企業、決済ファシリテーター、ネットワーク、スイッチ、プロセッサー、銀行などの決済機能を実行するお客様は、クラウド内のアプリケーションに近い場所で決済暗号操作を行うことができるようになり、専用の支払い HSM を含む補助データセンターやコロケーション施設への依存を最小限に抑えることができます。\n  この料金変更は、2025 年 12 月 15 日以降、AWS Payment Cryptography を利用できるすべての AWS リージョンで有効になり、特に何もしなくても自動的にすべてのお客様に適用されます。料金の詳細については、AWS Payment Cryptography の料金ページを参照してください。このサービスの詳細については、AWS Payment Cryptography のユーザーガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "7258b87ca3eb23b84766a15e5aa699d1199cc4ec",
      "title": "Amazon OpenSearch Service が新しい多層ストレージの提供を開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/writeable-warm-tier-opensearch-optimized-instances/",
      "pubDate": "2025-12-17T08:00:00.000Z",
      "contentSnippet": "Amazon OpenSearch Service は、OpenSearch 最適化インスタンスを利用した新しい多層ストレージオプションの提供を開始しました。この新しいアーキテクチャでは、Amazon S3 クラウドのテクノロジーとローカルインスタンスストレージを組み合わせて、耐久性とパフォーマンスを改善できます。この新しい多層アーキテクチャには、ホットとウォームの 2 つの層があります。ホット層は頻繁にアクセスされるデータに対応し、ウォーム層はアクセス頻度の低いデータ向けのコスト効率の高いストレージとして Amazon S3 を活用します。 \n  これまでは、Amazon OpenSearch Service は UltraWarm を利用してウォーム層をサポートし、読み取り専用データ向けのコスト効率の高いストレージを提供していました。新しいウォーム層は OpenSearch 最適化インスタンスを利用しており、書き込み操作をサポートしているので、データ管理の柔軟性が向上します。インデックス状態管理機能を使用して、データが古くなるにつれてホットからウォームへと自動的にローテーションできます。\n \nウォーム層のデプロイでは、OpenSearch 最適化 (OI2) インスタンス (「large」から「8xlarge」までのサイズ) と、ローカルキャッシュサイズの最大 5 倍のアドレス可能なウォームを併用できます。ウォームデータには標準的なマネージドストレージの料金が適用されます。この新しい多層環境は OpenSearch 3.3 以降で利用可能です。詳細については、ドキュメントをご参照ください。\n  OI2 インスタンスファミリーの新しい多層環境は、米国東部 (バージニア北部、オハイオ)、米国西部 (オレゴン)、カナダ (中部)、アジアパシフィック (ムンバイ、シンガポール、シドニー、東京)、欧州 (フランクフルト、アイルランド、ロンドン、スペイン) の世界 12 リージョンで Amazon OpenSearch Service 上で利用できるようになりました。  料金の詳細については、Amazon OpenSearch Service の料金ページをご覧ください",
      "siteName": "AWS What's New"
    },
    {
      "id": "ff982b94f52aba0aceed5820050ddfc6292e9a96",
      "title": "Amazon EC2 M8g インスタンスを利用可能なリージョンが増加",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-m8g-additional-regions/",
      "pubDate": "2025-12-17T08:00:00.000Z",
      "contentSnippet": "本日より、Amazon Elastic Compute Cloud (Amazon EC2) M8g インスタンスが、アジアパシフィック (タイ、ジャカルタ、メルボルン) および AWS 中東 (UAE) リージョンで利用可能になりました。これらのインスタンスは AWS Graviton4 プロセッサを搭載しており、Graviton3 ベースのインスタンスよりも最大 30% 高いパフォーマンスを発揮します。Amazon EC2 M8g は一般用途のワークロードに特化したインスタンスです。利用目的としては、アプリケーションサーバー、マイクロサービス、ゲームサーバー、中規模データストア、キャッシュフリートなどがあります。これらのインスタンスは、CPU 仮想化、ストレージ、およびネットワーク機能を専用のハードウェアとソフトウェアにオフロードして、ワークロードのパフォーマンスとセキュリティを強化する AWS Nitro System 上に構築されています。\n  AWS Graviton4 ベースの Amazon EC2 インスタンスは、Amazon EC2 で実行される幅広いワークロードに最高のパフォーマンスとエネルギー効率をもたらします。これらのインスタンスは、Graviton3 ベースの Amazon M7g インスタンスと比較して、インスタンスサイズが大きく、最大 3 倍の vCPU とメモリを備えています。AWS Graviton4 プロセッサは、AWS Graviton3 プロセッサに比べて、データベースでは最大 40%、ウェブアプリケーションでは 30%、大規模な Java アプリケーションでは 45% 高速です。M8g インスタンスには、2 つのベアメタルサイズを含む 12 種類のサイズがあります。これらは、Amazon Elastic Block Store (Amazon EBS) に最大 50 Gbps の拡張ネットワーク帯域幅と最大 40 Gbps の帯域幅を提供します。\n  詳細については、Amazon EC2 M8g Instances を参照してください。ワークロードをどのように Graviton ベースのインスタンスに移行するかを調べるには、AWS Graviton Fast Start プログラムと Porting Advisor for Graviton をご覧ください。使用を開始するには、AWS マネジメントコンソールをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "083ef842c44b7e6c0fb1fb3c1783000daffd4034",
      "title": "Amazon EC2 R8g インスタンスを利用可能なリージョンが増加",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-r8g-instances-additional-regions/",
      "pubDate": "2025-12-17T08:00:00.000Z",
      "contentSnippet": "本日より、Amazon Elastic Compute Cloud (Amazon EC2) R8g インスタンスが AWS 欧州 (パリ) およびアジアパシフィック (ハイデラバード) リージョンで利用可能になりました。これらのインスタンスは AWS Graviton4 プロセッサを搭載しており、Graviton3 ベースのインスタンスよりも最大 30% 高いパフォーマンスを発揮します。Amazon EC2 R8g インスタンスは、データベース、インメモリキャッシュ、リアルタイムビッグデータ分析などのメモリ集中型ワークロードに最適です。これらのインスタンスは、CPU 仮想化、ストレージ、およびネットワーク機能を専用のハードウェアとソフトウェアにオフロードして、ワークロードのパフォーマンスとセキュリティを強化する AWS Nitro System 上に構築されています。\n  AWS Graviton4 ベースの Amazon EC2 インスタンスは、Amazon EC2 で実行される幅広いワークロードに最高のパフォーマンスとエネルギー効率をもたらします。AWS Graviton4 ベースの R8g インスタンスは、Graviton3 ベースの R7g インスタンスよりも最大 3 倍大きい vCPU (最大 48xlarge) とメモリ (最大 1.5 TB) を備えた、より大きなインスタンスサイズを提供します。これらのインスタンスは、AWS Graviton3 ベースの R7g インスタンスと比較して、ウェブアプリケーションでは最大 30%、データベースでは最大 40%、大規模な Java アプリケーションでは最大 45% 高速です。R8g インスタンスは、2 つのベアメタルサイズを含む 12 種類のインスタンスサイズで利用できます。これらは、Amazon Elastic Block Store (Amazon EBS) に最大 50 Gbps の拡張ネットワーク帯域幅と最大 40 Gbps の帯域幅を提供します。\n  詳細については、Amazon EC2 R8g インスタンスをご覧ください。ワークロードをどのように Graviton ベースのインスタンスに移行するかを調べるには、AWS Graviton Fast Start プログラムと Porting Advisor for Graviton をご覧ください。使用を開始するには、AWS マネジメントコンソールをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "3601c96633e540851dcd5e5b1c03453f218f95ad",
      "title": "Amazon EC2 C8i および C8i-flex インスタンスがアジアパシフィック (シンガポール) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-c8i-c8i-flex-instances-singapore-region/",
      "pubDate": "2025-12-17T08:00:00.000Z",
      "contentSnippet": "本日より、Amazon Elastic Compute Cloud (Amazon EC2) C8i および C8i-flex インスタンスがアジアパシフィック (シンガポール) リージョンで利用できるようになります。これらのインスタンスは、AWS でのみ利用可能なカスタム Intel Xeon 6 プロセッサを搭載しており、クラウド内の同等の Intel プロセッサの中で最高のパフォーマンスと最速のメモリ帯域幅を提供します。C8i インスタンスと C8i-flex インスタンスは、前世代の Intel ベースのインスタンスと比較して、コストパフォーマンスが最大 15% 向上し、メモリ帯域幅も 2.5 倍向上しています。C7i および C7i-flex インスタンスと比較した場合、パフォーマンスは最大で 20% 向上し、一部のワークロードではより高いパフォーマンスが実現します。C8i および C8i-flex は、C7i および C7i-flex と比較して、NGINX ウェブアプリケーションでは最大 60％、AI 深層学習推奨モデルでは最大 40％、Memcached ストアでは最大 35％ 高速です。\n  C8i-flex は、ウェブサーバーやアプリケーションサーバー、データベース、キャッシュ、Apache Kafka、Elasticsearch、エンタープライズアプリケーションなど、コンピューティング負荷の高いワークロードの大部分で価格パフォーマンスのメリットを得る最も簡単な方法です。large から 16xlarge までの非常に一般的なサイズを提供しており、すべてのコンピューティングリソースをフルに活用しきれていないアプリケーションに最適な選択肢です。\n  C8i インスタンスは、メモリ負荷の高いワークロード全般に適しています。特に、最大のインスタンスサイズや継続的に高い CPU 使用率を必要とするワークロードに最適です。C8i インスタンスは、13 種類のサイズで提供されています。そのうち 2 つはベアメタルサイズで、大規模なアプリケーションに対応する新しいサイズ 96xlarge も追加されています。\n  使用を開始するには、AWS マネジメントコンソールにサインインしてください。このインスタンスは、Savings Plans、オンデマンドインスタンス、スポットインスタンスでご購入いただけます。この新しい C8i と C8i-flex のインスタンスの詳細については、AWS ニュースブログをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "225bd32334d48e813746bb2b0737e3928b8093cf",
      "title": "AWS Marketplace が必須の発注書とカスタムのメッセージのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-marketplace-mandatory-purchase-orders-custom-messaging",
      "pubDate": "2025-12-17T08:00:00.000Z",
      "contentSnippet": "AWS Marketplace で、購入時の必須の発注書の要求とカスタムのメッセージのサポートが開始されたので、組織は調達のガバナンスを強化できます。これらの機能は、調達、ソフトウェア資産管理、クラウドガバナンスのチームが、すばやく購入の判断や行動ができる状態を維持しながらコンプライアンスポリシーを順守させるのに役立ちます。\n  管理者は、購入者が AWS Marketplace を通じて製品にサブスクライブする際に発注書を提出するよう要求することで、義務的な発注ポリシーを順守させることができるようになりました。このような要求は、さまざまな料金タイプにわたるプライベートオファーやパブリックオファーを通じて行う購入に適用できます。さらに管理者は、調達ページにカスタムメッセージを追加して、ポリシーの要件やサポートの連絡先について案内できます。組織は、カスタムメッセージを実装せずに発注書の要求を実装したり、カスタムメッセージを使用して購入者に調達プロセスを案内したり、両方の機能を組み合わせてより包括的なガバナンスを実現したりできます。これらの機能は Private Marketplace とも併用できるので、AWS 組織内の特定のユーザーやグループに対して承認した製品の厳選されたカタログを作成できます。このような柔軟性があるので、財務や調達のチームは、購入時にコンプライアンスを順守させ、コスト配分の精度を改善し、調達から支払いまでのサイクルを合理化することができます。\n  これらの機能は現在、AWS Marketplace がサポートされているすべての AWS リージョンで利用できます。\n  発注書の要求とカスタムメッセージについては、AWS Marketplace の購入者ガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "55826a0f521fa0b180aa56cab0a8c9c3b6d6cf3b",
      "title": "AWS Payment Cryptography がアジアパシフィック (ハイデラバード) と欧州 (パリ) で利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-payment-cryptography-available-in-hyderabad-paris/",
      "pubDate": "2025-12-17T08:00:00.000Z",
      "contentSnippet": "AWS Payment Cryptography は、アジアパシフィック (ハイデラバード) と欧州 (パリ) の 2 つの新しいリージョンで提供を開始し、より多くの国や地域で利用できるようになりました。こうしたリージョンの拡大により、クロスリージョン構成を使用することなく、レイテンシーの影響を受けやすい支払いアプリケーションを新しい AWS リージョンで構築、デプロイしたり、新しい AWS リージョンに移行できるようになります。これらのリージョンでは、欧州とインドでのマルチリージョンの高可用性を実現するためのオプションが追加されています。\n  AWS Payment Cryptography は、クラウドホスト型決済アプリケーションの支払い固有の暗号化操作とキー管理を簡素化するフルマネージドサービスです。このサービスはお客様のビジネスニーズに合わせて柔軟にスケールすることができ、PCI PIN 要件と PCI P2PE 要件に準拠していると評価されているため、専用の支払い HSM インスタンスを維持する必要がありません。加盟店契約会社、決済代行業者、決済ネットワーク運営者、決済ルーティングシステム運営者、決済処理業者、銀行などの決済機能を実行する組織は、専用の支払い HSM を備えた補助データセンターへの依存を減らしながら、アプリケーションに近い場所で決済暗号化オペレーションを実行できるようになりました。\n  AWS Payment Cryptography は、カナダ (モントリオール)、米国東部 (オハイオ、バージニア北部)、米国西部 (オレゴン)、欧州 (アイルランド、フランクフルト、ロンドン、パリ)、アフリカ (ケープタウン)、アジアパシフィック (シンガポール、東京、大阪、ムンバイ、ハイデラバード) の AWS リージョンでご利用いただけます。\n  サービスの使用を開始するには、最新の AWS CLI/SDK をダウンロードし、詳細については AWS Payment Cryptography ユーザーガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "effde40fdda484e3280983ede455f754ad0b72a9",
      "title": "AWS IoT Device Management のコマンドが動的ペイロードをサポート",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-iot-device-management-commands-dynamic-payload/",
      "pubDate": "2025-12-16T20:00:00.000Z",
      "contentSnippet": "AWS IoT Device Management のコマンドが動的ペイロード機能をサポートするようになったため、開発者はコマンド実行中に別の値に置き換えることができるプレースホルダー付きの再利用可能なコマンドテンプレートを作成できます。この拡張機能には、実行前にパラメーター値が指定された条件に準拠していることを確認するパラメーター検証ルールも含まれています。今回の更新により、開発者は実行時にコマンドのパラメーターを設定できるようになり、コマンドを再利用しやすくなりました。\n  この機能は、パラメータ値が異なる類似のコマンドを IoT デバイスに送信する必要がある場合に最適です。たとえば、サーモスタットのさまざまな温度値を設定する個別のコマンドを作成する代わりに、温度プレースホルダーを含む 1 つのテンプレートを作成し、実行時に実際の値を指定できるようになります。このテンプレートベースのアプローチは、デバイス構成の調整や可変設定によるスマートホームデバイスの制御など、アプリケーションのコマンド管理を合理化するのに役立ちます。 \n \n動的ペイロードをサポートする AWS IoT Device Management のコマンドは、AWS IoT Device Management が現在利用可能なすべての AWS リージョンで利用できます。動的ペイロードとペイロードテンプレートの詳細については、AWS IoT Device Management コマンドのデベロッパーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "fdcd36bd056b33a3e14dc6720658e6f626d954f1",
      "title": "Amazon Connect がリアルタイムのメトリクスアラートに詳細情報を追加",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-connect-additional-details-real-time-metric-alerts/",
      "pubDate": "2025-12-16T18:00:00.000Z",
      "contentSnippet": "リアルタイムメトリクスの Amazon Connect アラートが、しきい値を超えてアラートをトリガーした特定のエージェント、キュー、フロー、ルーティングプロファイルを提供するようになりました。これにより、マネージャーはアラートの根本原因を手動で調査する必要がなくなるため、カスタマーエクスペリエンスや運用上の問題に迅速に対応できます。たとえば、キュー待機時間の増加に関するアラートには、影響を受ける正確なキューが含まれるようになったため、管理者はエージェントをそれらのキューに再割り当てできます。これらの詳細なアラートは、メール、タスク、Amazon EventBridge を通じて送信できます。\n  この機能は、Amazon Connect が提供されているすべてのリージョンで利用できます。詳細については、ドキュメントとウェブページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "ea0cac0a5b1a52ce5339d229ee5503faf93329ce",
      "title": "ベトナムのハノイで新しい AWS Direct Connect ロケーションが利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-direct-connect-hanoi/",
      "pubDate": "2025-12-16T17:00:00.000Z",
      "contentSnippet": "本日、AWS はベトナムのハノイにある CMC Tower 内に新しい AWS Direct Connect ロケーションを開設したことを発表しました。これにより、このロケーションからすべてのパブリック AWS リージョン (中国を除く)、AWS GovCloud リージョン、AWS Local Zones へのプライベートな直接ネットワークアクセスを確立できるようになりました。このサイトは、ベトナムで最初の AWS Direct Connect ロケーションです。この Direct Connect ロケーションでは、1 Gbps、10 Gbps、100 Gbps の専用接続が可能で、10 Gbps 接続と 100 Gbps 接続では MACsec 暗号化を使用できます。 \n  Direct Connect サービスは、AWS とお客様のデータセンター/オフィス/コロケーション環境との間に、プライベート物理ネットワーク接続を確立します。このプライベート接続では、パブリックインターネット経由の接続よりも安定したネットワークエクスペリエンスを提供できます。 \n  世界中の 149 を超える Direct Connect ロケーションの詳細については、Direct Connect 製品詳細ページのロケーションのセクションをご覧ください。Direct Connect の購入およびデプロイ方法の詳細については、開始方法のページを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "ae246e694201c137c7d9fb8ec430e399c3b59c73",
      "title": "Amazon EC2 M8i インスタンスの利用可能なリージョンが拡大",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-m8i-instances-additional-regions",
      "pubDate": "2025-12-16T15:00:00.000Z",
      "contentSnippet": "本日より、Amazon EC2 M8i インスタンスがアジアパシフィック (ソウル)、アジアパシフィック (東京)、アジアパシフィック (シドニー)、アジアパシフィック (シンガポール)、およびカナダ (中部) の各リージョンで利用できるようになりました。これらのインスタンスは、AWS でのみ利用可能なカスタム Intel Xeon 6 プロセッサを搭載しており、クラウド内の同等の Intel プロセッサの中で最高のパフォーマンスと最速のメモリ帯域幅を提供します。M8i インスタンスは、前世代の Intel ベースのインスタンスと比較して、コストパフォーマンスが最大 15% 向上し、メモリ帯域幅も 2.5 倍向上しています。M7i インスタンスと比較した場合、パフォーマンスは最大で 20% 向上し、特定のワークロードではより高いパフォーマンスが実現します。M8i インスタンスは、M7i インスタンスと比較して、PostgreSQL データベースでは最大 30%、NGINX ウェブアプリケーションでは最大 60%、AI 深層学習レコメンデーションモデルでは最大 40%高速化されます。\n  M8i インスタンスは、汎用ワークロード全般に適しています。特に、最大のインスタンスサイズや、継続的に高い CPU 使用率を必要とするワークロードに最適です。SAP 認定の M8i インスタンスは、13 種類のサイズで提供されています。そのうち 2 つはベアメタル型で、大規模なアプリケーションに対応する新しいサイズ 96xlarge も追加されています。\n  使用を開始するには、AWS マネジメントコンソールにサインインしてください。この新しいインスタンスの詳細については、M8i インスタンスのページまたは AWS ニュースブログをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "373318b099bf35e2cebb913b5f3a639711f083c3",
      "title": "AWS が二酸化炭素排出量データ公開までの時間を 21 日以下に短縮",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-reduces-publishing-time-carbon-footprint-data",
      "pubDate": "2025-12-16T15:00:00.000Z",
      "contentSnippet": "AWS は、二酸化炭素排出量データを 21 日以内公開するようになりました。以前は、二酸化炭素排出量のデータは最大 3 か月のデータラグを伴って公開されていました。今後は、使用の翌月の 15 日から 21 日の間に公開される、推定値を含む二酸化炭素排出量データにアクセスできるようになります。\n  二酸化炭素排出量データをより早く入手できることで、アプリケーションの実行方法と実行場所についてよりタイムリーな意思決定を行い、資源効率の向上を通じて排出量とコストを削減する機会を特定するために必要な分析情報が得られます。また、CCFT ダッシュボードには 38 か月分のデータが保存されているため、二酸化炭素使用量の経時的な傾向を確認できます。\n  二酸化炭素排出量データを表示するには、AWS Billing and Cost Management コンソールから二酸化炭素排出量データに移動します。CCFTの詳細については、CCFT の機能と特徴のページにアクセスするか、CCFT ユーザーガイドを確認するか、CCFT のウェブページにアクセスしてください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "5d30e19d3e85d699bb94187b2b423229f5d92def",
      "title": "AWS Security Incident Response が Slack との連携機能を導入",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-security-incident-response-integration-slack",
      "pubDate": "2025-12-16T15:00:00.000Z",
      "contentSnippet": "AWS Security Incident Response では、クラウドベースのチームコラボレーションプラットフォーム Slack との統合が可能になりました。これにより、既存の通知とコミュニケーションのワークフローを維持しながら、セキュリティイベントへの準備、対応、復旧をより迅速かつ効果的に行うことができます。この双方向統合により、Security Incident Response コンソールと Slack の両方で、自動データ複製を使用してケースを作成および更新できます。各 Security Incident Response ケースは専用の Slack チャンネルとして表示され、コメントや添付ファイルは即座に同期されます。これにより、対応者は重要なケース情報にすぐにアクセスでき、使用するツールに関係なく、より効率的なコラボレーションを実現できます。\n  この統合により、Security Incident Response ウォッチャーが対応する Slack チャンネルに自動的に追加されるため、セキュリティチームはより迅速に対応し、応答時間を短縮できます。この統合は GitHub でオープンソースソリューションとして提供されており、お客様やパートナーは機能をカスタマイズしたり拡張したりすることができます。この統合では EventBridge を活用することで、お客様は AWS Security Incident Response の機能を活用しながら、既存のセキュリティインシデント管理および通知ツールを引き続き使用できます。このソリューションはモジュラーアーキテクチャを特徴としており、Amazon Q Developer、Kiro、または同様の AI アシスタントの使用方法に関するガイダンスが用意されているため、Slack 以外にも新しい統合ターゲットを簡単に追加できます。\n  AWS Security Incident Response と Slack の連携を開始するには、GitHub リポジトリにアクセスしてください。実装の詳細については、Slack 用の技術文書をご覧ください。AWS Security Incident Response の詳細については、サービスのユーザーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "2d3cf2e29ea55d15cb5369f03ec3d03b6b60a665",
      "title": "Amazon SageMaker AI がアジアパシフィック (ニュージーランド) で利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-sagemaker-ai-asia-pacific-new-zealand",
      "pubDate": "2025-12-16T15:00:00.000Z",
      "contentSnippet": "本日より、アジアパシフィック (ニュージーランド) で機械学習モデルを構築、トレーニング、デプロイできるようになりました。\n  Amazon SageMaker AI は、あらゆるデベロッパーやデータサイエンティスト向けのフルマネージドプラットフォームです。機械学習モデルを迅速に構築、トレーニング、デプロイできます。SageMaker AI を使用すると、機械学習の各プロセスの面倒な作業を削減し、高品質のモデルを簡単に開発できます。\n \n詳細と使用開始方法については、SageMaker AI のドキュメントおよび料金のページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "26284e0e9bc7ff900bfd2c619afafd1c550a5c77",
      "title": "AWS Artifact で以前のバージョンのコンプライアンスレポートにアクセス可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-artifact-access-previous-versions-compliance-reports",
      "pubDate": "2025-12-16T15:00:00.000Z",
      "contentSnippet": "AWS Artifact では、以前のバージョンの AWS コンプライアンスレポートに直接アクセスできるようになり、AWS サポートやアカウント担当者に連絡する必要がなくなりました。このセルフサービス機能により、お客様はコンプライアンス文書要件を効率的に管理できます。特に、過去のコンプライアンス証拠を必要とする監査やベンダー評価の際に役立ちます。\n  以前のバージョンのレポートにアクセスするには、AWS マネージドポリシー 「AWSArtifactReportsReadOnlyAccess」に含まれている「artifact:ListReportVersions」の IAM アクセス許可が必要です。AWS Artifact コンソールで以前のバージョンのレポートを表示できない場合は、AWS アカウント管理者に連絡してこのアクセス許可をリクエストしてください。\n  承認されると、AWS Artifact コンソールから以前のバージョンのコンプライアンスレポート (SOC、ISO、C5 など) に直接アクセスできます。レポートページに移動して任意のレポートを選択するだけで、利用可能なバージョンが表示されます。以前のバージョンのレポートが利用可能かどうかはコンプライアンスプログラムによって異なります。過去数年のバージョンを提供するレポートもあれば、履歴の対象範囲が限定されているレポートもあります。\n  この機能は、米国東部 (バージニア北部) および AWS GovCloud (米国西部) リージョンで一般提供が開始されました。\n  以前のバージョンのコンプライアンスレポートへのアクセス方法の詳細については、AWS Artifact のドキュメントをご覧ください。AWS Artifact に関する一般的な情報については、AWS Artifact 製品ページを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "6b0be18fa9ac1b9ae04ffda284741bbb100850e4",
      "title": "Amazon Quick Suite のブラウザ拡張機能が Quick Flows をサポート",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/quick-suite-browser-extension-quick-flows/",
      "pubDate": "2025-12-16T08:00:00.000Z",
      "contentSnippet": "Amazon Quick Suite のブラウザ拡張機能が Amazon Quick Flows をサポートするようになり、ウェブブラウザ内でワークフローを直接実行できるようになりした。これにより、各ウェブページから手動で情報を抽出する必要がなくなります。作成したワークフローや共有されたワークフローを呼び出したり、ウェブページのコンテンツを入力として渡したりできます。これらはすべて、ブラウザを離れることなく実行できます。\n  この機能は、契約書を分析して重要な条件を抽出したり、関係者に自動的に通知を送信するプロジェクトダッシュボードから週次レポートを生成したりするなど、日常的なタスクを実行するのに最適です。\n  ブラウザ拡張機能での Quick Flows は、米国東部 (バージニア北部)、米国西部 (オレゴン)、アジアパシフィック (シドニー)、欧州 (アイルランド) で利用できるようになりました。ブラウザ拡張機能を使用しても、標準の Quick Flows の使用以外に追加料金はかかりません。\n  使用を開始するには、Chrome、Firefox、Edge のストアページにアクセスしてブラウザ拡張機能をインストールし、Quick Suite アカウントでサインインしてください。サインインしたら、チャットボックスの下にある Flows アイコンを見つけてフローを呼び出します。ブラウザ拡張機能での Quick Flows の呼び出しについて詳しくは、ドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "a262e5188d1d6df401084e37b000b066b2a52cfe",
      "title": "Amazon EC2 M8i-flex インスタンスがアジアパシフィック (シドニー) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-m8i-flex-instances-sydney-region/",
      "pubDate": "2025-12-16T08:00:00.000Z",
      "contentSnippet": "本日より、Amazon EC2 M8i-flex インスタンスがアジアパシフィック (シドニー) リージョンで利用できるようになりました。これらのインスタンスは、AWS でのみ利用可能なカスタム Intel Xeon 6 プロセッサを搭載しており、クラウド内の同等の Intel プロセッサの中で最高のパフォーマンスと最速のメモリ帯域幅を提供します。M8i-flex インスタンスは、前世代の Intel ベースのインスタンスと比較して、コストパフォーマンスが最大 15% 向上し、メモリ帯域幅も 2.5 倍向上しています。M7i-flex インスタンスと比較した場合、パフォーマンスは最大で 20% 向上し、特定のワークロードではより高いパフォーマンスが実現します。M8i-flex インスタンスは、M7i-flex インスタンスと比較して、PostgreSQL データベースでは最大 30%、NGINX ウェブアプリケーションでは最大 60%、AI 深層学習レコメンデーションモデルでは最大 40% 高速化されます。\n  M8i-flex インスタンスは、ウェブサーバーやアプリケーションサーバー、マイクロサービス、中小規模データストア、仮想デスクトップ、エンタープライズアプリケーションなどのほとんどの汎用ワークロードでコストパフォーマンスのメリットが得られる最も簡単な方法です。large から 16xlarge までの非常に一般的なサイズを提供しており、すべてのコンピューティングリソースをフルに活用しきれていないアプリケーションに最適な選択肢です。\n  使用を開始するには、AWS マネジメントコンソールにサインインしてください。この新しいインスタンスの詳細については、M8i-flex インスタンスのページまたは AWS ニュースブログをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "d540755f76150767a24609b4c219919128226c2a",
      "title": "Amazon Quick Suite がチャットエージェントでメモリをサポート",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-quick-suite-memory-chat-agents/",
      "pubDate": "2025-12-16T08:00:00.000Z",
      "contentSnippet": "Amazon Quick Suiteのチャットエージェント向けメモリを発表いたします。この機能により、ユーザーは以前の会話に基づいてパーソナライズされた回答を得ることができます。この機能により、Quick Suite はユーザーがチャットで指定した設定を記憶し、ユーザーに合わせた回答を生成します。また、ユーザーは推論された設定を確認して、Quick チャットエージェントに使用させたくないメモリを削除することもできます。\n  以前は、チャットユーザーは、すべての会話で回答の形式、略語、ダッシュボード、統合に関する好みを繰り返す必要がありました。また、チャットで曖昧なトピックやエンティティを明確にする必要があったため、正確で洞察に満ちた回答を得るために必要な面倒なやり取りが増えていました。メモリは、この課題を解決するために、ユーザーに関する事実と詳細を記憶し、ユーザーに提供される回答が継続的に学習および改善されるようにします。また、Quick Suite がユーザーについて記憶する内容もユーザーが制御できます。すべてのメモリをユーザーは表示および削除することができ、ユーザーはプライベートモードでチャットを開始することもできます。プライベートモードの会話はメモリの推論に使用されません。\n  Quick Suite チャットエージェントのメモリは、米国東部 (バージニア北部) と米国西部 (オレゴン) でご利用いただけます。詳細については、Amazon Quick Suite ユーザーガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "63e6967b5ea301c294a7ab7bedde2d0af55140ea",
      "title": "Amazon Route 53 が Resolver エンドポイントの詳細なメトリクスを導入",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/route-53-detailed-metrics-resolver-endpoints/",
      "pubDate": "2025-12-16T08:00:00.000Z",
      "contentSnippet": "本日より、Route 53 のための Amazon CloudWatch メトリクスを有効にして、Route 53 Resolver エンドポイントと、アウトバウンド Resolver エンドポイントに関連付けられているすべてのターゲットネームサーバーのパフォーマンスと状態を監視できます。\n  Amazon Route 53 Resolver のエンドポイントは、オンプレミスのデータセンターと Amazon Virtual Private Cloud (Amazon VPC) の間でシームレスな DNS クエリ解決を可能にすることで、ハイブリッドクラウド設定の管理を容易にします。CloudWatch では、Resolver エンドポイントごとに新しいメトリクスを有効にできます。これにより、Resolver エンドポイントが受信した DNS クエリの応答レイテンシー、SERVFAIL、NXDOMAIN、REFUSED、または FORMERR ステータスになったクエリ応答の数を評価できます。また、ターゲットサーバーの応答レイテンシーとタイムアウトになったクエリの数を表示することで、アウトバウンド Resolver エンドポイントに関連付けられているターゲットネームサーバーの可用性を確認することもできます。新しいメトリクスにより、Route 53 Resolver エンドポイントと関連するターゲットネームサーバーの状態を簡単に評価できます。\n  このメトリクスの詳細については、ドキュメントを参照するか、Route 53 VPC Resolver のページをご覧ください。Route 53 Resolver エンドポイントの詳細メトリクスの使用には、標準の CloudWatch および Resolver エンドポイントの料金が適用されます。詳細については、Amazon CloudWatch の料金と Resolver エンドポイントの料金を参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "1c18dc60274e21e555749c5f4099b2a6c775cc25",
      "title": "AWS Clean Rooms がメンバー招待とテーブル準備のイベントを EventBridge に公開",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/clean-rooms-events-member-invitations-table-readiness/",
      "pubDate": "2025-12-16T08:00:00.000Z",
      "contentSnippet": "AWS Clean Rooms では、新規メンバーの招待やテーブル準備に関するイベントを Amazon EventBridge に公開するようになりました。これにより、リアルタイムのインサイトが提供され、コラボレーションメンバーへの透明性が高まります。コラボレーションに招待されたメンバーは、Clean Rooms コラボレーションに招待されたときに EventBridge の通知を受け取るようになります。これにより、メンバーは新しい招待を簡単に確認し、コラボレーションに参加することができます。また、ID マッピングテーブルや ID 名前空間などの AWS Entity Resolution リソースがコラボレーションに関連付けられると、コラボレーションメンバーに通知が届きます。これにより、コラボレーターのデータセット全体の関連レコードを使用する分析を自動的に開始できます。たとえば、パブリッシャーが広告主をコラボレーションに招待した場合、広告主がコラボレーションで ID マッピングテーブルを作成するとすぐに、パブリッシャーはメディアプランニング分析を自動的に実行できます。これにより、アクションまでの時間が数時間から数分に短縮され、コラボレーションメンバー間の透明性が高まります。\n  AWS Clean Rooms を利用すると、お客様は安全なデータクリーンルームを数分で作成でき、AWS または Snowflake 上で他の企業と協力して、広告キャンペーン、投資についての意思決定、および研究開発に関する独自のインサイトを得ることができます。AWS Clean Rooms を利用できる AWS リージョンの詳細については、AWS リージョン表をご覧ください。AWS Clean Rooms を使用したコラボレーションの詳細については、AWS Clean Rooms または AWS Entity Resolution をご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "f2eba0efa3c00847fe1ac4881506b064d3e24799",
      "title": "Amazon Managed Service for Apache Flink が AWS アジアパシフィック (オークランド) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-managed-service-apache-flink-aws-asia-pacific-auckland-region/",
      "pubDate": "2025-12-15T18:00:00.000Z",
      "contentSnippet": "本日より、アジアパシフィック (オークランド) リージョンで Amazon Managed Service for Apache Flink を使用して、リアルタイムのストリーム処理アプリケーションを構築できます。\n  Amazon Managed Service for Apache Flink を使用すると、Apache Flink を使用してストリーミングデータをリアルタイムで簡単に変換および分析できます。Apache Flink はオープンソースのフレームワークであり、データストリームを処理するためのエンジンです。Amazon Managed Service for Apache Flink は、Apache Flink アプリケーションの構築と管理の複雑さを軽減し、組み込みのコネクタを使用して、Amazon Managed Streaming for Apache Kafka (Amazon MSK)、Amazon Kinesis Data Streams、Amazon OpenSearch Service、Amazon DynamoDB Streams、Amazon Simple Storage Service (Amazon S3)、カスタム統合などと統合します。\n  Amazon Managed Service for Apache Flink の詳細については、こちらをご覧ください。Amazon Managed Service for Apache Flink を利用可能なリージョンについては、AWS リージョン表を参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "fe168a228b4fe066386b213e2fc1574d3c2632fb",
      "title": "ユーザーの属性を使用したコスト配分の発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/cost-allocation-using-users-attributes",
      "pubDate": "2025-12-15T18:00:00.000Z",
      "contentSnippet": "AWS は、コストセンター、部門、組織、部署などの既存のワークフォースユーザーの属性を使用して、AWS アプリケーションの使用状況とコストを追跡および分析する、新しいコスト配分機能を発表しました。この新機能により、お客様は Amazon Q Business、Amazon Q Developer、Amazon QuickSight などの AWS アプリケーションのユーザーごとの月額サブスクリプション料金とオンデマンド料金を、それぞれの社内ビジネスユニットに割り当てることができます。\n  お客様は、ワークフォースユーザーの属性を IAM Identity Center にインポートする必要があります。IAM Identity Center は、AWS アプリケーションへのワークフォースアクセスを管理するための推奨サービスです。属性をインポートした後、お客様は AWS Billing and Cost Management コンソールからこれらの属性の 1 つ以上をコスト配分タグとして有効にできます。ユーザーが AWS アプリケーションにアクセスすると、その使用状況とコストは選択した属性で自動的に記録されます。Cloud Financial Operations (FinOps) の専門家は、AWS Cost Explorer と AWS CUR 2.0 でコストを表示および分析できるため、さまざまなチームが AWS の使用状況とコストをどのように関与しているのかを把握できます。\n  ユーザー属性を使用したコスト配分のサポートは、GovCloud (米国) リージョンと中国 (北京) と中国 (寧夏) リージョンを除くすべての AWS リージョンで一般提供されます。\n  詳細については、「AWS コスト配分タグを使用したコストの整理と追跡」を参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "736fe4622b5be878a68e461f73a0143a0644bf68",
      "title": "Amazon Elastic VMware Service (Amazon EVS) が利用可能なリージョンが追加されました",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-evs-available-in-additional-regions/",
      "pubDate": "2025-12-15T18:00:00.000Z",
      "contentSnippet": "本日、Amazon Elastic VMware Service (Amazon EVS) が、米国西部 (北カリフォルニア)、アジアパシフィック (ハイデラバード)、アジアパシフィック (マレーシア)、カナダ西部 (カルガリー)、欧州 (ミラノ)、メキシコ (中部)、南米 (サンパウロ) の各リージョンのすべてのアベイラビリティーゾーンで利用できるようになったことをお知らせします。この拡張により、クラウドで VMware ワークロードを実行する際に AWS のスケールと柔軟性を活用するためのオプションが増えました。\n  Amazon EVS では、AWS Nitro を活用して、EC2 ベアメタルインスタンス上の Amazon Virtual Private Cloud (VPC) 内で VMware Cloud Foundation (VCF) を直接実行できます。ステップバイステップの設定ワークフローまたは自動デプロイ機能を備えた AWS コマンドラインインターフェイス (CLI) のいずれかを使用すると、完全な VCF 環境をわずか数時間で設定できます。この迅速なデプロイにより、AWS へのワークロードの移行が迅速になり、老朽化したインフラストラクチャの排除、運用上のリスクの軽減、データセンターの終了に関する重要なタイムラインの遵守が可能になります。\n  これらのリージョンでさらに利用可能になったため、エンドユーザーとの距離が近くなって VMware ワークロードのレイテンシーが低減され、データレジデンシーまたは主権の要件への準拠が可能になり、冗長戦略を強化するための高可用性と耐障害性のオプションが増えます。\n  使用を開始するには、Amazon EVS 製品詳細ページとユーザーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "1298ecc04f44ecbac0b2c70a59f4b37aa56b2671",
      "title": "Amazon Connect で評価フォームでの複数の選択肢および日付の質問のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-connect-multiple-choice-date-questions-evaluation-forms/",
      "pubDate": "2025-12-15T18:00:00.000Z",
      "contentSnippet": "Amazon Connect で、人間と AI エージェントのパフォーマンスに関するより深いインサイトを得るための 2 つの新しい評価に関する質問のタイプが用意されました。マネージャーは、営業の会話で顧客が興味を持った製品など、複数の回答を選択できる質問を作成できるようになりました。さらに、マネージャーは顧客とエージェントのアクションの日付を評価フォームで得ることができます。たとえば、顧客がいつローンを申し込んだか、いつ承認されたかを記録できます。\n  この機能は、Amazon Connect が提供されているすべてのリージョンで利用できます。詳細については、ドキュメントとウェブページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "b7997a42c10601969c67fa6477ff1f70f43d86cb",
      "title": "AWS Billing and Cost Management でダッシュボードの PDF エクスポートと CSV データのダウンロードのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-billing-cost-management-pdf-export-csv-data-download-dashboards",
      "pubDate": "2025-12-15T15:00:00.000Z",
      "contentSnippet": "本日、AWS は AWS Billing and Cost Management ダッシュボードの PDF エクスポートと CSV データのダウンロードの機能を発表しました。これらの新機能により、カスタマイズしたダッシュボードを PDF ファイルとしてエクスポートしてオフラインで分析および共有したり、個々のウィジェットデータを CSV 形式でダウンロードしてスプレッドシートアプリケーションで詳細に調べたりすることができます。これらの機能により、閲覧可能または編集可能なアクセス権を持つダッシュボードを共有できるだけでなく、組織全体に AWS コストに関するインサイトを配布する方法が増えました。\n  Billing and Cost Management ダッシュボードでは、ダッシュボード全体または個々のウィジェットをコンソールから直接 PDF ファイルとしてエクスポートできるため、スクリーンショットや手動でフォーマットする必要がなくなります。PDF エクスポート機能では、一貫した外観を維持し、ダッシュボードのレイアウトを維持するようにフォーマットされたレポートを作成できるため、取締役会、レビュー、戦略的な計画セッションでステークホルダーと共有するのに理想的です。詳細なデータ分析が必要な場合は、個々のウィジェットデータを CSV 形式でエクスポートできます。これにより、アナリストは好みのスプレッドシートツールで特定のコスト指標を詳細に調べることができます。\n  AWS Billing and Cost Management ダッシュボードの PDF および CSV のエクスポート機能は、AWS 中国リージョンを除く、すべての AWS 商用リージョンにて、追加料金なしでご利用いただけます。\n  使用を開始するには、AWS Billing and Cost Management コンソールにアクセスし、左側のナビゲーションメニューから [ダッシュボード] をクリックします。詳細については、AWS Billing and Cost Management のユーザーガイドでのダッシュボードのエクスポートを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "181972ced53a0b910f4b14ba522a609b7f0243ac",
      "title": "強化されたネットワークセキュリティポリシーを Amazon EKS で導入",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-eks-enhanced-network-security-policies",
      "pubDate": "2025-12-15T15:00:00.000Z",
      "contentSnippet": "本日、Amazon Elastic Kubernetes Service (EKS) のネットワークポリシー機能が強化されたことを発表します。これにより、お客様が Kubernetes ワークロードのネットワークセキュリティ体制を改善し、クラスター外部の宛先と統合できるようになります。この拡張は、EKS で以前サポートされていたネットワークセグメンテーション機能を基盤としています。これで、クラスター全体にネットワークアクセスフィルターを一元的に適用できるだけでなく、ドメインネームシステム (DNS) ベースのポリシーを活用して、クラスター環境からの送信トラフィックを保護できます。\n  お客様が EKS を使用して継続的にアプリケーション環境をスケールするのに伴い、クラスター内外のリソースへの不正アクセスを防ぐために、ネットワークトラフィックの分離がますます重要になっています。これに対処するため、EKS は Amazon VPC Container Network Interface (VPC CNI) プラグイン に Kubernetes NetworkPolicies のサポートを導入しました。これにより、ポッド間通信を名前空間レベルでセグメント化できるようになりました。クラスター全体のネットワークフィルターを一元管理することで、Kubernetes ネットワーク環境の防御態勢をさらに強化できるようになりました。また、クラスター管理者は、完全修飾ドメイン名 (FQDN) に基づいて外部エンドポイントへのトラフィックをフィルタリングする送信ルールを使用して、クラウドまたはオンプレミスのクラスター外部リソースへの不正アクセスを防止するためのより安定した予測可能なアプローチを利用できるようになりました。\n  これらの新しいネットワークセキュリティ機能は、Kubernetes バージョン 1.29 以降を実行する新しい EKS クラスターのすべての商用 AWS リージョンで利用でき、既存のクラスターも今後数週間以内にサポートされる予定です。ClusterNetworkPolicy は、VPC CNI v1.21.0 以降を使用するすべての EKS クラスター起動モードで使用できます。DNS ベースのポリシーは、EKS オートモードによって起動された EC2 インスタンスでのみサポートされます。詳細については、Amazon EKS のドキュメントをご覧になるか、こちらのローンチブログ投稿をお読みください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "e67a4c669b9bdd577901c3882c5c591e336b4b42",
      "title": "ACM で Kubernetes の自動化された証明書管理のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/acm-automated-certificate-management-kubernetes/",
      "pubDate": "2025-12-15T08:00:00.000Z",
      "contentSnippet": "AWS Certificate Manager (ACM) は、AWS Controllers for Kubernetes (ACK) を通じて Kubernetes ワークロードの証明書のプロビジョニングと配布を自動化するようになりました。以前から、ACM は Application Load Balancer や CloudFront などの AWS 統合サービスの証明書管理を自動化していました。しかし、Kubernetes で TLS を終了するアプリケーションで ACM 証明書を使用するには、API 経由で証明書とプライベートキーをエクスポートし、Kubernetes シークレットを作成し、更新時に更新するという手動の手順が必要でした。この統合により、ACM の自動化がパブリック証明書とプライベート証明書の両方の Kubernetes ワークロードに拡張され、ネイティブ Kubernetes API を使用して証明書を管理できるようになりました。\n  ACK では、証明書を Kubernetes リソースとして定義すると、ACK コントローラーが証明書ライフサイクル全体を自動化します。つまり、ACM から証明書をリクエストし、検証後にエクスポートし、証明書とプライベートキーで Kubernetes シークレットを更新し、更新時にそれらのシークレットを自動的に更新します。これにより、ACM のエクスポート可能なパブリック証明書 (2025 年 6 月に開始) をインターネットに接続するワークロードに使用したり、AWS Private CA のプライベート証明書を Amazon EKS やその他の Kubernetes 環境の内部サービスに使用したりできます。ユースケースには、アプリケーションポッド (NGINX、カスタムアプリケーション) での TLS の終了、サービスメッシュ通信 (Istio、Linkerd) の保護、サードパーティのイングレスコントローラー (NGINX Ingress、Traefik) の証明書の管理などがあります。証明書をハイブリッドおよびエッジの Kubernetes 環境に配布することもできます。\n  この機能は、ACM を利用できるすべての商用、AWS GovCloud (米国)、および AWS 中国リージョンで利用できます。\n 詳細については、GitHub のリンクにアクセスするか、ドキュメントおよび価格ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "49ed6f42489a8748b5022fd6fb6744e111104253",
      "title": "Amazon EC2 M7a インスタンスが欧州 (ロンドン) リージョンで使用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-m7a-instances-europe-london-region/",
      "pubDate": "2025-12-15T08:00:00.000Z",
      "contentSnippet": "本日より、汎用 Amazon EC2 M7a インスタンスが AWS 欧州 (ロンドン) リージョンで利用可能になりました。M7a インスタンスは、最大周波数が 3.7 GHz の第 4 世代 AMD EPYC プロセッサ (コードネーム Genoa) を搭載しており、M6a インスタンスと比較して最大 50% 高いパフォーマンスを発揮します。\n \n今回のリージョン追加により、M7a インスタンスは、米国東部 (オハイオ)、米国東部 (バージニア北部)、米国西部 (オレゴン)、アジアパシフィック (シドニー、東京)、欧州 (フランクフルト、アイルランド、スペイン、ストックホルム、ロンドン) の各 AWS リージョンでご利用いただけるようになりました。これらのインスタンスは、Savings Plans、リザーブド、オンデマンド、およびスポットインスタンスとして購入できます。使用を開始するには、AWS マネジメントコンソール、AWS コマンドラインインターフェイス (CLI)、および AWS SDK にアクセスしてください。詳細については、M7a インスタンスのページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "fd8606ae7b473bbd13f0da6a3a7d5885b0f39457",
      "title": "AWS Shield ネットワークセキュリティディレクターがマルチアカウント分析のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-shield-network-security-director-multi-account-analysis",
      "pubDate": "2025-12-12T15:00:00.000Z",
      "contentSnippet": "本日、AWS Shield は、ネットワークセキュリティディレクター向けのマルチアカウントネットワークセキュリティ管理と自動ネットワーク分析を発表しました。こちらは現在プレビュー段階です。AWS Shield ネットワークセキュリティディレクターは、AWS 組織内の AWS リソースを可視化し、ネットワークセキュリティサービスの不足や設定ミスを特定し、修復手順を推奨します。\n  ネットワークセキュリティディレクターを使用すると、委任管理者アカウントを指定して、そのアカウントから AWS 組織内の複数のアカウントまたは組織単位の継続的なネットワーク分析を開始できます。その後、各アカウントのネットワークトポロジ、ネットワークセキュリティ検出結果、ネットワークセキュリティサービスの不足または設定ミスに対する推奨修復方法を一元的に確認できます。また、AWS Shield ネットワークセキュリティディレクターが特定したネットワークセキュリティの設定ミスを、AWS マネジメントコンソールやチャットアプリケーション内の Amazon Q Developer から簡単にまとめて報告できます。\n  AWS Shield ネットワークセキュリティディレクターが、欧州 (アイルランド)、欧州 (フランクフルト)、アジアパシフィック (香港)、アジアパシフィック (シンガポール)、オーストラリア (シドニー) の 5 つの AWS リージョンでも利用できるようになりました。\n  詳細については、概要ページにアクセスしてください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "e47f3df4c90befb0ea19673910866617e4174a62",
      "title": "Amazon EMR Managed Scaling がさらに 7 つの AWS リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-emr-managed-scaling-additional-regions",
      "pubDate": "2025-12-12T15:00:00.000Z",
      "contentSnippet": "Amazon EMR Managed Scaling が、アジアパシフィック (マレーシア、メルボルン、ニュージーランド、台北、タイ)、カナダ西部 (カルガリー)、メキシコ (中部) の AWS リージョンで EC2 の EMR を使用しているお客様にご利用いただけるようになりました。Amazon EMR Managed Scaling は、可能な限り最小のコストで最高のパフォーマンスを発揮できるよう、EMR クラスターでの EC2 インスタンスのサイズを自動的に変更します。\n  Amazon EMR Managed Scaling を使用すると、クラスターの最小コンピューティング制限と最大コンピューティング制限を指定するだけで、パフォーマンスとリソース使用率が最適になるように、EC2 上の Amazon EMR によってクラスターのサイズが自動的に変更されます。Amazon EMR Managed Scaling は、ワークロード関連の主要なメトリックスを常に監視し、リソースを最大限に活用できるようにクラスターサイズを最適化するアルゴリズムを使用します。このアルゴリズムを使用すると、Amazon EMR では、ピーク時に EC2 クラスターをスケールアップし、アイドル時にスケールダウンできるため、コストを削減し、クラスター容量を最適化して最高のパフォーマンスを実現できます。Amazon EMR Managed Scaling は Amazon EC2 スポットインスタンスと併用することもできます。そのようにすると、未使用の EC2 容量をオンデマンド料金と比較して割引価格で活用できます。\n  Amazon EMR Managed Scaling がすべての AWS 商用リージョンで利用可能になりました。\n  Amazon EMR Managed Scaling は、EC2 バージョン 6.14 以降の Amazon EMR 上の Apache Spark、Apache Hive、および YARN ベースのワークロードでサポートされています。詳細と開始方法については、Amazon EMR Managed Scaling の ユーザーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "136105692ad1e9ea3e4f84b9c123a6857d0fed9f",
      "title": "AWS DataSync がオンプレミスのファイル転送のスケーラビリティとパフォーマンスを強化",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-datasync-scalability-performance-on-premises-file-transfers",
      "pubDate": "2025-12-12T15:00:00.000Z",
      "contentSnippet": "AWS DataSync の拡張モードは、オンプレミスのファイルサーバーと Amazon S3 の間のデータ転送をサポートするようになりました。これにより、お客様は DataSync 基本モードよりも高いパフォーマンスで、事実上無制限のファイル数までスケールするデータセットを転送できます。\n  AWS DataSync は、ネットワーク上のデータ移動を最適化する安全で高速なファイル転送サービスです。拡張モードでは、並列処理を使用してあらゆるサイズのデータセットのパフォーマンスとスケーラビリティを向上させながら、ファイル数の制限を排除し、詳細な転送メトリクスを提供することでモニタリングと管理を強化します。これまでは、Amazon S3 ロケーション間のデータ転送とマルチクラウド転送に拡張モードを使用できました。今回の発表により、拡張モードの機能が拡張され、オンプレミスの NFS または SMB ファイルサーバーと Amazon S3 間の転送がサポートされるようになりました。拡張モードを使用すると、お客様はトレーニングデータセットを AWS に迅速に移動することで生成 AI ワークロードを加速し、オンプレミスのデータをクラウドベースのパイプラインと同期することでデータレイク分析を強化し、アーカイブとクラウドモダナイズのための大規模な移行を推進できます。\n  この新しい機能は、AWS DataSync が提供されているすべての AWS リージョンでご利用いただけます。使用を開始するには、AWS DataSync コンソールにアクセスしてください。詳細については、AWS DataSync のドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "eb5f6ebbf5180c5b97a71895d5efe062be3c29d3",
      "title": "Amazon MSK Replicator がさらに 10 の AWS リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-msk-replicator-additional-aws-regions",
      "pubDate": "2025-12-12T15:00:00.000Z",
      "contentSnippet": "Amazon MSK Replicator を使用した Amazon Managed Streaming for Apache Kafka (Amazon MSK) クラスター全体でのストリーミングデータのレプリケートが、以下のさらに 10 の AWS リージョンで利用できるようになりました: 中東 (バーレーン)、中東 (UAE)、アジアパシフィック (ジャカルタ)、アジアパシフィック (香港)、アジアパシフィック (大阪)、アジアパシフィック (メルボルン)、アフリカ (ケープタウン)、欧州 (ミラノ)、欧州 (チューリッヒ)、イスラエル (テルアビブ)。\n  MSK Replicator は Amazon MSK の機能で、数回クリックするだけで、異なる、または同じ AWS リージョンにある Amazon MSK クラスター間でデータを確実にレプリケートできます。MSK Replicator を使用すると、リージョンでの耐障害性に優れたストリーミングアプリケーションを簡単に構築し、可用性とビジネス継続性を向上させることができます。MSK Replicator では MSK クラスター間の自動非同期レプリケーションを実現できるため、カスタムコードの記述、インフラストラクチャの管理、クロスリージョンのネットワーク設定が不要になります。MSK Replicator は基盤となるリソースを自動的にスケールするため、容量をモニタリングまたは拡張しなくてもオンデマンドでデータをレプリケートできます。MSK Replicator では、トピック構成、アクセスコントロールリスト (ACL)、コンシューマーグループのオフセットなど、必要な Kafka メタデータもレプリケートされます。あるリージョンで予期しないイベントが発生した場合は、他の AWS リージョンにフェイルオーバーして、シームレスに処理を再開できます。\n  Amazon MSK コンソールまたは Amazon CLI から MSK Replicator の利用を開始できます。今回のリリースにより、MSK Replicator は 35 の AWS リージョンで利用できるようになりました。詳細については、MSK Replicator のドキュメント、製品ページ、価格ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "ec035998958cc01fa7ce2aae4c2e4cf89cc46b10",
      "title": "AWS DataSync が拡張モードに Terraform のサポートを導入",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/datasync-terraform-enhanced-mode/",
      "pubDate": "2025-12-12T08:00:00.000Z",
      "contentSnippet": "AWS DataSync Terraform モジュールが S3 ロケーション間の転送の拡張モードをサポートするようになり、大規模な高性能データ転送を簡単にセットアップできるようになりました。\n  AWS DataSync は、ネットワーク上のデータ移動を最適化する安全で高速なファイル転送サービスです。拡張モードでは、並列処理を使用してあらゆるサイズのデータセットのパフォーマンスとスケーラビリティを向上させながら、ファイル数の制限を排除し、詳細な転送メトリクスを提供することでモニタリングと管理を強化します。拡張モード用に設定された DataSync タスクを Terraform を使用して自動的にプロビジョニングできるようになりました。これにより、時間がかかり、エラーが発生しやすい手動の設定手順が不要になり、組織全体でスケールすることができる、一貫性のある反復可能な、バージョン管理されたデプロイプロセスが実現します。\n  AWS DataSync Terraform モジュールには、GitHub または Terraform Registry でアクセスできます。\n  DataSync の詳細については、AWS DataSync のドキュメントを参照してください。DataSync が利用可能なすべてのリージョンを確認するには、AWS リージョン表をご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "49356a46f53748bbc6b9b2708acc941577b91180",
      "title": "AWS Systems Manager による SAP ABAP アプリケーションのベストプラクティスコンプライアンスの検証",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/compliance-sap-abap-systems-manager/",
      "pubDate": "2025-12-12T08:00:00.000Z",
      "contentSnippet": "AWS Systems Manager (AWS SSM) Configuration Manager では、AWS 上の SAP ABAP ベースのアプリケーションを AWS Well-Architected フレームワークの SAP Lens で定義されているベストプラクティスに照らして自動的にテストできるようになりました。\n  SAP アプリケーションを最適な構成に保つには、SAP 管理者が AWS、SAP、オペレーティングシステムベンダーなど、複数のソースから最新のベストプラクティスを入手し、それらの構成を手動で確認してコンプライアンスを検証する必要があります。AWS SSM Configuration Manager は、AWS で実行されている SAP アプリケーションをこれらの標準に照らして自動的に評価し、構成ミスを事前に特定し、具体的な修正手順を推奨します。これにより、業務への影響が出る前に必要な変更を加えることができます。今回のリリースにより、SAP HANA および ABAP アプリケーションの構成チェックをスケジュールしたり、オンデマンドで実行したりできます。\n  SSM for SAP Configuration Manager は、SSMSAP が利用可能な AWS リージョンで利用できます。\n  詳細については、リリースブログを読むか、AWS Systems Manager for SAP のドキュメントを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "81a51220eb5efe8ae19395a8da5080648bf39c1a",
      "title": "Amazon EC2 X2iedn インスタンスが AWS の欧州 (チューリッヒ) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-x2iedn-instances-zurich-region/",
      "pubDate": "2025-12-12T08:00:00.000Z",
      "contentSnippet": "本日より、メモリ最適化された Amazon Compute Cloud (Amazon EC2) X2iedn インスタンスが AWS の欧州 (チューリッヒ) リージョンで利用できるようになりました。これらのインスタンスは、第 3 世代の Intel Xeon スケーラブルプロセッサを搭載し、AWS Nitro System で構築されており、メモリを大量に消費するワークロード向けに設計されています。前世代の X1e インスタンスと比較して、パフォーマンス、費用対効果、メモリ 1 GiB あたりのコストが改善されています。これらのインスタンスは、データベースでの Business Suite on HANA、SAP S/4HANA、Data Mart Solutions on HANA、Business Warehouse on HANA、SAP BW/4HANA、SAP NetWeaver といったワークロードの実行について、SAP 認定を取得しています。\n  詳細については、EC2 X2i インスタンスのページを参照するか、AWS サポートまでお問い合わせください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "72b94db71aff342c9f823f874e79d2f535fd9959",
      "title": "AWS Elastic Beanstalk の利用可能リージョンが拡大",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/elastic-beanstalk-additional-regions/",
      "pubDate": "2025-12-12T08:00:00.000Z",
      "contentSnippet": "AWS Elastic Beanstalk がアジアパシフィック (ニュージーランド、メルボルン、マレーシア、ハイデラバード)、カナダ西部 (カルガリー)、欧州 (チューリッヒ) で一般提供開始されることをお知らせいたします。\n  AWS Elastic Beanstalk は、AWS でのアプリケーションのデプロイと管理を簡素化するサービスです。このサービスを使用すると、デプロイ、キャパシティプロビジョニング、負荷分散、自動スケーリング、アプリケーションヘルスモニタリングを自動的に処理できるため、デベロッパーはコードの作成に集中できます。\n  リージョンおよび提供サービスの一覧については、AWS リージョン表をご覧ください。\n  AWS Elastic Beanstalk の使用を開始するには、AWS Elastic Beanstalk のデベロッパーガイドを参照してください。Elastic Beanstalk の詳細については、Elastic Beanstalk の製品ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "d413389c43af14471cc95ff340d792a2006a4d28",
      "title": "Amazon EC2 X2iedn インスタンスが AWS アジアパシフィック (タイ) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-x2iedn-instances-thailand-region/",
      "pubDate": "2025-12-12T08:00:00.000Z",
      "contentSnippet": "本日より、メモリ最適化された Amazon Compute Cloud (Amazon EC2) X2iedn インスタンスが AWS アジアパシフィック (タイ) リージョンで利用可能になりました。これらのインスタンスは、第 3 世代の Intel Xeon スケーラブルプロセッサを搭載し、AWS Nitro System で構築されており、メモリを大量に消費するワークロード向けに設計されています。前世代の X1e インスタンスと比較して、パフォーマンス、費用対効果、メモリ 1 GiB あたりのコストが改善されています。これらのインスタンスは、データベースでの Business Suite on HANA、SAP S/4HANA、Data Mart Solutions on HANA、Business Warehouse on HANA、SAP BW/4HANA、SAP NetWeaver といったワークロードの実行について、SAP 認定を取得しています。\n \n詳細については、EC2 X2i インスタンスのページを参照するか、AWS サポートまでお問い合わせください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "3a1cf1de614847985ae1399f1d07a9d0ce148678",
      "title": "Amazon Aurora DSQL が数秒でのクラスターの作成をサポート",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-aurora-dsql-cluster-creation-in-seconds",
      "pubDate": "2025-12-11T21:00:00.000Z",
      "contentSnippet": "Amazon Aurora DSQL が、より高速なクラスター作成をサポートするようになり、セットアップ時間が数分から数秒に短縮されました。\n  クラスターを数秒で作成できるようになったため、開発者は Aurora DSQL データベースを即座にプロビジョニングして、新しいアイデアのプロトタイプをすばやく作成できます。開発者は AWS コンソールに統合されたクエリエディタを使用して、外部クライアントを設定することなくすぐに構築を開始できます。また、Aurora DSQL モデルコンテキストプロトコル (MCP) サーバーを介して接続して AI を活用した開発ツールを有効にすることもできます。Aurora DSQL は、ワークロードのプロトタイプ作成でも本番環境の実行でも、事実上無制限のスケーラビリティ、アクティブ/アクティブ高可用性、ゼロインフラストラクチャ管理、従量課金制の価格設定を実現し、アプリケーションのニーズに合わせてデータベースを簡単にスケールできます。\n  この強化機能は、Aurora DSQL が提供されているすべてのリージョンでご利用いただけます。AWS 無料利用枠を使って、Aurora DSQL を無料で始めることができます。詳細については、Aurora DSQL のウェブページとドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "4925c05996b58039e5ca34cbf9c3f84dabf84f3b",
      "title": "Amazon WorkSpaces Secure Browser がウェブコンテンツのフィルタリングを導入",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-workspaces-secure-browser-web-content-filtering/",
      "pubDate": "2025-12-11T18:00:00.000Z",
      "contentSnippet": "Amazon WorkSpaces Secure Browser に、組織がウェブコンテンツへのアクセスを制御および監視できるようにする包括的なセキュリティおよびコンプライアンス機能であるウェブコンテンツのフィルタリングが追加されました。この新機能により、管理者はきめ細かなアクセスポリシーを定義し、25 以上の定義済みカテゴリを使用して特定の URL またはドメインカテゴリ全体をブロックし、Session Logger とシームレスに統合して監視とコンプライアンスレポートを強化できます。\n  既存の Chrome ドメイン制御ポリシーは引き続きサポートされますが、ウェブコンテンツのフィルタリングは、カテゴリベースのフィルタリングと強化されたログ機能を通じて、より包括的なウェブアクセス制御を実現します。組織は、企業全体にスケール可能な一元化されたポリシー管理を通じて、リモートワークのセキュリティとコンプライアンス要件をより適切に管理できます。IT セキュリティチームは、高度なセキュリティ環境向けにデフォルト拒否ポリシーを実装でき、コンプライアンス担当者は詳細なログ記録とモニタリング機能を活用できます。この機能では、特定のビジネスニーズに基づいてポリシーや例外をカスタマイズできるため、柔軟性が維持されます。\n  この機能は、米国東部 (バージニア北部)、米国西部 (オレゴン)、カナダ (中部)、欧州 (フランクフルト、ロンドン、アイルランド)、アジアパシフィック (東京、ムンバイ、シドニー、シンガポール) を含む 10 の AWS リージョンで追加料金なしで利用できます。WorkSpaces Secure Browser は従量制料金です。\n  WorkSpaces Secure Browser を使い始めるには、「Amazon WorkSpaces Secure Browser の開始方法」を参照してください。この機能は AWS コンソールで有効にでき、URL ブロックリストまたは URL 許可リストのブラウザポリシーを自動的に移行できます。この機能の詳細については、機能ドキュメントを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "fc9e944f9f2ebb787d1a4268cf07c56feca89052",
      "title": "Amazon Aurora PostgreSQL が Kiro powers との統合をサポート",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-aurora-postgresql-integration-kiro-powers",
      "pubDate": "2025-12-11T15:00:00.000Z",
      "contentSnippet": "本日、AWS は Amazon Aurora PostgreSQL 互換エディションと Kiro powers の統合を発表しました。これにより、開発者は Kiro を使用した AI エージェント支援開発により、Aurora PostgreSQL を基盤とするアプリケーションをより迅速に構築できるようになります。Kiro powers は、Kiro パートナーによって検証された、厳選されパッケージ化されたモデルコンテキストプロトコル (MCP) サーバー、ステアリングファイル、フックのリポジトリであり、特殊なソフトウェア開発およびデプロイのユースケースを加速します。Aurora PostgreSQL 向け Kiro power は、MCP サーバーと対象を絞ったデータベース開発ガイダンスをパッケージ化することで、Kiro エージェントに Aurora PostgreSQL の操作とスキーマ設計に関する専門知識を即座に提供します。\n  Aurora PostgreSQL 向け Kiro power には、データプレーン操作 (クエリ、テーブル作成、スキーマ管理) およびコントロールプレーン操作 (クラスター作成) のための Aurora PostgreSQL MCP サーバーを介した直接データベース接続と、Aurora PostgreSQL 固有のベストプラクティスによるステアリングファイルがバンドルされています。開発者がデータベースタスクに取り組むとき、power は新しい Aurora クラスターの新規作成、スキーマの設計、クエリの最適化など、関連するガイダンスを動的に読み込むため、AI エージェントは特定のタスクに必要なコンテキストのみを受け取ります。\n  Aurora PostgreSQL power は Kiro IDE 内で利用可能で、Kiro powers ウェブページからワンクリックでインストールでき、すべての AWS リージョンで Aurora PostgreSQL クラスターを作成および管理できます。開発ユースケースの詳細については、このブログ投稿をご覧ください。Aurora PostgreSQL MCP サーバーの詳細については、当社のドキュメントをご覧ください。\n  Amazon Aurora は PostgreSQL との完全互換性を備えており、圧倒的な高いパフォーマンスおよび可用性を世界規模で実現するように設計されています。このサービスは、組み込みのセキュリティ、継続的なバックアップ、サーバーレスコンピューティング、最大 15 のリードレプリカ、自動化されたマルチリージョンレプリケーションを提供します。Amazon Aurora の使用を開始するには、開始方法のページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "05fe58e60a393185d0c31969c21d43fdd4589cd1",
      "title": "Amazon Cognito アイデンティティプールが AWS PrivateLink とのプライベート接続のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-cognito-identity-pools-private-connectivity-aws-privatelink",
      "pubDate": "2025-12-11T15:00:00.000Z",
      "contentSnippet": "Amazon Cognito アイデンティティプールが AWS PrivateLink をサポートしました。これにより、仮想プライベートクラウド (VPC) と Cognito 間のプライベート接続を通じて、フェデレーティッドアイデンティティと AWS 認証情報を安全に交換できるようになりました。これにより、認証トラフィックをパブリックインターネット経由でルーティングする必要がなくなり、ワークロードのセキュリティが強化されます。アイデンティティプールは、認証済みアイデンティティとゲストアイデンティティを AWS Identity and Access Management (IAM) ロールにマッピングし、この新機能を使用して一時的な AWS 認証情報を安全でプライベートな接続を通じて提供します。\n  PrivateLink 接続は、Amazon Cognito アイデンティティプールが利用可能なすべての AWS リージョンで使用できます。ただし、Sinnet が運営する AWS 中国 (北京) リージョンと AWS GovCloud (米国) リージョンを除きます。AWS PrivateLink で VPC エンドポイントを作成すると、追加料金が発生します。詳細については、AWS PrivateLink の料金ページをご確認ください。まず、AWS マネジメントコンソール、AWS コマンドラインインターフェイス (CLI)、AWS Software Development Kit (SDK)、AWS Cloud Development Kit (CDK)、または AWS CloudFormation を使用して、Amazon Cognito アイデンティティプール用の AWS PrivateLink VPC インターフェイスエンドポイントを作成します。詳細については、VPC インターフェイスエンドポイントの作成に関するドキュメントと Amazon Cognito デベロッパーガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "837a7e9e0f502733c0a5e4243dc407d984430931",
      "title": "Amazon CloudWatch SDK で最適化された JSON プロトコルと CBOR プロトコルをサポート",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-cloudwatch-sdk-json-cbor-protocols",
      "pubDate": "2025-12-11T12:00:00.000Z",
      "contentSnippet": "Amazon CloudWatch では、CloudWatch SDK で JSON プロトコルと Concise Binary Object Representation (CBOR) プロトコルの両方がサポートされることを発表します。これにより、CloudWatch のお客様はレイテンシーの減少とパフォーマンスの向上を実現できます。この SDK では、新しいデフォルト通信プロトコルとして自動的に JSON または CBOR が使用されるため、エンドツーエンドの処理レイテンシーが減少するだけでなく、ペイロードサイズ、アプリケーションクライアント側の CPU、およびメモリ使用量が削減されます。\n  お客様は CloudWatch SDK を直接使用するか、Infrastructure as Code ソリューションを介して使用し、モニタリングリソースを管理します。コントロールプレーン操作のレイテンシーとペイロードサイズを減らすことで、お客様は運用保守およびリソースの使用量とコストを最適化できます。JSON および CBOR データ形式は、従来の AWS Query プロトコルよりも優れたパフォーマンスを実現するために設計された標準です。\n  JSON および CBOR プロトコル用 CloudWatch SDK サポートは、Amazon CloudWatch が利用可能なすべての AWS リージョンにおいて、一般提供されているすべての AWS SDK 言語バリアントでご利用いただけます。\n  このパフォーマンスの向上を活用するには、こちらから最新の SDK バージョンをインストールしてください。AWS SDK の詳細については、Amazon の開発ツールに関するページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "456ac9b80bf5dd0cd5a05bd65b4930217308f88e",
      "title": "Amazon EC2 C7i インスタンスが アジアパシフィック (ハイデラバード) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-c7i-instances-asia-pacific-hyderabad-region/",
      "pubDate": "2025-12-11T08:00:00.000Z",
      "contentSnippet": "本日より、カスタムの第 4 世代 Intel Xeon スケーラブルプロセッサ (コードネーム Sapphire Rapids) を搭載した Amazon Elastic Compute Cloud (Amazon EC2) C7i インスタンスが、アジアパシフィック (ハイデラバード) リージョンで利用できるようになりました。カスタム Intel プロセッサによってサポートされる C7i インスタンスは AWS でのみ利用可能です。\n  C7i インスタンスは、C6i インスタンスと比較して最大 15% 優れたコストパフォーマンスを発揮し、バッチ処理、分散分析、広告配信、動画エンコーディングなど、コンピューティング集約型のすべてのワークロードに最適です。C7i インスタンスは、より大きなインスタンスサイズ (最大 48xlarge) と、2 つのベアメタルサイズ (metal-24xl、metal-48xl) で提供されています。これらのベアメタルサイズでは、Intel の内蔵アクセラレーターである Data Streaming Accelerator、In-Memory Analytics Accelerator、QuickAssist Technology がサポートされるため、データ操作の負荷を効率的に軽減したり、データ操作を高速化したり、ワークロードのパフォーマンスを最適化したりできます。\n  C7i インスタンスでは、CPU ベースの ML などのアプリケーションの行列の乗法演算を高速化する新しい Intel Advanced Matrix Extension (AMX) がサポートされています。お客様は 1 つの C6i インスタンスに最大 28 個の EBS ボリュームをアタッチできるのに対し、1 つの C7i インスタンスには最大 128 個の EBS ボリュームをアタッチできます。これにより、C6i インスタンスよりも大量のデータを処理し、ワークロードを拡張し、パフォーマンスを向上させることができます。\n  詳細については、Amazon EC2 C7i Instances をご覧ください。使用を開始するには、AWS マネジメントコンソールをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "769903e1bc50f8c60571b641a8b66adf71827639",
      "title": "Amazon EC2 I7i インスタンスが追加の AWS リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-i7i-instances-additional-regions/",
      "pubDate": "2025-12-11T08:00:00.000Z",
      "contentSnippet": "Amazon Web Services (AWS) は、AWS アジアパシフィック (シンガポール、ジャカルタ)、欧州 (ストックホルム) リージョンにおいて、高性能のストレージ最適化 Amazon EC2 I7i インスタンスが利用可能になったことを発表しました。このインスタンスは、オールコアターボ周波数 3.2 GHz の第 5 世代 Intel Xeon スケーラブルプロセッサを搭載しており、前世代の I4i インスタンスと比較して、コンピューティングパフォーマンスが最大で 23%、コストパフォーマンスが 10% 以上向上します。第 3 世代の AWS Nitro SSD を搭載した I7i インスタンスでは、最大 45 TB の NVMe ストレージを提供し、I4i インスタンスと比較して、リアルタイムストレージのパフォーマンスが最大 50% 向上し、ストレージ I/O レイテンシーが最大 50% 短縮され、ストレージ I/O レイテンシーの変動が最大 60% 減少します。\n  I7i インスタンスは、数 TB の中小規模データセットにアクセスするために、リアルタイムの低レイテンシーアクセスと非常に高いランダム IOPS パフォーマンスを必要とする、I/O 集約型でレイテンシーの影響を受けやすいワークロードに最適です。I7i インスタンスは、最大 16 KB のブロックサイズを備えた Torn Write Prevention 機能をサポートしているため、データベースパフォーマンスのボトルネックを解消できます。\n  I7i インスタンスは、11 サイズ (最大 48xlarge の 9 種類の仮想サイズと 2 種類のベアメタルサイズ) で提供され、最大 100 Gbps のネットワーク帯域幅と 60 Gbps の Amazon Elastic Block Store (EBS) 帯域幅をサポートします。\n 詳細については、I7i インスタンスのページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "641b70e9a1e6e43244f82ba2823edb2b8b335707",
      "title": "Amazon EC2 ハイメモリ U7i インスタンスを利用できるリージョンが拡大",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-high-memory-u7i-instances-additional-regions/",
      "pubDate": "2025-12-11T08:00:00.000Z",
      "contentSnippet": "24 TB のメモリを搭載した Amazon EC2 ハイメモリ U7i インスタンス (u7in-24tb.224xlarge) が AWS 欧州 (フランクフルト) で、16 TB のメモリを搭載した U7i インスタンス (u7in-16tb.224xlarge) が AWS アジアパシフィック (ムンバイ) で、6 TB のメモリを搭載した U7i インスタンス (u7i-6tb.112xlarge) が AWS 欧州 (パリ) リージョンで利用可能になりました。AWS 第 7 世代に含まれる U7i インスタンスは、カスタム第 4 世代 Intel Xeon スケーラブルプロセッサ (Sapphire Rapids) を搭載しています。U7in-24tb インスタンスは 24TiB の DDR5 メモリ、U7in-16tb インスタンスは 16TiB の DDR5 メモリ、U7i-6tb インスタンスは 6TiB の DDR5 メモリを提供します。これによりお客様は、急速に拡大するデータ環境においてトランザクション処理のスループットをスケールできます。\n \nU7i-6tb インスタンスは 448 個の vCPU、最大 100 Gbps の Elastic Block Storage (EBS) をサポートし、より高速なデータ読み込みとバックアップを実現します。また、最大 100 Gbps のネットワーク帯域幅を提供し、ENA Express をサポートします。U7in-16tb インスタンスは 896 個の vCPU、最大 100 Gbps の Elastic Block Storage (EBS) をサポートし、より高速なデータ読み込みとバックアップを実現します。また、最大 200 Gbps のネットワーク帯域幅を提供し、ENA Express をサポートします。U7in-24tb インスタンスは 896 個の vCPU、最大 100 Gbps の Elastic Block Storage (EBS) をサポートし、より高速なデータ読み込みとバックアップを実現します。また、最大 200 Gbps のネットワーク帯域幅を提供し、ENA Express をサポートします。U7i インスタンスは、SAP HANA、Oracle、SQL Server など、ミッションクリティカルなインメモリデータベースを使用しているお客様に最適です。\n \nU7i インスタンスの詳細については、High Memory インスタンスのページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "206a8e4ca98958b434ffd4f0ca1a5e1a28d83b67",
      "title": "AWS Application Migration Service が IPv6 のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/application-migration-service-ipv6/",
      "pubDate": "2025-12-11T08:00:00.000Z",
      "contentSnippet": "AWS Application Migration Service (MGN) は、サービス通信とアプリケーション移行の両方でインターネットプロトコルバージョン 6 (IPv6) をサポートするようになりました。これにより、組織は IPv6 アドレスを使用するアプリケーションを移行できるため、最新のネットワークインフラストラクチャへの移行が可能になります。\n \nIPv4 と IPv6 の両方の通信をサポートする新しいデュアルスタックサービスエンドポイントを使用して、AWS MGN に接続できます。アプリケーションの移行時には、ネットワーク接続とセキュリティを維持しながら、IPv4 または IPv6 を使用してレプリケーションデータを転送できます。その後、テストおよびカットオーバーフェーズでは、選択したネットワーク構成 (IPv4、IPv6、またはデュアルスタック) を使用して、ターゲット環境でサーバーを起動できます。\n  この機能は、AWS MGN および Amazon Elastic Compute Cloud (Amazon EC2) デュアルスタックエンドポイントをサポートするすべての AWS リージョンで利用できます。サポートされているリージョンについては、AWS MGN がサポートする AWS リージョンと Amazon EC2 エンドポイントのドキュメントをご覧ください。\n  AWS MGN の詳細については、製品ページまたはドキュメントをご覧ください。使用を開始するには、AWS Application Migration Service コンソールにサインインします。",
      "siteName": "AWS What's New"
    },
    {
      "id": "1715fb770ba3d8bdda1d90386b25678af3a3b005",
      "title": "Amazon ECS が AWS Fargate でのカスタムのコンテナ停止シグナルのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ecs-custom-container-stop-signals-fargate/",
      "pubDate": "2025-12-10T20:48:00.000Z",
      "contentSnippet": "Amazon Elastic Container Service (Amazon ECS) は、AWS Fargate で実行されている Linux タスクに対するカスタムのコンテナ停止シグナルをサポートするようになりました。これにより、タスクが停止した際に、Open Container Initiative (OCI) イメージで設定された停止シグナルが実行されるようになります。この機能強化では、Fargate のタスク終了を各コンテナで設定される終了シグナルに合わせることにより、グレースフルシャットダウンの動作が改善されます。\n  以前は、AWS Fargate で実行されている Amazon ECS タスクが停止すると、各 Linux コンテナは必ず SIGTERM を受信し、その後、設定したタイムアウト後に SIGKILL を受信していました。新しい動作では、Amazon ECS コンテナエージェントはコンテナイメージ設定から停止シグナルを読み取り、タスクを停止するときにそのシグナルを送信します。グレースフルシャットダウンに関して SIGQUIT や SIGINT などのシグナルに依存するコンテナは、Fargate で実行される際に、意図した通りの終了を実行できるようになりました。STOPSIGNAL が設定されていない場合、Amazon ECS は引き続き SIGTERM をデフォルトで送信します。\n  お客様は、OCI 準拠のコンテナイメージに STOPSIGNAL 命令 (STOPSIGNAL SIGQUIT など) を追加することで、AWS Fargate を使用する Amazon ECS において、カスタムの停止シグナルを使用できます。コンテナで定義される停止シグナルのサポートは、すべての AWS リージョンで利用できます。詳細については、ECS 開発者ガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "39f19a307d1a5a331093e42b995deffeb9cc1e12",
      "title": "Amazon EC2 C8gb インスタンスの一般提供を開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/generally-available-amazon-ec2-c8gb-instances",
      "pubDate": "2025-12-10T18:00:00.000Z",
      "contentSnippet": "AWS は本日、新しい Amazon Elastic Block Storage (Amazon EBS) 最適化 Amazon Elastic Compute Cloud (Amazon EC2) C8gb インスタンスの一般提供を開始しました。このインスタンスは AWS Graviton4 プロセッサを搭載しており、AWS Graviton3 プロセッサと比較して最大 30% 優れたコンピューティングパフォーマンスを発揮します。また、最大 150 Gbps の EBS 帯域幅で、同じサイズの同等の Graviton4 ベースインスタンスよりも高い EBS パフォーマンスを実現します。この新しい EBS 最適化 EC2 インスタンスが提供する高いブロックストレージパフォーマンスを活用することで、ワークロードの実行コストを最適化しながら、高パフォーマンスのファイルシステムなどのワークロードのパフォーマンスとスループットをスケールできます。\n \nスケーラビリティを高めるため、このインスタンスでは metal-24xl サイズを含む最大 24xlarge のインスタンスサイズが用意されています。また、最大 192 GiB のメモリ、最大 150 Gbps の EBS 帯域幅、最大 200 Gbps のネットワーク帯域幅を提供します。このインスタンスは 16xlarge、24xlarge、metal-24xl サイズで Elastic Fabric Adapter (EFA) ネットワークをサポートしています。これにより、密結合のクラスター上にデプロイされたワークロードのレイテンシーを低減し、クラスターのパフォーマンスを向上させることができます。\n \n新しい C8gb インスタンスは、米国東部 (バージニア北部) および米国西部 (オレゴン) リージョンでご利用いただけます。メタルサイズは米国東部 (バージニア北部) リージョンでのみ利用できます。\n \n詳細については、Amazon EC2 C8gb インスタンスをご覧ください。Graviton の利用を開始するには、「AWS Graviton でコンピューティングをレベルアップする」ページにアクセスしてください。使用を開始するには、AWS マネジメントコンソール、AWS コマンドラインインターフェイス (AWS CLI)、AWS SDK をご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "8f49bb4d3862f1de3c70771c8a8953f109576533",
      "title": "Amazon EC2 X8g インスタンスがアジアパシフィック (シドニー) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-x8g-instances-asia-pacific-sydney/",
      "pubDate": "2025-12-10T16:00:00.000Z",
      "contentSnippet": "本日より、Amazon Elastic Compute Cloud (Amazon EC2) X8g インスタンスがアジアパシフィック (シドニー) リージョンで利用できます。これらのインスタンスは AWS Graviton4 プロセッサを搭載しており、AWS Graviton2 ベースの Amazon EC2 X2gd インスタンスよりも最大 60% 高いパフォーマンスを発揮します。X8g インスタンスは、合計メモリが最大 3 TiB で、他の Graviton4 ベースのインスタンスと比較して vCPU あたりのメモリも増加しています。EC2 X シリーズインスタンスの中で最もコストパフォーマンスに優れており、Electronic Design Automation (EDA) ワークロード、インメモリデータベース (Redis、Memcached)、リレーショナルデータベース (MySQL、PostgreSQL)、リアルタイムビッグデータ分析、リアルタイムキャッシュサーバー、メモリ集約型のコンテナ化されたアプリケーションなど、メモリを大量に使用するワークロードに最適です。\n  X8g インスタンスは、Graviton2 ベースの X2gd インスタンスよりも最大 3 倍大きい vCPU (最大 48xlarge) とメモリ (最大 3 TiB) を備えた、より大きなインスタンスサイズを提供します。これらは、Amazon Elastic Block Store (Amazon EBS) に最大 50 Gbps の拡張ネットワーク帯域幅と最大 40 Gbps の帯域幅を提供します。Elastic Fabric Adapter (EFA) ネットワーキングサポートは 24xlarge、48xlarge、およびベアメタルサイズで提供され、Elastic Network Adapter (ENA) Express サポートは、12xlarge を超えるインスタンスサイズで利用できます。\n  詳細については、「Amazon EC2 X8g Instances」をご覧ください。ワークロードを Graviton ベースのインスタンスに簡単に移行するには、AWS Graviton Fast Start プログラムを参照してください。使用を開始するには、AWS マネジメントコンソール、AWS コマンドラインインターフェイス (AWS CLI)、AWS SDK のいずれかにアクセスしてください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "28792ca77e77ee6b650cd0a05c82c32821230b32",
      "title": "Amazon ElastiCache Serverless が同一スロットの WATCH コマンドのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-elasticache-serverless-same-slot-watch-command",
      "pubDate": "2025-12-10T15:00:00.000Z",
      "contentSnippet": "本日、Amazon ElastiCache Serverless が同一スロットトランザクションに対する WATCH コマンドをサポートするようになったことを発表します。これにより開発者は、同時実行性が高いシナリオでのデータの一貫性が向上した、より信頼性の高いアプリケーションを構築できるようになります。今回の発表により、WATCH コマンドはトランザクションを条件に応じて実行できるようになり、監視対象のキーが変更されていない場合にのみ実行されるようにします。\n  ElastiCache Serverless では、WATCH コマンドは、監視対象キーと同じハッシュスロット内のキーを使用するトランザクションに対して動作します。アプリケーションが同じハッシュスロットにないキーを監視しようとすると、CROSSSLOT エラーが発生します。開発者は、キー名のハッシュタグを使用して、キーが同じスロット内にハッシュ値を持つようにすることで、キーの配置を制御できます。ElastiCache Serverless が監視対象キーの状態を保証できない場合も、トランザクションは中止されます。\n  WATCH コマンドのサポートは、ElastiCache サーバーレスがサポートされているすべての AWS リージョンで追加料金なしで利用できます。開始するには、お好みのクライアントライブラリから WATCH コマンドを使用してトランザクションを作成します。条件付きトランザクションと WATCH コマンドの詳細については、 ElastiCache Serverless のドキュメントと Valkey トランザクションのドキュメントを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "16b1f5d3eac17862ff9050277738e8dcfad0cdc3",
      "title": "Amazon Braket が Qiskit 2.0 のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-braket-qiskit-2-0/",
      "pubDate": "2025-12-10T08:00:00.000Z",
      "contentSnippet": "Amazon Braket は Qiskit 2.0 をサポートするようになりました。これにより、量子開発者は、ネイティブプリミティブとクライアント側のコンパイル機能を備えた、最も人気のある量子ソフトウェアフレームワークの最新バージョンを使用できます。\n  今回のリリースでは、Braket は Qiskit の Sampler および Estimator プリミティブのネイティブ実装を提供します。これらは、Braket のプログラムセットを活用してバッチ処理を最適化し、一般的なラッパーアプローチと比較して実行時間とコストを削減します。ネイティブプリミティブはパラメータスイープと観測可能な測定値をサービス側で処理するため、お客様がこのロジックを手動で実装する必要はありません。さらに、双方向回路変換機能により、お客様は Braket デバイスに送信する前に Qiskit の広範なコンパイルフレームワークをクライアント側のトランスパイルのために使用できるようになります。そのため、エンタープライズのユーザーや研究者は、デバイスの特性評価実験やカスタムコンパイルパスのために必要な制御と再現性を得ることができます。\n  Qiskit 2.0 は、Amazon Braket を利用できるすべての AWS リージョンで利用できます。開始するには、Qiskit-Braket プロバイダーのドキュメントと Amazon Braket 開発者ガイドを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "e73f6bccb16221d99bff9d094e443fd0247ef451",
      "title": "AWS サポートセンターコンソールで、トラブルシューティングサポートケースのための画面共有のサポートが開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/support-center-console-screen-sharing/",
      "pubDate": "2025-12-10T08:00:00.000Z",
      "contentSnippet": "本日、AWS サポートセンターコンソールが、トラブルシューティングサポートケースのための画面共有をサポートするようになったことを発表します。この新機能により、チャットや通話の最中に仮想会議をリクエストしたり、会議ブリッジリンクからワンクリックでサポートコールに参加したりできるようになります。新しい仮想会議では、会議中に画面を共有したり、ケースの詳細にシームレスにアクセスしたりして、効率的なトラブルシューティングを行うことができます。この機能強化により、すべてのサポートに関するやり取りが AWS サポートセンターコンソール内で行えるようになるため、サポートエクスペリエンスが簡素化されます。\n \n詳細については、AWS サポートページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "a64b40a426341cc0856f7569bc47cadaef18b7bc",
      "title": "Amazon EC2 C8gn インスタンスを利用可能なリージョンが拡大",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-c8gn-instances-additional-regions",
      "pubDate": "2025-12-09T18:00:00.000Z",
      "contentSnippet": "本日より、最新世代の AWS Graviton4 プロセッサを搭載した Amazon Elastic Compute Cloud (Amazon EC2) C8gn インスタンスが、米国東部 (オハイオ) および中東 (UAE) の AWS リージョンで利用できるようになりました。新しいインスタンスは、Graviton3 ベースの Amazon EC2 C7gn インスタンスよりもコンピューティングパフォーマンスが最大で 30% 優れています。Amazon EC2 C8gn インスタンスには最新の第 6 世代 AWS Nitro Card が搭載されており、最大 600 Gbps のネットワーク帯域幅を提供します。これは、ネットワーク最適化 EC2 インスタンスの中で最高のネットワーク帯域幅です。\n  C8gn の強化されたネットワーク機能を活用して、パフォーマンスとスループットをスケールすると同時に、ネットワーク仮想アプライアンス、データ分析、CPU ベースの人工知能と機械学習 (AI/ML) 推論などのネットワーク集約型ワークロードの実行コストを最適化できます。\n  スケーラビリティを高めるため、C8gn インスタンスでは最大 48xlarge、最大 384 GiB メモリ、Amazon Elastic Block Store (EBS) への最大 60 Gbps の帯域幅までのインスタンスサイズが用意されています。C8gn インスタンスは 16xlarge、24xlarge、48xlarge、metal-24xl、metal-48xl サイズで Elastic Fabric Adapter (EFA) ネットワークをサポートしています。これにより、密結合のクラスター上にデプロイされたワークロードのレイテンシーを低減し、クラスターのパフォーマンスを改善できます。\n  C8gn インスタンスは、米国東部 (バージニア北部、オハイオ)、米国西部 (オレゴン、北カリフォルニア)、欧州 (フランクフルト、ストックホルム)、アジアパシフィック (シンガポール、マレーシア、シドニー、タイ)、中東 (UAE) の AWS リージョンで利用できます。\n  詳細については、Amazon C8gn インスタンスをご覧ください。Graviton の利用を開始するには、「AWS Graviton でコンピューティングをレベルアップする」ページにアクセスしてください。使用を開始するには、AWS マネジメントコンソール、AWS コマンドラインインターフェイス (AWS CLI)、AWS SDK をご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "3c7631cdd7e5e3be66e1824b54d6e784e3d388ab",
      "title": "Amazon EC2 X8g インスタンスが欧州 (ストックホルム) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-x8g-instances-europe-stockholm/",
      "pubDate": "2025-12-09T16:00:00.000Z",
      "contentSnippet": "本日より、Amazon Elastic Compute Cloud (Amazon EC2) X8g インスタンスが欧州 (ストックホルム) リージョンで利用可能になりました。これらのインスタンスは AWS Graviton4 プロセッサを搭載しており、合計メモリが最大 3 TiB で、他の Graviton4 ベースのインスタンスと比較して vCPU あたりのメモリも増加しています。X8g インスタンスは、Electronic Design Automation (EDA) ワークロード、インメモリデータベース (Redis、Memcached)、リレーショナルデータベース (MySQL、PostgreSQL)、リアルタイムビッグデータ分析、リアルタイムキャッシュサーバー、メモリを大量に使用するコンテナ化されたアプリケーションなど、メモリを大量に使用するワークロードに最適です。\n \nX8g インスタンスは、Graviton2 ベースの X2gd インスタンスよりも最大 3 倍大きい vCPU (最大 48xlarge) とメモリ (最大 3 TiB) を備えた、より大きなインスタンスサイズを提供します。これらは、Amazon Elastic Block Store (Amazon EBS) に最大 50 Gbps の拡張ネットワーク帯域幅と最大 40 Gbps の帯域幅を提供します。Elastic Fabric Adapter (EFA) ネットワーキングサポートは 24xlarge、48xlarge、およびベアメタルサイズで提供され、Elastic Network Adapter (ENA) Express サポートは、12xlarge を超えるインスタンスサイズで利用できます。\n \nX8g インスタンスは現在、米国東部 (バージニア北部、オハイオ)、米国西部 (オレゴン)、および欧州 (フランクフルト、ストックホルム) の各 AWS リージョンでご利用いただけます。\n \n詳細については、「Amazon EC2 X8g Instances」をご覧ください。ワークロードを Graviton ベースのインスタンスに簡単に移行するには、AWS Graviton Fast Start プログラムを参照してください。使用を開始するには、AWS マネジメントコンソール、AWS コマンドラインインターフェイス (AWS CLI)、AWS SDK のいずれかにアクセスしてください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "46927d2a8a9a893679eb3ff49e6377f2bb7ff360",
      "title": "AWS パートナーセントラルでオポチュニティ取引サイジング機能が利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-partner-central-opportunity-deal-sizing",
      "pubDate": "2025-12-09T15:00:00.000Z",
      "contentSnippet": "本日、AWS は AWS パートナーセントラルの取引サイジング機能を発表しました。この新機能は、APN カスタマーエンゲージメント (ACE) オポチュニティ内で利用でき、AI を活用した取引規模の見積りと AWS サービスの推奨事項を提供します。取引サイジング機能により、オポチュニティの作成または更新時における AWS 月次経常収益 (MMR) の見積りプロセスが簡素化されるため、パートナー様は取引管理にかかる時間を節約できます。\n  パートナー様は、オプションで AWS 料金見積りツールの URL をインポートできます。これにより、AWS サービスの選択とそれに対応する支出見積りがオポチュニティに自動入力されるため、手動での再入力が不要になります。料金見積りツールの URL を指定すると、取引サイジング機能により、価格戦略の最適化に関する推奨事項、コスト削減の可能性に関する分析、Migration Acceleration Program (MAP) の参加資格指標、モダナイズの取り組みに関する分析といった詳細なインサイトが得られます。こうした強化されたインサイトにより、パートナー様は技術的アプローチの改善や資金調達申請の強化を実現し、資金調達の承認プロセスを迅速化することができます。\n  取引サイジング機能は現在、世界中の AWS パートナーセントラルでご利用いただけます。この機能は、AWS パートナーセントラル、および米国東部 (バージニア北部) リージョンで利用可能な AWS Partner Central API for Selling の両方を通じてアクセスできます。\n  開始するには、コンソールで AWS パートナーセントラルにログインし、オポチュニティを作成または更新して、取引サイジング機能のインサイトを確認してください。CRM システムとの API 統合については、AWS パートナーセントラル API ドキュメントを参照してください。取引サイジング機能の詳細については、パートナーセントラルのセールスガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "7c8f10ae67588ff1779efa72dafa79fae3991bba",
      "title": "Amazon RDS および Aurora が自動バックアップのリソースタグ付けのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/rds-aurora-resource-tagging-automated-backups/",
      "pubDate": "2025-12-09T08:00:00.000Z",
      "contentSnippet": "Amazon RDS および Aurora が、自動バックアップとクラスター自動バックアップのリソースタグ付けをサポートするようになりました。親 DB インスタンスや DB クラスターとは別に自動バックアップにタグ付けできるようになるため、属性ベースのアクセス制御 (ABAC) が可能になり、リソース管理とコスト追跡が簡素化されます。\n \n今回のリリースにより、AWS マネジメントコンソール、API、または SDK を使用して、他の RDS リソースと同じように自動バックアップにタグを付けることができます。これらのタグを IAM ポリシーとともに使用して、自動バックアップへのアクセスと権限を制御できます。さらに、これらのタグを活用して、アプリケーション、プロジェクト、部門、環境などに応じてリソースを分類したり、自動バックアップのコストを管理、整理、追跡したりすることができます。例えば、アプリケーション固有のタグを作成し、自動バックアップの記述、削除、復元に関する権限を制御したり、アプリケーションのバックアップコストを整理および追跡したりすることが可能です。\n \nこの機能は、Aurora および RDS が利用可能な、AWS GovCloud (米国) リージョンを含む、すべての AWS リージョンで一般提供されています。\n \nAurora および RDS の自動バックアップのタグ付けについて詳しくは、Amazon Aurora リソースへのタグ付け、Amazon RDS リソースへのタグ付け、属性ベースのアクセス制御のためのタグの使用に関する Amazon ドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "abf87a984d83fb7e562781f11c75722e2d1f5655",
      "title": "Amazon GameLift Servers が AI を活用した支援でゲーム開発者向けの AWS コンソールを強化",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/gamelift-servers-console-developers-ai-powered/",
      "pubDate": "2025-12-09T08:00:00.000Z",
      "contentSnippet": "本日、Amazon GameLift Servers は AWS コンソールでの AI を活用した支援を発表しました。Amazon Q Developer を活用し、ゲーム開発者向けにカスタマイズされたガイダンスを提供します。この新機能により、GameLift Servers に関する専門知識が統合され、お客様は複雑なワークフローに対応したり、問題をトラブルシューティングしたり、ゲームサーバーのデプロイをより効率的に最適化したりできるようになります。\n  開発者は、Amazon GameLift Servers を介して、AWS コンソール内でゲームサーバーの統合、フリート設定、パフォーマンスの最適化に関する AI 支援の推奨事項に直接アクセスできるようになります。この機能強化により、意思決定プロセスの効率化、トラブルシューティング時間の短縮、リソース利用率の全体的な向上が図られ、コスト削減とプレイヤーエクスペリエンスの向上が実現します。\n  AI を活用した支援は、AWS 中国を除くすべての Amazon GameLift Servers サポート対象リージョンで利用できるようになりました。この新機能の詳細については、Amazon GameLift Servers のドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "da40f8b372671247469a36c25ec9a7b988df1df6",
      "title": "レポート自動化のための Amazon Quick Suite における Quick Research と Quick Flows の統合",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-quick-suite-research-flows-report-automation",
      "pubDate": "2025-12-08T15:00:00.000Z",
      "contentSnippet": "Amazon Quick Suite に、Quick Flows 内のステップとして Quick Research が含められました。この統合により、チームは自動化された複数ステップのワークフローの一部として包括的な調査レポートを生成できるようになり、研究プロジェクトを組織全体で共有できる再利用可能なワークフローに変えることができます。\n  Quick Suite は、組織がビジネスデータから答えを導き出し、インサイトからアクションへと迅速に移行できるように支援する、Amazon の新しい AI 搭載ワークスペースです。この統合により、チームは個別に分析を行う必要はなく、フロー内で自動的に調査を開始できるようになります。この機能のおかげで、チームは何百もの自動化されたユースケースから実証済みの調査方法を取り込んでスケールできるようになり、生産性の重大な課題に対応できます。また、この統合により、ユーザーはスケジュールされたトリガーを使用して調査ワークフローを自動化できるため、特定の時間に自動で調査を生成するフローを設定できます。一般的なユースケースには、アカウントプランの自動作成、製品コンプライアンス分析の標準化、定期的な業界レポートの作成などがあります。\n  ユーザーは、フロー作成者の指示と任意のユーザー入力に基づいて調査を生成する、事前設定されたフローの恩恵を受けます。生成された調査レポートは、アカウントチームがフォローアップできるように Salesforce の商談を更新したり、コンプライアンスチームがレビューできるように Jira チケットに投稿したり、特許弁護士に承認してもらう Asana タスクを作成したりするなど、後続のアクションを自動的にトリガーしたりするためにも利用できます。これにより、手作業で面倒な作業をしなくても一貫した分析を可能にする、「設定したら、あとは忘れる」型のワークフローが実現します。現在、Quick Research は、これらの自動化されたワークフロー内で運用されており、検証済みでソースを追跡できるインサイトを提供すると同時に、多様な企業データソースを横断する分析を合理化するという核心的な強みを維持しています。既存の Flows ユーザーは、より包括的な分析を利用できるようになります。\n  Quick Research と Flows の統合は、米国東部 (バージニア北部)、米国西部 (オレゴン)、アジアパシフィック (シドニー)、欧州 (アイルランド) の AWS リージョンで利用できます。調査ニーズの自動化について詳しくは、Quick Suite ユーザーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "8b028e80c451a32178c504682dacd9a85e1eb3bc",
      "title": "空間データのインサイトを加速させる Spatial Data Management on AWS を発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/spatial-data-management-spatial-data-insights/",
      "pubDate": "2025-12-08T08:00:00.000Z",
      "contentSnippet": "本日、AWS は、ユーザーに空間データの大規模な保存、強化、接続を可能にするソリューションである Spatial Data Management on AWS (SDMA) を発表しました。SDMA を使用すると、お客様は物理アセット (3D、地理空間、行動、時系列データ) を表すマルチモーダル空間データを、安全で一元化されたクラウド環境に保存できるようになります。SDMA は、お客様の空間データ、ISV SaaS アプリケーション、AWS サービス相互の接続を可能にするコラボレーションハブとして機能します。さらに、お客様は SDMA の収集ルールを使用して空間データをどのように整理、強化するかを定義できるため、一貫性とガバナンスの維持に役立てることができます。お客様は、SDMA の API、デスクトップアプリケーション、Web インターフェイスを使用して空間データを効率的に管理し、物理的な運用に関するインサイトと情報に基づいた意思決定を加速できます。\n \nSDMA は、お客様の空間データを安全で便利なクラウドリポジトリに集中させ、ワークフロー全体でのデータの透明性とアクセシビリティを強化します。.LAZ、.E57、.GLB、.GLTF を始めとする空間データファイル形式用の SDMA の自動メタデータ抽出機能を活用することで、データが発見しやすくなり、関係性を向上させることができます。SDMA の REST API とカスタマイズ可能なコネクタを使用すると、外部アプリケーションとの統合が簡単になり、手動でのファイル処理が不要になり、クラウドとオンプレミスの相互運用性が向上します。SDMA の直感的な Web インターフェイスとデスクトップインターフェイスにより、さまざまレベルの技術スキルを持つユーザーが空間データを効率的に管理できるようになります。自動生成されるファイルプレビューは、ワークフローの速度とデータの精度を向上させるように設計されており、ユーザーは大きなファイルをダウンロードしなくてもデータを表示し、検証できます。\n \nSDMA は、アジアパシフィック (東京、シンガポール、シドニー)、欧州 (フランクフルト、アイルランド、ロンドン)、米国東部 (バージニア北部、オハイオ)、米国西部 (オレゴン) の AWS リージョンで利用できます。\n \n詳細は、SDMA の製品ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "09d37c31f8439a41281996d8cbacbd8681422603",
      "title": "Amazon Connect がアウトバウンドキャンペーン向け WhatsApp チャネルをリリース",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/connect-whatsapp-channel-outbound-campaigns/",
      "pubDate": "2025-12-05T18:00:00.000Z",
      "contentSnippet": "Amazon Connect アウトバウンドキャンペーンで WhatsApp がサポートされるようになりました。これにより、顧客がエージェントへの問い合わせに利用している既存の WhatsApp ビジネスメッセージング機能がさらに拡張されます。これによりお客様は、任意のメッセージングプラットフォーム上でタイムリーなコミュニケーション (予約リマインダー、支払い通知、注文状況の更新、製品のレコメンデーションなど) を WhatsApp 経由で直接配信する、プロアクティブかつ自動化されたキャンペーンを通じて顧客を引き付けることができます。WhatsApp キャンペーンの設定は、使い慣れた Amazon Connect インターフェイスを使用して行います。SMS、音声、E メールキャンペーンの場合と同様に、ターゲットオーディエンスの定義、パーソナライズされたメッセージテンプレートの選択、配信時間のスケジュール設定、コンプライアンスガードレールの適用を行うことができます。\n  これまで、アウトバウンドキャンペーンは SMS、E メール、音声チャネルをサポートしていましたが、WhatsApp は顧客がエージェントとの会話を開始する際にしか利用できませんでした。アウトバウンドキャンペーンの WhatsApp サポートにより、お客様は、統一されたキャンペーン管理エクスペリエンスを維持しながら、追加のメッセージングプラットフォームを通じてプロアクティブに顧客にリーチできるようになりました。リアルタイムの顧客データに基づいて WhatsApp メッセージをパーソナライズし、配信とエンゲージメントのメトリクスを追跡し、コミュニケーションの頻度とタイミングを管理してコンプライアンスを確保できます。この拡張により、オムニチャネルアウトリーチ戦略を合理化しつつ、任意のプラットフォームでより柔軟に顧客とつながることが可能となります。\n  この機能は、Amazon Connect アウトバウンドキャンペーンがサポートされているすべての AWS リージョンで利用できます。詳細については、Amazon Connect アウトバウンドキャンペーンのドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "e236474a29f9c9962b10e45a970ab680cabe0083",
      "title": "AWS Elastic Beanstalk が Node.js 24 on Amazon Linux 2023 のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/elastic-beanstalk-node-js-24-linux-2023/",
      "pubDate": "2025-12-05T18:00:00.000Z",
      "contentSnippet": "AWS Elastic Beanstalk により、お客様は Amazon Linux 2023 (AL2023) プラットフォームで .Node.js 24 アプリケーションを構築してデプロイできるようになりました。この最新のプラットフォームのサポートにより、開発者は AL2023 の強化されたセキュリティとパフォーマンスを活用しながら、Node.js の最新機能と改善点を活用できます。\n \nAWS Elastic Beanstalk は、アプリケーションを実行するインフラストラクチャを心配することなく、AWS でアプリケーションをデプロイおよび管理できるようにするサービスです。Node.js 24 on AL2023 には V8 JavaScript エンジンのアップデートが含まれており、npm 11 の搭載によるセキュリティとパフォーマンスの向上が行われています。開発者は、Elastic Beanstalk コンソール、CLI、または API を使用して、Node.js 24 on AL2023 を実行する Elastic Beanstalk 環境を作成できます。\n \nこのプラットフォームは、AWS GovCloud (米国) リージョンを含む、Elastic Beanstalk が利用可能なすべての商用 AWS リージョンで利用できます。リージョンおよび提供サービスの一覧については、AWS リージョン表をご覧ください。\n \nNode.js 24 on Amazon Linux 2023 の詳細については、AWS Elastic Beanstalk デベロッパーガイドを参照してください。 その他の情報については、AWS Elastic Beanstalk の製品ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "bbdd87e2ad452184c93ed6e9aa8d438ec570c2cf",
      "title": "Amazon SES が API エンドポイントの VPC サポートを追加",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ses-vpc-api-endpoints/",
      "pubDate": "2025-12-05T18:00:00.000Z",
      "contentSnippet": "本日、Amazon Simple Email Service (SES) が、仮想プライベートクラウド (VPC) エンドポイントを介した SES API エンドポイントへのアクセスに対応するようになりました。お客様は VPC エンドポイントを使用して、SES API にアクセスして E メールを送信し、SES リソース設定を管理できるようになります。このリリースにより、お客様は VPC のセキュリティを強化することができます。\n  これまで、VPC でワークロードを実行するお客様は、VPC でインターネットゲートウェイリソースを設定することで SES API にアクセスできました。これにより、VPC からのトラフィックがインターネットに流れ、SES パブリック API エンドポイントに到達できるようになっていました。今後は、インターネットゲートウェイを必要とせずに VPC エンドポイントを使用して SES API にアクセスできるようになるため、VPC 内のアクティビティがインターネットに公開される可能性が低減されます。\n  SES での SES API エンドポイント向け VPCは、SES を利用できるすべての AWS リージョンでサポートされています。\n  詳細については、Amazon SES での VPC エンドポイントの設定に関するドキュメントを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "4b17110c60c4e2725b3c5d1017abf6ca44b60733",
      "title": "Amazon OpenSearch Service が自動セマンティックエンリッチメントのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/opensearch-service-automatic-semantic-enrichment/",
      "pubDate": "2025-12-05T18:00:00.000Z",
      "contentSnippet": "Amazon OpenSearch Service に、マネージドクラスター向けの自動セマンティックエンリッチメントが導入されました。これは、今年初めに OpenSearch Serverless 向けにリリースされた機能と同等のものです。この機能により、最小限の設定作業でセマンティック検索の機能を活用できます。\n  従来の語彙検索では、完全に一致するフレーズのみが検索され、関連するコンテンツが欠落することがよくありました。自動セマンティックエンリッチメントは文脈や意味を理解し、より関連性の高い結果を提供します。例えば「環境に優しい交通手段」と検索すると、完全に一致する用語が含まれているかを問わず、「電気自動車」や「公共交通機関」に関する結果がヒットします。この新機能はすべてのセマンティック処理を自動的に処理するため、機械学習モデルの管理が不要になります。英語のみと多言語の両方をサポートし、アラビア語、フランス語、ヒンディー語、日本語、韓国語など 15 の言語に対応しています。データ取り込み時の実際の使用量のみが発生し、OpenSearch コンピュートユニット (OCU) - セマンティック検索として課金されます。費用の詳細と料金の例については、料金ページをご覧ください。\n  この機能は、OpenSearch バージョン 2.19 以降を実行している Amazon OpenSearch Service ドメインで利用できるようになりました。現在、この機能は、米国東部 (バージニア北部)、米国東部 (オハイオ)、米国西部 (オレゴン)、アジアパシフィック (ムンバイ)、アジアパシフィック (シンガポール)、アジアパシフィック (シドニー)、アジアパシフィック (東京)、欧州 (フランクフルト)、欧州 (アイルランド)、および欧州 (ストックホルム) の AWS リージョンで非 VPC ドメインをサポートしています。\n  まずは自動セマンティックエンリッチメントに関するドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "2812e5d378e844840c1e09b198ed4c659082b22a",
      "title": "SES Mail Manager が、新たに 10 の AWS リージョンで利用可能に (合計 27 か所)",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ses-mail-manager-10-regions/",
      "pubDate": "2025-12-05T18:00:00.000Z",
      "contentSnippet": "Amazon SES は、SES Mail Manager 製品がさらに 10 か所の商用 AWS リージョンで利用できるようになったことを発表しました。これにより、Mail Manager がリリースされている現在の 17 の商用 AWS リージョンの対象範囲が拡大され、SES が中核となるアウトバウンドサービスを提供しているすべての商用リージョンで Mail Manager が提供されるようになりました。\n  SES Mail Manager を使用すると、お客様は自社のドメイン向けに E メールのルーティングと配信メカニズムを設定でき、すべての E メールワークロードに対する E メールのガバナンス、リスク、およびコンプライアンスソリューションを一元的に確認できます。組織は一般的に、従来のホスト型メールリレーの代替として、またはサードパーティーのメールボックスプロバイダーや E メールセキュリティソリューションとの統合を簡素化する目的で Mail Manager をデプロイします。Mail Manager は、WorkMail メールボックスへの再配信、検索およびエクスポート機能を備えた組み込みアーカイブ、コンソール内でのサードパーティー製セキュリティアドオンとの直接統合もサポートしています。\n  Mail Manager の新たな 10 か所のリージョンには、中東 (バーレーン)、アジアパシフィック (ジャカルタ)、アフリカ (ケープタウン)、中東 (UAE)、アジアパシフィック (ハイデラバード)、アジアパシフィック (マレーシア)、欧州 (ミラノ)、イスラエル (テルアビブ)、カナダ西部 (カルガリー)、欧州 (チューリッヒ) が含まれます。利用可能な Mail Manager リージョンの詳細なリストは、こちらでご覧いただけます。\n  詳細については、Amazon SES Mail Manager の製品ページと SES Mail Manager のドキュメントをご覧ください。Amazon SES コンソールを通じて、これらの新しいリージョンで Mail Manager の使用を開始できます。",
      "siteName": "AWS What's New"
    },
    {
      "id": "304b1cca90799c859d38ef4e327f3bb577f4a244",
      "title": "TwelveLabs の Pegasus 1.2 モデルが、グローバルクロスリージョン推論により新たに 23 の AWS リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/twelvelabs-pegasus-available-with-global-cross-region-inference/",
      "pubDate": "2025-12-05T18:00:00.000Z",
      "contentSnippet": "Amazon Bedrock は、TwelveLabs の Pegasus 1.2 にグローバルクロスリージョン推論を導入し、モデルの提供範囲が拡大され、既に利用可能だった 7 つのリージョンに加えて、23 の新しいリージョンで利用可能になりました。また、地理的クロスリージョン推論を使用して、Amazon Bedrock のすべての EU リージョンでモデルにアクセスできるようになりました。地理的クロスリージョン推論は、特定の地理的境界内にデータレジデンシーまたはコンプライアンス要件があるワークロードに最適です。一方、グローバルクロスリージョン推論は、複数の地域にわたる可用性とパフォーマンスが優先されるアプリケーションに適しています。\n  Pegasus 1.2 は、動画中の映像、音声、テキストのコンテンツに基づいてテキストを生成する、動画に特化した強力な言語モデルです。特に長尺の動画向けに設計されており、動画からテキストへの生成と時間的理解に優れています。今回新たに追加されたリージョンでも Pegasus 1.2 が利用可能になったことで、データやエンドユーザーの近くで動画インテリジェンスアプリケーションを構築できるようになります。これにより、レイテンシーが低減され、アーキテクチャが簡素化されます。\n  Pegasus 1.2 でサポートされている推論プロファイルとリージョンの詳細なリストについては、クロスリージョン推論のドキュメントを参照してください。Pegasus 1.2 の使用を開始するには、Amazon Bedrock コンソールにアクセスしてください。詳細については、製品ページと Amazon Bedrock のドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "6db51ffdd330febe841610bd7c5918887bbf023c",
      "title": "Amazon SageMaker が、ノートブックインスタンスの最新プラットフォームバージョンへのセルフサービス移行のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-sagemaker-self-service-migration-notebook-instances",
      "pubDate": "2025-12-05T18:00:00.000Z",
      "contentSnippet": "Amazon SageMaker ノートブックインスタンスがセルフサービス移行をサポートするようになり、UpdateNotebookInstance API を使用してノートブックインスタンスのプラットフォーム識別子を更新できるようになりました。これにより、サポート対象外のプラットフォーム識別子 (notebook-al1-v1、notebook-al2-v1、notebook-al2-v2) からサポート対象バージョン (notebook-al2-v3、notebook-al2023-v1) にシームレスに移行できます。\n  UpdateNotebookInstance API の新しい  PlatformIdentifier パラメータを使用することで、既存のデータや設定を維持したまま、ノートブックインスタンスプラットフォームを新しいバージョンに更新できます。プラットフォーム識別子により、ノートブックインスタンスが実行されるオペレーティングシステムと JupyterLab バージョンの組み合わせが決定します。このセルフサービス機能により移行プロセスが簡素化され、ノートブックインスタンスを最新の状態に保つことができます。\n  この機能は AWS CLI (バージョン 2.31.27 以降) と SDK でサポートされており、Amazon SageMaker ノートブックインスタンスがサポートされているすべての AWS リージョンで利用できます。詳細については、Amazon SageMaker デベロッパーガイドの「Update a Notebook Instance」を参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "fdf5f6b3fe1b86fc93bafe9e61805c902db0c123",
      "title": "Amazon Connect Customer Profiles で新しいセグメンテーション機能が利用可能に (ベータ)",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-connect-customer-profiles/",
      "pubDate": "2025-12-05T15:04:00.000Z",
      "contentSnippet": "Amazon Connect Customer Profiles で、Spark SQL (ベータ) による新しいセグメンテーション機能を利用できるようになりました。これにより、AI 支援のもと、完全な Customer Profiles データを活用して高度な顧客セグメントを構築できます。\n  利用可能な機能:\n  \n \n \n完全なプロファイルデータへのアクセス: カスタムオブジェクトと標準オブジェクトの両方をセグメンテーションに使用できます。\n \n \nSQL 機能の活用: オブジェクトの結合、パーセンタイルなどの統計機能によるフィルタリング、日付フィールドの標準化による複雑な分析を実施できます。\n \n \nAI 支援によるセグメントの構築: セグメント AI アシスタントで自然言語プロンプトを使用し、Spark SQL でセグメント定義を自動的に生成することも、SQL を直接記述することもできます。\n \n \nデプロイ前の検証: AI が生成した SQL の確認、自然言語による説明の表示、自動セグメント見積もりの取得を行うことができます。\n \n \n例えば、「過去 1 か月間に新規購入についてカスタマーサービスに 3 回以上電話で問い合わせた顧客」や「生涯支出額が上位 90 パーセンタイルの価値の高い顧客」といったセグメントを作成し、アウトバウンドキャンペーンやパーソナライズされたカスタマーエクスペリエンスに向けた正確なターゲティングを実現できます。\n  これらの新しいセグメンテーション機能は、既存のセグメンテーション機能とともに提供されます。いずれもセグメントメンバーシップコール、フローブロック、アウトバウンドキャンペーンとシームレスに連携するため、ユースケースに最適なアプローチを選択できます。\n  開始方法: Customer Profiles のページからデータストアを有効にして、新しいセグメンテーション機能を使用できます。\n  利用可能な国や地域: Amazon Connect Customer Profiles が提供されているすべての AWS リージョンでご利用いただけます。\n  詳細については、Amazon Connect 管理者ガイドの「Build customer segments in Amazon Connect」を参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "f6d2b5918417ffaa3b761a9902443cedd35baece",
      "title": "Amazon Q で SES Eメール送信の分析が可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-q-analyze-ses-email-sending/",
      "pubDate": "2025-12-05T08:00:00.000Z",
      "contentSnippet": "本日、Amazon Q  (Q) が、Amazon Simple Email Service (SES) での E メール送信分析に対応するようになりました。これに伴い、お客様は SES リソースの設定と使用パターンについて Q に質問できるようになりました。Q は、設定の最適化や配信性能に関する問題のトラブルシューティングを支援します。これにより、技術的知識が少なくても SES の運用アクティビティをより簡単に管理できます。\n  これまで、お客様は Virtual Deliverability Manager などの SES 機能を活用して、SES リソースの設定と使用状況を管理および確認していました。お客様は、SES の便利なダッシュボードビューとクエリツールを活用して情報を検索していましたが、サービスを利用するには E メール送信の概念に対する深い理解が必要となっていました。今後は、リソース設定の最適化や配信性能の課題のトラブルシューティングに関する支援を Q に求めることができます。Q は、お客様の使用パターンと SES リソース設定を評価し、お客様が求めている回答を見つけます。さらに、事前の知識や手動による調査なしにコンテキストを理解できるようお客様を支援します。\n  Q による SES リソース分析は、SES と Q が利用可能なすべての AWS リージョンでサポートされています。\n  詳細については、Q のドキュメントで、Q を通じた SES の操作に関する情報をご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "651a0bfdc4a000dc4a002d84ca85e8520fea0995",
      "title": "AWS Elastic Beanstalk が Python 3.14 on Amazon Linux 2023 のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/elastic-beanstalk-python-314-linux-2023/",
      "pubDate": "2025-12-05T08:00:00.000Z",
      "contentSnippet": "AWS Elastic Beanstalk により、お客様は Amazon Linux 2023 (AL2023) プラットフォームで Python 3.14 アプリケーションを構築してデプロイできるようになりました。この最新のプラットフォームのサポートにより、開発者は AL2023 の強化されたセキュリティとパフォーマンスを活用しながら、Python の最新機能と改善点を活用できます。\n \nAWS Elastic Beanstalk は、アプリケーションを実行するインフラストラクチャを心配することなく、AWS でアプリケーションをデプロイおよび管理できるようにするサービスです。AL2023 上の Python 3.14 では、インタラクティブインタープリタ機能が強化され、エラーメッセージが改善され、セキュリティと API の重要な改善が行われています。開発者は、Elastic Beanstalk コンソール、CLI、または API を使用して、AL2023 上の Python 3.14 を実行する Elastic Beanstalk 環境を作成できます。\n \nこのプラットフォームは、AWS GovCloud (米国) リージョンを含む、Elastic Beanstalk が利用可能なすべての商用 AWS リージョンで利用できます。リージョンおよび提供サービスの一覧については、AWS リージョン表をご覧ください。\n \nAmazon Linux 2023 での Python 3.14 の詳細については、AWS Elastic Beanstalk デベロッパーガイドを参照してください。 その他の情報については、AWS Elastic Beanstalk の製品ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "ca845f0dcd7f1a979abfadcffb771b18302bdae1",
      "title": "AWS が Amazon CloudWatch における AWS CloudTrail イベントの簡素化されたイネーブルメントをリリース",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/key-enhancements-cloudtrail-events-cloudwatch/",
      "pubDate": "2025-12-05T08:00:00.000Z",
      "contentSnippet": "本日、AWS は Amazon CloudWatch における AWS CloudTrail イベントの簡素化されたイネーブルメントをリリースしました。Amazon CloudWatch は、AWS リソースおよびアプリケーションからのログデータを収集、監視、分析するのに役立つモニタリングおよびロギングサービスです。今回のリリースにより、Amazon VPC フローログや Amazon EKS コントロールプレーンログなどの他の一般的な AWS ログソースとともに、CloudWatch の CloudTrail イベントの収集を一元的に設定できるようになりました。CloudWatch の取り込みエクスペリエンスでは、統合ビューを通じて AWS Organization 内のアカウントの各種ソースからのテレメトリ収集が簡素化されます。これにより、AWS 環境全体の包括的なモニタリングおよびデータ収集が可能になります。\n  この新たな統合では、サービスリンクチャネル  (SLC) を活用して、証跡を必要とせずに CloudTrail からイベントを受信できます。さらに、安全性チェックや終了保護などのメリットも得られます。カスタムログの料金に基づいて、CloudTrail イベント配信料金と CloudWatch ログの取り込み料金の両方が発生します。\n  CloudWatch における CloudTrail イベントのイネーブルメントとサポートされている AWS リージョンについて詳しくは、Amazon CloudWatch のドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "3c2914d1a6810db8ba1a53db464326c961986132",
      "title": "AWS Directory Service for Microsoft AD と AD Connector がアジアパシフィック (ニュージーランド) リージョンで利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-directory-service-microsoft-ad-ad-connector-new-zealand-region/",
      "pubDate": "2025-12-05T05:00:00.000Z",
      "contentSnippet": "AWS Directory Service for Microsoft Active Directory (AWS Managed Microsoft AD とも呼ばれる) と AD Connector がアジアパシフィック (ニュージーランド) リージョンで利用できるようになりました。\n \n\n AWS Managed Microsoft AD は、実際の Microsoft Active Directory (AD) 上に構築されているため、AD 対応のアプリケーションを移行できるだけでなく、AWS クラウド上で AD インフラストラクチャの管理作業を軽減することもできます。Microsoft AD の認証情報を使用して EC2 インスタンスをドメインに追加したり、コンテナと Kubernetes クラスターを管理したりすることもできます。既存の Microsoft AD でアイデンティティを保持したり、AWS マネージドディレクトリでアイデンティティを作成/管理したりできます。\n  AD Connector は AWS アプリケーションで既存のオンプレミス AD アイデンティティを使用できるようにするプロキシです。AWS クラウド上の AD インフラストラクチャは必要ありません。また、AD Connector を使用すると、オンプレミス AD ドメインに Amazon EC2 インスタンスを結合し、既存のグループポリシーオブジェクトを使用してインスタンスを管理できます。\n  AWS Managed Microsoft AD と AD Connector が利用可能なすべての AWS リージョンをご覧ください。詳細については、AWS Directory Service をご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "c92b155d1a8e581bebba2b5b14b511ffc70ccbdd",
      "title": "Amazon Bedrock が OpenAI の Responses API をサポートするようになりました",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-bedrock-responses-api-from-openai/",
      "pubDate": "2025-12-04T12:00:00.000Z",
      "contentSnippet": "Amazon Bedrock は、新しい OpenAI API 互換サービスエンドポイントで Responses API をサポートするようになりました。Responses API を使用すると、デベロッパーは長時間実行される推論ワークロードの非同期推論を実現でき、エージェンティックワークフローのツール使用統合が簡素化され、ステートフルな会話管理もサポートされます。Responses API を使用すると、デベロッパーは各リクエストで会話履歴全体を渡さなければならない代わりに、手動で履歴を管理しなくてもコンテキストを自動的に再構築できます。これらの新しいサービスエンドポイントは、ストリーミングモードと非ストリーミングモードの両方をサポートし、Chat Completions API 内での推論サポートを可能にします。また、デベロッパーはベース URL を変更するだけで OpenAI SDK 互換の既存のコードベースに統合できます。\n  \n 推論サポートが付いたチャット補完機能は、Project Mantle (Amazon Bedrock で提供される大規模機械学習モデル用の新しい分散推論エンジン) を搭載したすべての Amazon Bedrock モデルで利用できます。Project Mantle は、Amazon Bedrock への新しいモデルのオンボーディングを簡素化および迅速化し、高度なサービス品質管理による高性能で信頼性の高いサーバーレス推論を提供し、自動容量管理と統合プールによってデフォルトのカスタマークォータを増やし、OpenAI API 仕様とのすぐに使用できる互換性を提供します。Responses API のサポートは、OpenAI のGPT OSS 20B/120B モデルから今すぐ利用可能で、他のモデルも間もなくサポートされる予定です。\n 使用を開始するには、こちらのサービスドキュメントをご覧ください",
      "siteName": "AWS What's New"
    },
    {
      "id": "1bf213e270559f1bb9f1a9b4453447151d57b47c",
      "title": "AWS Graviton5 プロセッサを搭載した新しい Amazon EC2 M9g インスタンスを発表 (プレビュー)",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/ec2-m9g-instances-graviton5-processors-preview/",
      "pubDate": "2025-12-04T09:00:00.000Z",
      "contentSnippet": "本日より、AWS Graviton5 プロセッサを搭載した新しい汎用 Amazon Elastic Compute Cloud (Amazon EC2) M9g インスタンスがプレビュー版で利用できるようになりました。AWS Graviton5 は、AWS によってカスタム設計された Graviton ファミリーのプロセッサの最新製品で、Amazon EC2 のワークロードで最高の価格性能比を実現します。これらのインスタンスは、AWS Graviton4 ベースの M8g インスタンスよりも最大 25% 優れたコンピューティングパフォーマンスと、より高いネットワーキングと Amazon Elastic Block Store (Amazon EBS) の帯域幅を提供します。M8g と比較して、データベースでは最大 30%、ウェブアプリケーションでは最大 35%、機械学習ワークロードでは最大 35% 高速です。\n  M9g インスタンスは、AWS が設計したハードウェアとソフトウェアのイノベーションを組み合わせた AWS Nitro System 上に構築されています。AWS Nitro System は、分離されたマルチテナンシー、プライベートネットワーキング、高速ローカルストレージを備えた効率的で柔軟かつ安全なクラウドサービスの提供を可能にします。Amazon EC2 M9g インスタンスは、アプリケーションサーバー、マイクロサービス、ゲームサーバー、中規模データストア、キャッシュフリートなどのワークロードに最適です。\n  詳細について、または M9g プレビューへのアクセスをリクエストするには、Amazon EC2 M9g インスタンスを参照してください。Graviton の利用を開始するには、「Level up your compute with AWS Graviton」ページにアクセスしてください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "345f08595809708ea4ebac6bd80b8e09c2c508d0",
      "title": "Amazon SageMaker HyperPod でチェックポイントレストレーニングのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-sagemaker-hyperpod-checkpointless-training",
      "pubDate": "2025-12-03T15:00:00.000Z",
      "contentSnippet": "Amazon SageMaker HyperPod で、チェックポイントレストレーニングのサポートを開始しました。この新しい基盤モデルのトレーニング機能を使用すると、障害復旧のためにチェックポイントベースのジョブレベルの再起動を行う必要性を軽減できます。チェックポイントレストレーニングでは、障害が発生してもトレーニングの進行を維持するため、復旧にかかる時間が数時間から数分に短縮されます。これは、従来のチェックポイントベースの復旧からの根本的な転換となります。従来の方法では、障害発生時にトレーニングクラスター全体を一時停止し、問題を手動で診断し、保存されたチェックポイントから復旧を行う必要がありました。このプロセスでは、コストのかかる AI アクセラレータが何時間もアイドル状態になり、無駄なコンピューティングコストが発生する可能性があります。\n \nチェックポイントレストレーニングでは、この従来の方法から脱却し、モデルトレーニングの状態を分散クラスター全体で維持し、障害のあるトレーニングノードをその場で自動的に交換して、正常なアクセラレータから状態をピアツーピアで転送して障害復旧を行います。 復旧時のチェックポイントへの依存が軽減されるため、組織はアイドル状態の AI アクセラレータのコストを節約し、トレーニングにかかる時間を短縮できます。大規模なトレーニングであっても、Amazon SageMaker HyperPod のチェックポイントレストレーニングにより、数千の AI アクセラレータを持つクラスター規模で 95% 以上のトレーニンググッドプットを実現できます。\n \nSageMaker HyperPod のチェックポイントレストレーニングは、Amazon SageMaker HyperPod が利用可能なすべての AWS リージョンでご利用いただけます。 Llama や GPT OSS などの一般的な公開モデルで HyperPod レシピを使用すると、コード変更なしでチェックポイントレストレーニングを実行できます。カスタムモデルアーキテクチャの場合、PyTorch ベースのワークフローに最小限の変更を加えるだけで、チェックポイントレストレーニングのコンポーネントを統合できます。そのため、分散型トレーニングの専門知識がないチームでも使用できます。\n \n使用を開始するには、Amazon SageMaker HyperPod の製品ページにアクセスしてください。実装ガイダンスについては、チェックポイントレストレーニングの GitHub ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "736e2e303e55b235a1ad2907d672fe0b436715a2",
      "title": "Strands Agents での TypeScript サポート (プレビュー) などを発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/typescript-strands-agents-preview",
      "pubDate": "2025-12-03T14:00:00.000Z",
      "contentSnippet": "AWS は 5 月に、Strands Agents SDK をオープンソース化しました。Strands Agents SDK は、わずか数行のコードで AI エージェントを構築および実行するモデルドリブンアプローチを採用したオープンソース Python フレームワークです。本日、TypeScript サポートがプレビューで利用可能になったことを発表いたします。これにより、開発者は Strands Agents を構築する際に Python と TypeScript のどちらかを選択できるようになりました。\n  Strands での TypeScript サポートは、完全な型安全性、async/await のサポート、最新の JavaScript/TypeScript パターンを備えた、慣用的な TypeScript エクスペリエンスを実現するように設計されています。Strands は、クライアントアプリケーション、ブラウザ、AWS Lambda や Bedrock AgentCore などのランタイムのサーバーサイドアプリケーションで簡単に実行できます。開発者は、AWS CDK を使用して Typescript でスタック全体を構築することもできます。\n  さらに、Strands SDK の 3 つの追加アップデートも発表いたします。まず、Strands Agents のエッジデバイスサポートの一般提供が開始されました。この SDK の拡張では、双方向ストリーミングが導入されたほか、llama.cpp などのローカルモデルプロバイダーが追加されたため、ローカルモデルを使用して小規模デバイスでエージェントを実行できるようになりました。次に、Strands Steering が試験的な機能として利用可能になりました。これにより、開発者はモジュール式のプロンプトメカニズムを利用して、ライフサイクルの適切なタイミングでエージェントにフィードバックを提供し、厳格なワークフローなしでエージェントを望ましい結果へと導くことができます。最後に、Strands Evaluations がプレビュー版で利用可能になりました。Evaluations を使用すると、開発者はエージェントの行動を体系的に検証し、改善点を測定して、開発サイクル中に自信を持ってデプロイを行うことができます。\n  Strands Agents の GitHub  にアクセスして、構築を始めましょう。",
      "siteName": "AWS What's New"
    },
    {
      "id": "2379419c497922710cfe1119f61f4f358397f6e1",
      "title": "Amazon SageMaker AI の新しいサーバーレスモデルカスタマイズ機能",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/new-serverless-model-customization-capability-amazon-sagemaker-ai",
      "pubDate": "2025-12-03T14:00:00.000Z",
      "contentSnippet": "Amazon Web Services (AWS) は、新しいサーバーレスモデルカスタマイズ機能を発表しました。この機能により、AI 開発者は教師ありファインチューニングや強化学習などの最新技術を使用して、一般的なモデルを迅速にカスタマイズできるようになりますす。 Amazon SageMaker AI は、あらゆるユースケースにおいて、高性能で低コストの AI モデル開発を実現する幅広いツールを統合したフルマネージドサービスです。 \n \n多くの AI 開発者は、所有データを使ってモデルをカスタマイズし、その精度を高めたいと考えていますが、この作業には長いイテレーションサイクルが必要になることがよくあります。例えば、ユースケースを定義してデータを準備し、モデルとカスタマイズ手法を選択し、モデルをトレーニングしてから、デプロイするモデルを評価する必要があります。 今回のリリースにより、AI 開発者は、データの準備から評価、デプロイまでのエンドツーエンドのモデルカスタマイズワークフローを簡素化し、プロセスを加速できるようになりました。使いやすいインターフェイスにより、Amazon Nova、Llama、Qwen、DeepSeek、GPT-OSS などの一般的なモデルをすぐに使い始めることができ、独自のデータを使用してカスタマイズできます。カスタマイズには、教師ありファインチューニングや最新の技術 (強化学習や直接選好最適化など) を使用できます。さらに、AI 開発者は、AI エージェントガイド付きワークフロー (プレビュー中) や自然言語を使用して、完全にサーバーレスで合成データの生成、データ品質の分析、モデルのトレーニングと評価を行うことができます。 \n \nこの使いやすいインターフェイスは、欧州 (アイルランド)、米国東部 (バージニア北部)、アジアパシフィック (東京)、米国西部 (オレゴン) の AWS リージョンでご利用いただけます。 AI エージェントガイド付きワークフローへのアクセスを申請するには、サインアップページをご覧ください。 \n \n詳細については、SageMaker AI のモデルカスタマイズに関するページとブログを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "9c31bc9aca62069c3aee0f5ccbd4420d033193b9",
      "title": " Amazon SageMaker HyperPod のエラスティックトレーニングのご紹介",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/elastic-training-amazon-sagemaker-hyperpod/",
      "pubDate": "2025-12-03T08:00:00.000Z",
      "contentSnippet": "Amazon SageMaker HyperPod で、エラスティックトレーニングのサポートを開始しました。このトレーニングでは、リソースの可用性とワークロードの優先順位に基づいてトレーニングワークロードが自動的にスケールされるため、基盤モデルのトレーニングにかかる時間を短縮できます。これにより、固定されたリソースセットを使用するトレーニングから根本的に転換し、コンピューティングの可用性に基づくトレーニングジョブの再設定に費やしていたエンジニアリング時間を節約できます。\n \nこれまでは、コンピューティングの可用性に変化が生じた場合、手動でトレーニングを停止し、トレーニングパラメータを再設定して、ジョブを再開する必要がありました。このプロセスでは、分散型トレーニングの専門知識が必要となるほか、トレーニングジョブの再設定時にコストの高い AI アクセラレータがアイドル状態のままになります。エラスティックトレーニングでは、トレーニングジョブを自動的に拡張してアイドル状態の AI アクセラレータを吸収し、優先度の高いワークロードにリソースが必要な場合は、シームレスにトレーニングを縮小します。これらはすべて、トレーニングを完全に停止することなく行われます。\n \n手動による再設定のオーバーヘッドがなくなり、利用可能なコンピューティングを継続的に活用できるようになるため、これまでインフラストラクチャ管理に費やしていた時間を節約できます。また、クラスターの使用率を最大限に高めてコストを削減し、市場投入までの時間を短縮できます。最小限のリソースでトレーニングをすぐに開始して、キャパシティが使用可能になったら必要に応じてトレーニングを拡張できます。\n \nSageMaker HyperPod のエラスティックトレーニングは、Amazon SageMaker HyperPod が利用可能なすべてのリージョンでご利用いただけます。Llama や GPT OSS などの公開モデルで HyperPod レシピを使用すると、コード変更なしでエラスティックトレーニングを実行できます。カスタムモデルアーキテクチャの場合、設定をわずかに更新し、最小限のコード変更を行うだけでエラスティックトレーニング機能を統合できるため、分散型システムの専門知識がないチームでも使用できます。\n \n使用を開始するには、Amazon SageMaker HyperPod の製品ページにアクセスしてください。実装ガイダンスについては、エラスティックトレーニングのドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "2704df6a7fca40dc868cee89aa75a7578a97ced5",
      "title": "Amazon Bedrock で強化学習によるファインチューニングのサポートを開始: ベースモデルと比較して平均で 66% の精度向上を実現可能",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/bedrock-reinforcement-fine-tuning-66-base-models/",
      "pubDate": "2025-12-03T08:00:00.000Z",
      "contentSnippet": "Amazon Bedrock で、強化学習によるファインチューニングのサポートを開始しました。これにより、機械学習に関する深い専門知識や大量のラベル付きデータがなくても、モデルの精度を向上させることが可能になりました。強化学習によるファインチューニングのワークフローは Amazon Bedrock によって自動化されるため、開発者は日常的にこの高度なモデルカスタマイズ手法を利用できます。従来のファインチューニング手法では大量のデータが必要でしたが、モデルは大量のデータではなく少数のプロンプトを使用して、ユーザーの特定の要件を満たすよう学習します。そのため、チームはすぐにファインチューニングを開始できます。この機能は、同じプロンプトに対する複数の応答候補に関するフィードバックによってモデルに学習させ、どのような応答が適切かをモデルがより適切に判断できるようにします。Amazon Bedrock の強化学習によるファインチューニングでは、基本モデルと比較して平均で 66% の精度向上を実現できます。そのため、高品質を維持しながら、より小規模で高速な、費用対効果の高いモデルバリアントを使用できます。\n \n組織は、AI モデルを独自のビジネスニーズに適応させるのに苦労しており、平均的なパフォーマンスを備えた汎用モデルか、専門的な人材、インフラストラクチャ、リスクの高いデータ移動が必要な高価で複雑なカスタマイズのどちらかを選択せざるを得ません。Amazon Bedrock の強化学習によるファインチューニングを使用すると、高度なモデルのカスタマイズを自動化して迅速かつ安全に実行できるため、この複雑さが解消されます。モデルをトレーニングするには、コンピュータからトレーニングデータを直接アップロードするか、Amazon S3 に既に保存されているデータセットから選択します。ラベル付けされたデータセットは不要です。報酬関数の定義には、検証可能なルールベースの採点器または AI ベースのジャッジを使用できます。また、組み込みのテンプレートを使用すれば、コード生成や数学推論などの客観的タスクと、指示の実行やチャットボットとの対話といった主観的タスクの両方に対応するようにモデルを最適化できます。お客様の所有データはカスタマイズプロセス全体を通して安全で管理された AWS 環境内に留まるため、セキュリティとコンプライアンスの懸念を軽減できます。\n \nAmazon Bedrock の強化学習によるファインチューニングは、Amazon Bedrock コンソールおよび Amazon Bedrock API を使用して開始できます。リリース時点では、Amazon Nova 2 Lite で強化学習によるファインチューニングをご利用いただけます。その他のモデルも今後サポートされる予定です。Amazon Bedrock の強化学習によるファインチューニングの詳細については、リリースブログ、料金ページ、ドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "50be67446002d2314427fa744e4d52d2c8130363",
      "title": "Amazon EC2 汎用 M8azn インスタンスの発表 (プレビュー)",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-amazon-ec2-m8azn-preview",
      "pubDate": "2025-12-02T16:00:00.000Z",
      "contentSnippet": "本日より、新しい汎用高頻度ハイネットワークの Amazon Elastic Compute Cloud (Amazon EC2) M8azn インスタンスがプレビューできるようになりました。これらのインスタンスは、第 5 世代 AMD EPYC (旧コード名 Turin) プロセッサを搭載し、クラウドで最も高い CPU 周波数である 5 GHz を提供します。M8azn インスタンスは、前世代の M5zn インスタンスと比較して最大 2 倍のコンピューティングパフォーマンスを提供します。また、これらのインスタンスは M8a インスタンスよりも 24% 高いパフォーマンスを発揮します。\n  M8azn インスタンスは、AWS が設計したハードウェアとソフトウェアのイノベーションを組み合わせた AWS Nitro System 上に構築されています。AWS Nitro System は、分離されたマルチテナンシー、プライベートネットワーキング、高速ローカルストレージを備えた効率的で柔軟かつ安全なクラウドサービスの提供を可能にします。これらのインスタンスは、自動車、航空宇宙、エネルギー、電気通信業界向けのゲーム、高性能コンピューティング、高頻度取引 (HFT)、CI/CD、シミュレーションモデリングなどのアプリケーションに最適です。\n  詳細について、または M8azn インスタンスプレビューへのアクセスをリクエストするには、Amazon EC2 M8a ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "6554a4397c5dd956444d931259ae605faee95f80",
      "title": "Amazon EMR 用の Apache Spark アップグレードエージェントの発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/apache-spark-upgrade-agent-amazon-emr",
      "pubDate": "2025-12-02T15:00:00.000Z",
      "contentSnippet": "AWS は、EC2 上の Amazon EMR と EMR Serverless 向けに Apache Spark バージョンアップグレードを高速化する新機能である Apache Spark アップグレードエージェントを発表しました。エージェントは、コード分析と変換を自動化することで、通常は数か月かかる複雑なアップグレードプロセスを、数週間にわたるプロジェクトに変換します。組織は、Spark のアップグレード中に、API の変更の分析、競合の解決、アプリケーションの検証に多大なエンジニアリングリソースを費やしています。エージェントには、エンジニアがコード変更を完全に制御しながら、アップグレード要件を自然言語で表現できる会話型インターフェイスが導入されています。\n  Apache Spark アップグレードエージェントは、PySpark アプリケーションと Scala アプリケーションの全体で API と動作の変更を自動的に識別します。エンジニアは、MCP (モデルコンテキストプロトコル) の互換性を利用して、SageMaker Unified Studio、Kiro CLI、または選択した IDE から直接、アップグレードを開始することができます。エージェントはアップグレードプロセス中に既存のコードを分析して具体的な変更を提案するので、エンジニアは実装前に変更をレビューして承認できます。エージェントは、データ品質検証を通じて機能正確性を検証します。エージェントは現在、Spark 2.4 から 3.5 へのアップグレードをサポートしており、アップグレードプロセスの全体を通じてデータ処理の正確性を維持します。\n  Apache Spark アップグレードエージェントは、SageMaker Unified Studio が利用可能なすべての AWS リージョンで利用できるようになりました。エージェントの使用を開始するには、SageMaker Unified Studio にアクセスして IDE スペースを選択するか、Kiro CLI をインストールしてください。詳細な実装ガイダンス、リファレンスドキュメント、移行例については、ドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "f17fc1f9ec3bfab97a6e4b4c9f10cd2fa70cd1b4",
      "title": "リアルタイムな会話型 AI を実現する Amazon Nova 2 Sonic を発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-nova-2-sonic-real-time-conversational-ai/",
      "pubDate": "2025-12-02T15:00:00.000Z",
      "contentSnippet": "Amazon は本日、自然でリアルタイムな会話型 AI を実現する音声合成モデルである Amazon Nova 2 Sonic の提供を発表しました。  このモデルは、クラス最高のストリーミング音声理解と、バックグラウンドノイズおよびユーザーの話し方に対する堅牢性を備え、会話の効率的な処理、複数の言語をネイティブに話すことができる表現力豊かな音声 (多言語音声) による音声生成が可能です。また、推論、指示の実行、ツール呼び出しの精度が以前のモデルよりも向上しています。\n \nNova 2 Sonic には、オリジナルの Nova Sonic モデルで導入された機能をベースに、言語サポートの拡大 (ポルトガル語とヒンディー語を追加)、モデルが異なる言語を同じ音声でネイティブの表現力で話すことができる多言語音声、開発者がポーズ感度を低、中、高に設定できるターンテイキング制御などの新機能が導入されています。このモデルには、クロスモーダルインタラクション機能も追加されているため、ユーザーは同じセッション内で音声とテキストをシームレスに切り替えることができます。また、非同期のツール呼び出しにより、会話の流れを中断することなく複数ステップのタスクをサポートできるほか、100 万トークンのコンテキストウィンドウによって持続的なインタラクションが可能です。\n \n開発者は、Amazon Bedrock の双方向ストリーミング API を使用して、Nova Sonic 2 をリアルタイム音声システムに直接統合できます。Nova Sonic 2 は、Amazon Connect やその他の主要なテレフォニープロバイダー (Vonage、Twilio、AudioCodes など)、オープンソースフレームワーク (LiveKit や Pipecat など) ともシームレスに統合できます。\n \nAmazon Nova 2 Sonic は、米国東部 (バージニア北部)、米国西部 (オレゴン)、アジアパシフィック (東京) の AWS リージョンで、Amazon Bedrock を通じてご利用いただけます。詳細については、AWS ニュースブログと Amazon Nova Sonic ユーザーガイドをご覧ください。Amazon Bedrock で Nova Sonic 2 の使用を開始するには、Amazon Bedrock コンソールにアクセスしてください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "f85d527c4bf12dcbe1a548b2d1db9343c7cd9915",
      "title": "新しいメモリ最適化 Amazon EC2 X8aedz インスタンスの発表 ",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/memory-optimized-amazon-ec2-x8aedz-instances/",
      "pubDate": "2025-12-02T14:00:00.000Z",
      "contentSnippet": "AWS は、第 5 世代 AMD EPYC プロセッサ (旧コード名 Turin) を搭載した次世代のメモリ最適化インスタンスである Amazon EC2 X8aedz を発表しました。これらのインスタンスの最高 CPU 周波数は、クラウド上で最大の 5 GHz です。前世代の X2iezn インスタンスと比較して、最大 2 倍高いコンピューティングパフォーマンスを実現します。\n  X8aedz インスタンスは、最新の第 6 世代 AWS Nitro Cards を使用して構築されており、高いシングルスレッドパフォーマンスと大きなメモリ容量が必要な、物理レイアウトや物理検証ジョブなどの Electronic Design Automation (EDA) ワークロードやリレーショナルデータベースに最適です。5 GHz プロセッサとローカル NVMe ストレージの組み合わせにより、フロアプランニング、ロジック配置、クロックツリー合成 (CTS)、ルーティング、電力/信号インテグリティ解析など、メモリを大量に消費するバックエンド EDA ワークロードの処理を高速化できます。\n  X8aedz インスタンスは、メモリと vCPU の比率が 32:1 で、2～96 個の vCPU、64～3,072 GiB のメモリ構成を持つ 8 種類が用意され、2 つのベアメタル構成を含み、最大 8 TB のローカル NVMe SSD ストレージを利用できます。\n  X8aedz インスタンスは、米国西部 (オレゴン) およびアジアパシフィック (東京) リージョンで利用できるようになりました。X8aedz インスタンスは、Savings Plans、オンデマンドインスタンス、スポットインスタンスでご購入できます。使用を開始するには、AWS マネジメントコンソールにサインインしてください。詳細については、Amazon EC2 X8aedz インスタンスページまたは AWS ニュースブログをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "5b199f92449179a669e41bd187187faed8f76831",
      "title": "Amazon FSx for NetApp ONTAP が Amazon S3 アクセスのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-fsx-netapp-ontap-s3-access",
      "pubDate": "2025-12-02T14:00:00.000Z",
      "contentSnippet": "Amazon S3 Access Points を Amazon FSx for NetApp ONTAP ファイルシステムにアタッチして、ファイルデータを、S3 内に保存されているかのように扱えるようになりました。この新機能により、FSx for NetApp ONTAP 内のファイルデータは、そのまま FSx for NetApp ONTAP に置かれながらも、S3 に対応した幅広い人工知能、機械学習、分析サービスおよびアプリケーションで容易に利用できるようになります。\n  Amazon FSx for NetApp ONTAP は、クラウドで利用できる最初で唯一のフルマネージド NetApp ONTAP ファイルシステムです。これにより、NetApp ONTAP やその他の NAS アプライアンスに依存するオンプレミスアプリケーションを、データの管理方法を変更することなく AWS に移行できます。S3 アクセスポイントは、さまざまなアプリケーションやユーザーがデータにアクセスする方法を制御および簡素化するのに役立つエンドポイントです。今回の FSx for NetApp ONTAP 向け S3 Access Points により、AWS に移行したデータを使って新たなインサイトを得たり、より迅速にイノベーションを進めたり、さらに高度なデータ主導の意思決定を行えるようになります。例えば、データを使用して、Amazon Bedrock で生成 AI アプリケーションを強化したり、Amazon SageMaker で機械学習モデルをトレーニングしたり、Amazon Glue やさまざまな AWS のデータおよび分析のコンピテンシーパートナーソリューションを使用して分析を実行したり、S3 ベースのクラウドネイティブアプリケーションを使用してワークフローを実行したりできます。\n  この機能を利用するには、Amazon FSx コンソール、AWS コマンドラインインターフェイス (AWS CLI)、AWS ソフトウェア開発キット (AWS SDK) のいずれかを使用して S3 アクセスポイントを作成し、これを NetApp ONTAP ファイルシステム用の新しい FSx にアタッチします。既存の FSx for NetApp ONTAP ファイルシステムに対するサポートは、今度の週次メンテナンス期間中に提供される予定です。この新機能は、一部の AWS リージョンで利用できます。\n  使用を開始するには、以下のリソースのリストをご覧ください。\n  \n \n \nAmazon FSx for NetApp ONTAP\n \n \nAmazon S3 Access Points\n \n \nAWS ニュースブログ",
      "siteName": "AWS What's New"
    },
    {
      "id": "5458bd459c631a0bb11e2513f819332e20ad4db1",
      "title": "Amazon EC2 メモリ最適化 X8i インスタンス (プレビュー) の発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-x8i-instances-preview",
      "pubDate": "2025-12-02T14:00:00.000Z",
      "contentSnippet": "Amazon Web Services は、次世代のメモリ最適化インスタンスである Amazon EC2 X8i のプレビューを発表しました。X8i インスタンスは、カスタム Intel Xeon 6 プロセッサを搭載しており、クラウドにおける同等の Intel プロセッサの中で最高のパフォーマンスと最速のメモリを提供します。X8i インスタンスは、前世代の X2i インスタンスと比較して 1.5 倍のメモリ容量 (最大 6TB) と最大 3.4 倍のメモリ帯域幅を提供します。\n  X8i インスタンスは SAP 認定を受けており、ミッションクリティカルな SAP ワークロード向けに、X2i インスタンスと比較して 46% 高い SAPS を提供します。X8i インスタンスは、インメモリデータベースや分析、大規模な従来型データベース、Electronic Design Automation (EDA) など、メモリ集約型ワークロードに最適です。X2i インスタンスと比較した場合、X8i インスタンスのパフォーマンスは 35% 向上し、一部のワークロードではより高いパフォーマンスが実現します。\n  X8i インスタンスのプレビューの詳細やアクセス権のリクエストについては、Amazon EC2 X8i ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "cff14ac532f0894433377e6633adeb67d4f75d5f",
      "title": "Amazon S3 ストレージレンズにパフォーマンスメトリクス、数十億のプレフィックスのサポート、S3 Tables へのエクスポート機能が追加",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-s3-storage-lens-performance-metrics-prefixes-export-tables",
      "pubDate": "2025-12-02T14:00:00.000Z",
      "contentSnippet": "Amazon S3 ストレージレンズでは、ストレージの使用状況とアクティビティを組織全体で可視化でき、コストの最適化、パフォーマンスの向上、データ保護の強化に役立ちます。本日、S3 ストレージレンズに 3 つの新機能を追加します。これにより、S3 ストレージ使用状況とアプリケーションパフォーマンスに関するより深いインサイトが得られます。新機能は、アプリケーションが S3 データとどのように相互作用しているかを把握するパフォーマンスメトリクス、バケット内の数十億のプレフィックスに対する分析、S3 Tables へのメトリクスの直接エクスポートによる簡易なクエリと分析です。\n  3 つの特定のタイプのパフォーマンスメトリクスが追加されました。アクセスパターンメトリクスは、過度に小さく不要なネットワークオーバーヘッドを引き起こすリクエストなど、非効率的なリクエストを識別します。クロスリージョンリクエスト数などのリクエストオリジンメトリクスは、アプリケーションがリージョン間でデータにアクセスしている状況を示し、レイテンシーとコストへの影響を把握します。オブジェクトアクセス数メトリクスは、アプリケーションが少数の特定オブジェクトを頻繁に読み取っている状況を明らかにし、キャッシュや高性能ストレージへの移行によって最適化できる可能性を示します。\n  S3 ストレージレンズのプレフィックス分析を拡張して、バケットごとに数十億のプレフィックスを分析できるようにします。これまで、メトリクスは、サイズと深さの最小しきい値を満たす最大プレフィックスのみが対象でした。これにより、すべてのプレフィックスにわたるストレージの使用状況とアクティビティを可視化できます。最後に、メトリクスをマネージド S3 Tables に直接エクスポートできるようにしました。これにより、Amazon QuickSight などの AWS 分析サービスですぐにクエリを実行できるようになり、このデータを他の AWS サービスデータと組み合わせてより深いインサイトを得ることができるようになります。\n  使用を開始するには、S3 ストレージレンズの高度なメトリクスのダッシュボード設定でパフォーマンスメトリクスまたは拡張プレフィックスを有効にします。これらの機能は、AWS 中国リージョンと AWS GovCloud (米国) リージョンを除くすべての AWS リージョンで利用できます。S3 Tables が利用可能な AWS リージョンの無料および高度なダッシュボード設定の両方で、マネージド S3 Tables へのメトリクスのエクスポートを有効にできます。詳細については、S3 ストレージレンズの概要ページ、ドキュメント、S3 料金ページ、AWS ニュースブログをお読みください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "2b94a5dd5027c268e1812c5421dda67ff036cda5",
      "title": "Amazon RDS for SQL Server で新世代のインスタンスに対応した CPU 最適化機能の提供を開始し、料金の最大 55% 引き下げを実現",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-rds-sql-server-optimized-cpu-lower-prices",
      "pubDate": "2025-12-02T14:00:00.000Z",
      "contentSnippet": "Amazon RDS for SQL Server で、M7i および R7i インスタンスファミリーに対応した CPU 最適化機能の提供を開始しました。これにより、同等の前世代のインスタンスと比較して価格が最大 55% 引き下げられます。CPU 最適化機能により、Simultaneous Multi-threading (SMT) の設定が最適化され、商用ソフトウェアの料金が引き下げられます。お客様は、同等の第 6 世代インスタンスから M7i および R7i インスタンスにアップグレードすることでコストを削減できます。さらに、メモリや I/O の負荷が高いデータベースワークロードでは、CPU 最適化の設定を微調整することで、さらにコストを削減できます。\n  データベースインスタンスの消費時間に対する RDS for SQL Server の料金には、Microsoft Windows と Microsoft SQL Server のソフトウェア料金が含まれています。CPU 最適化機能により、物理 CPU コアが 2 つ以上あるインスタンスの SMT は無効になります。これにより、vCPU 数が削減され、それに対応する商用ソフトウェアの料金を 50% 削減できます。なお、物理 CPU コア数は変わらず、ほぼ同等のパフォーマンスを得ることができます。最も大きな節約効果は、2Xlarge 以上のインスタンス、およびマルチ AZ 配置を使用するインスタンスで得られます。この場合、RDS は、ほとんどの使用において 1 つのアクティブノードのみで SQL Server ソフトウェアの料金を削減するように最適化されています。メモリや I/O の負荷が高いワークロードの場合、お客様はアクティブな物理 CPU コア数を微調整することで、さらなる節約が可能です。\n  RDS for SQL Server は、すべての AWS リージョンで M7i および R7i インスタンスをサポートしています。バンドルされていないインスタンス料金体系では、データベースコストは vCPU 時間あたりのサードパーティのライセンス料として別途請求され、サードパーティのライセンス料は、お客様の組織が AWS から受ける割引の対象にはなりません。お客様の使用に関連する Microsoft Windows および SQL Server の料金は、AWS Billing and Cost Management および毎月の請求書でご確認いただけます。詳細については、RDS for SQL Server の料金、Amazon RDS ユーザーガイド、AWS ニュースブログをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "a926ba0745afe3581a5a7ec9c5112cfcf69f211c",
      "title": "Amazon RDS for SQL Server が Developer Edition のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-rds-sql-server-supports-developer-edition/",
      "pubDate": "2025-12-02T14:00:00.000Z",
      "contentSnippet": "Amazon Relational Database Service (Amazon RDS) for SQL Server が Microsoft SQL Server 2022 Developer Edition の提供を開始しました。SQL Server Developer Edition は SQL Server の無料エディションで、エンタープライズエディションのすべての機能が含まれており、本番環境以外のあらゆる環境で使用できます。これにより、お客様はコストを削減し、本番データベース構成との一貫性を維持しながら、SQL Server を使用してアプリケーションを構築、テスト、デモンストレーションできます。\n  以前は、開発環境およびテスト環境用に Amazon RDS for SQL Server インスタンスを作成したお客様は、SQL Server Standard Edition または SQL Server Enterprise Edition を使用する必要がありました。その結果、本番環境以外の環境における使用でも追加のデータベースライセンスコストが発生していました。お客様が SQL Server Developer Edition を使用することで、Amazon RDS の開発およびテストインスタンスのコストを下げることができるようになりました。さらに、開発とテストを目的とした自動バックアップ、自動ソフトウェア更新、モニタリング、暗号化などの Amazon RDS for SQL Server の機能は、Developer Edition でも利用可能です。\n  ただし、Microsoft SQL Server Developer Edition のライセンスは、その使用を開発およびテスト目的に限定しており、本番環境では使用できません。また、エンドユーザーに直接サービスを提供する商業目的では使用できません。詳細については、Amazon RDS for SQL Server ユーザーガイドを参照してください。料金の詳細、および利用可能なリージョンの詳細については、Amazon RDS for SQL Server の料金を参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "4b1dc89923484a7d9b15302b21443b4faf3f215c",
      "title": "NVIDIA GB300 NVL72 によってアクセラレーションされた Amazon EC2 P6e-GB300 UltraServers の一般提供が開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-p6e-gb300-ultraservers-nvidia-gb300-nvl72-generally-available",
      "pubDate": "2025-12-02T14:00:00.000Z",
      "contentSnippet": "AWS は本日、Amazon Elastic Compute Cloud (Amazon EC2) P6e-GB300 UltraServers の一般提供を開始しました。P6e-GB300 UltraServers は、NVIDIA GB300 NVL72 によってアクセラレーションされ、P6e-GB200 と比較して 1.5 倍の GPU メモリと 1.5 倍の FP4 コンピューティング (スパースなし) を備えています。 \n \nお客様は、より高度なコンテキストを必要とするアプリケーションや、推論やエージェンティック AI などの新しい推論技術を実装するアプリケーション向けに、P6e-GB300 を使用して本番環境で最も強力なモデルのパフォーマンスを最適化できます。\n \nP6e-GB300 UltraServers の使用を開始するには、AWS 営業担当者にお問い合わせください。\n \nP6e UltraServers とインスタンスの詳細については、Amazon EC2 P6 インスタンスをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "9b19de024fcbc8d6a9fafef1d01034f7030dd35d",
      "title": "Amazon EMR Serverless により、Apache Spark ワークロードのローカルストレージのプロビジョニングが不要に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-emr-serverless-local-storage-provisioning-apache-spark-workloads",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon EMR Serverless で、Apache Spark ワークロード向けにローカルストレージプロビジョニングを不要にするサーバーレスストレージが提供されるようになりました。これにより、データ処理コストを最大 20% 削減し、ディスク容量の制約によるジョブの失敗を防ぎます。アプリケーションごとにローカルディスクの種類やサイズを設定する必要がなくなりました。EMR Serverless はシャッフルなどの中間データオペレーションを自動的に処理し、ローカルストレージ料金は発生しません。ジョブが消費したコンピューティングリソースとメモリリソースに対してのみ料金を支払います。\n  EMR Serverless は、中間データオペレーションをフルマネージドかつ自動スケール可能なサーバーレスストレージにオフロードし、転送中および保存中のデータを暗号化し、ジョブ単位で分離します。サーバーレスストレージはストレージをコンピューティングから切り離すため、Spark は一時的なデータを保存するためにワーカーをアクティブにしておくのではなく、アイドル状態になったらすぐにワーカーを解放できるようにします。ディスク容量不足によるジョブの失敗を防ぎ、アイドル状態のワーカーへの課金を回避することでコストを削減します。これは、動的なリソース割り当てを使用するジョブに特に役立ちます。たとえば、数百万件のお客様との対話を処理するレコメンデーションエンジンなど、初期段階で大規模なデータセットを高い並列処理で処理し、データが集約されるにつれてリソースが減少するようなジョブです。\n  この機能は、EMR リリース 7.12 以降で一般提供されています。利用可能なリージョンについては、サポートされている AWS リージョンをご覧ください。使用を開始するには、EMR サーバーレスのドキュメントのサーバーレスストレージをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "1a73e059c3173a4e4f2f1dac4a1c6f408b4e7414",
      "title": "Amazon Bedrock は、18 のフルマネージドオープンウェイトモデルを追加しました。これは、これまでで最大の新規モデルの拡張です",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-bedrock-fully-managed-open-weight-models",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon Bedrock は、本番規模で生成 AI アプリケーションとエージェントを構築するためのプラットフォームです。Amazon Bedrock では、統合 API を通じて主要 AI 企業の幅広いフルマネージドモデルにアクセスできます。これにより、アプリケーションの書き換えや、インフラストラクチャの変更を行わずに、新しいモデルの評価、切り替え、採用が可能になります。Amazon Bedrock は本日、18 のフルマネージド型オープンウェイトモデルをモデルラインナップに追加しました。これは、これまでで最大の新規モデルの拡張です。\n \n以下のモデルが Amazon Bedrock で利用可能になりました。\n  \nGoogle: Gemma 3 4B、Gemma 3 12B、Gemma 3 27B\n \nMiniMax AI: MiniMax M2\n \nMistral AI:  Mistral Large 3、Ministral 3 3B、Ministral 3 8B、Ministral 3 14B、Magistral Small 1.2、Voxtral Mini 1.0、Voxtral Small 1.0\n \nMoonshot AI: Kimi K2 Thinking\n \nNVIDIA: NVIDIA Nemotron Nano 2 9B、NVIDIA Nemotron Nano 2 VL 12B\n \nOpenAI: gpt-oss-safeguard-20b、gpt-oss-safeguard-120b\n \nQwen: Qwen3-Next-80B-A3B, Qwen3-VL-235B-A22B\n \n利用可能な AWS リージョンの全リストについては、ドキュメントを参照してください。\n \nAmazon Bedrock が提供するすべてのモデルの詳細については、Amazon Bedrock モデル選択ページをご覧ください。Amazon Bedrock でこれらのモデルの使用を開始するには、リリースブログを読み、Amazon Bedrock コンソールにアクセスしてください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "93f0cac1095b81dbc85fc18a2a802638d659b90b",
      "title": "Amazon S3 Vectors は、プレビュー時の 40 倍の規模で一般提供されています。",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-s3-vectors-generally-available",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon S3 Vectorsは、ベクトルの保存とクエリをネイティブにサポートする初のクラウドオブジェクトストレージで、一般公開されるようになりました。S3 Vectors は、AI エージェント、推論、検索拡張生成 (RAG)、セマンティック検索向けに、数十億ベクトル規模で動作する専用のコスト最適化されたベクトルストレージを提供します。S3 Vectors は、Amazon S3 と同等の弾力性、耐久性、可用性を提供するように設計されており、ベクトルのアップロード、保存、クエリにかかる総コストを最大 90% 削減します。一般提供では、1 つのインデックスあたり最大 20 億ベクトルを保存およびクエリでき、1 つのベクトルバケットあたり最大 10,000 のベクトルインデックスまで柔軟にスケールできます。頻度の低いクエリは 1 秒未満で結果を返し続けますが、頻繁の高いクエリでは、レイテンシーが約 100 ミリ秒以下になるようになりました。アプリケーションでは、単一ベクトルの更新をインデックスにストリーミングする際に、1 秒あたり 1,000 ベクトルの書き込みスループットを達成できます。また、1 つのクエリで最大 100 件の検索結果を取得し、各ベクトルと一緒に最大 50 のメタデータキーを保存して、クエリできめ細かくフィルタリングできるようにします。\n \nS3 Vectors では、耐久性に優れた低コストのベクトルストレージに最適化された新しいバケットタイプ、つまりベクトルバケットを利用できます。ベクトルバケット内では、ベクトルインデックスを使用してベクトルデータを整理し、インフラストラクチャをプロビジョニングすることなくベクトルを保存、アクセス、クエリするための専用の API セットを利用できます。S3 Vectors は デフォルトで S3 マネージドキー (SSE-S3) を使用したサーバー側の暗号化で、ベクトルバケット内のすべてのベクトルデータを暗号化します。また、オプションで、AWS Key Management Service (SSE-KMS) を使用してデフォルトのお客様管理キーを設定して、ベクトルバケット内のすべての新しいベクトルインデックスを暗号化することもできます。また、ベクトルインデックスごとにお客様管理専用のキーを設定できるようになったため、スケーラブルなマルチテナントアプリケーションを構築し、規制やガバナンスの要件に対応するのに役立ちます。また、属性ベースのアクセス制御 (ABAC) 用にベクトルバケットとインデックスにタグを付けたり、AWS Billing and Cost Management を使用してコストを追跡および整理したりすることもできます。\n \nS3 Vectors は Amazon Bedrock ナレッジベースと統合されているため、RAG に大規模なベクトルデータセットを使用する際のコストを削減できます。Amazon Bedrock または Amazon SageMaker Unified Studio でナレッジベースを作成する際、既存の Amazon S3 ベクトルインデックスを選択するか、クイック作成ワークフローを使用して新しいベクトルインデックスを作成できます。Amazon OpenSearch Service を使用すると、S3 におけるベクトルストレージを自動的に管理するように OpenSearch を設定することで、ハイブリッド検索ワークロードのコストを最適化できます。\n \nS3 Vectors は、プレビュー時の 5 リージョンから拡大し、現在は 14 の AWS リージョンで一般提供されています。詳細については、製品ページ、S3 の料金ページ、ドキュメント、AWS ニュースブログをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "771ccf3ce1a42b39d8427778508b54296e3c7f42",
      "title": "AWS サポートの変革: 信頼できる人間の専門知識による AI を活用した運用",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-support-transformation-ai-powered-operations",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS サポートは、サポートポートフォリオを、ビジネスサポート +、エンタープライズサポート、統合運用という 3 つのインテリジェントなエクスペリエンス主導型プランに簡略化したことを発表しました。各プランは、AI のスピードと精度を AWS エンジニアの専門知識と組み合わせたものです。上位プランになるほど、前のプランを基盤としつつ、より高速な応答時間、より積極的なガイダンス、よりスマートな運用が追加されています。その結果、エンジニアリングの負担が軽減され、信頼性と回復力が強化され、クラウド運用の合理化が実現しました。\n  ビジネスサポート + は、お客様の状況を理解する AI を活用した支援を 24 時間 365 日提供し、重大な問題については AWS の専門家に 30 分以内に直接対応します。これは現在のプランの 2 倍の速さです。エンタープライズサポートでは、これに加えて、専任のテクニカルアカウントマネージャー (TAM) が加わり、生成 AI によるインサイトと人間の判断力を組み合わせて、回復力、コスト、効率に関する戦略的な運用ガイダンスを提供します。また、追加料金なしの AWS Security Incident Response も含まれており、お客様はこれをアクティブ化してセキュリティアラートの調査とトリアージを自動化できます。最上位プランである Unified Operations は、ミッションクリティカルなワークロード向けに設計されており、指定された専門家からなるグローバルチームが、アーキテクチャレビュー、ガイド付きテスト、プロアクティブな最適化、重大なインシデントに対する 5 分間の状況に応じた応答を提供します。AWS DevOps エージェント (プレビュー) を使用しているお客様は、必要に応じて調査画面からワンクリックで AWS サポートと連携でき、AWS の専門家にコンテキストがすぐに伝わり、より迅速な解決が可能になります。AWS DevOps エージェントは、インシデントを解決し、さらに事前に防止するフロンティアエージェントであり、AWS、マルチクラウド、ハイブリッド環境におけるアプリケーションの信頼性とパフォーマンスを継続的に向上させます。\n  ビジネスサポート +、エンタープライズサポート、統合オペレーションは、すべての商用 AWS リージョンで利用可能です。既存のお客様は、現在のプランを継続することも、パフォーマンスと効率を向上させる新しいサービスを検討することもできます。AWS が AI インテリジェンスと人間の専門知識を融合させてクラウド運用を変革する方法については、AWS サポートの製品ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "88b45344cee418bac73f430c4b2ca42a4e46b162",
      "title": "AWS セキュリティエージェント (プレビュー): プロアクティブなアプリケーションセキュリティのための AI エージェント",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-security-agent-preview",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "本日、AWS は、開発ライフサイクル全体を通じてアプリケーションを積極的に保護する AI 搭載エージェントである AWS セキュリティエージェントのプレビューを発表しました。AWS セキュリティエージェントは、組織の要件に合わせた自動セキュリティレビューを実施し、状況に応じたペネトレーションテストを行います。設計からデプロイまで継続的にセキュリティを検証することで、あらゆる環境において開発初期の段階で脆弱性を防止するのに役立ちます。\n \nセキュリティチームは、承認された暗号化ライブラリ、認証フレームワーク、ログ標準などの組織のセキュリティ要件を AWS セキュリティエージェントのコンソールで一度だけ定義します。その後、AWS セキュリティエージェントは、アーキテクチャ文書とコードをお客様が定義した基準に照らして評価し、開発全体を通じてこれらの要件を自動的に検証して、違反が検出された場合は具体的なガイダンスを提供します。デプロイ時の検証では、セキュリティチームがペネトレーションテストの範囲を定義し、AWS セキュリティエージェントがアプリケーションコンテキストを開発し、高度な攻撃チェーンを実行し、脆弱性を発見し、検証します。これにより、すべてのチームに一貫したセキュリティポリシーの適用が可能となり、開発速度に合わせてセキュリティレビューをスケールでき、従来のペネトレーションテストを定期的なボトルネックからオンデマンドな機能へと変革し、リスクの露出を大幅に削減します。\n \nAWS セキュリティエージェント (プレビュー) は現在、米国東部 (バージニア北部) リージョンで利用できます。すべてのデータは安全かつプライベートに保たれます。クエリやデータがモデルのトレーニングに使用されることはありません。AWS セキュリティエージェントは、監査とコンプライアンス対応のために API アクティビティを AWS CloudTrail に記録します。\n \nAWS セキュリティエージェントの詳細については、製品ページにアクセスしてリリースのお知らせをお読みください。技術的な詳細や利用開始方法については、AWS セキュリティエージェントのドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "ea8a85bf3cc9691613195ab9d6785c010f826cad",
      "title": "Amazon Bedrock AgentCore にポリシー (プレビュー)、評価 (プレビュー) などが含まれるように",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-bedrock-agentcore-policy-evaluations-preview",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "本日、Amazon Bedrock AgentCore は、ポリシー (プレビュー) や評価 (プレビュー) などの新しい機能を導入しました。これにより、チームが組織全体でエージェントデプロイを自信を持ってスケールするために必要な制御と品質保証を提供し、エージェントをプロトタイプから本番稼働のソリューションへと進化させます。\n  AgentCore のポリシーは、AgentCore Gateway と統合され、すべてのツールコールをリアルタイムで傍受し、エージェントが速度を落とすことなく定義された境界内にとどまるようにします。チームは自然言語でポリシーを作成でき、それは AWS のオープンソースポリシー言語である Cedar に自動変換されます。これにより、開発、コンプライアンス、セキュリティチームは、カスタムコードを記述しなくてもルールを設定、理解、監査できます。AgentCore Evaluations は、デベロッパーが実際の行動に基づいてエージェントのパフォーマンスをテストし、継続的に監視することで品質を向上させ、お客様に広範囲にわたる影響を与える前に問題を発見するのに役立ちます。デベロッパーは、有用性、ツールの選択、正確性など、一般的な品質指標に対応した 13 種類のビルトインエバリュエーターを使用したり、カスタムモデルベースのスコアリングシステムを作成したりできます。これにより、評価インフラストラクチャの開発に必要な労力を大幅に削減できます。すべての品質メトリクスには、Amazon CloudWatch を基盤とした統合ダッシュボードからアクセスできます。また、より高度なエージェント機能をサポートするために、AgentCore Memory、AgentCore Runtime、AgentCore Identity に新機能を追加しました。AgentCore Memory はエピソード記憶が含むようになり、エージェントは経験から学習および適応できるようになり、時間をかけて知識を蓄積し、より人間らしい対話を実現できるようになりました。AgentCore Runtime は、双方向ストリーミングをサポートし、エージェントが会話中に同時に聞き取り、応答し、中断やコンテキスト変更にも対応できる自然な対話を実現し、強力な音声エージェントのユースケースを可能にします。AgentCore Identity は、カスタムクレームをサポートし、選択した ID プロバイダーとのシームレスな統合を維持しながら、マルチテナント環境全体で高度な認証ルールを実現できるようになりました。\n  AgentCore Evaluations は、米国東部 (バージニア北部)、米国西部 (オレゴン)、アジアパシフィック (シドニー)、欧州 (フランクフルト) の 4 つの AWS リージョンでプレビューとして利用できます。AgentCore のポリシーは、AgentCore が利用可能なすべての AWS リージョンでプレビューとして利用できます。\n  AgentCore の詳細についてはブログをご覧いただき、AgentCore リソースによる詳細な解説を確認してください。使用を開始するには、AgentCore スターターツールキットをご利用ください。AgentCore は、初期費用なしで消費ベースの価格設定を提供しています。",
      "siteName": "AWS What's New"
    },
    {
      "id": "695538c3ea7286fe10f6b5a7d8897b5ded1f2095",
      "title": "Amazon Nova 2 基盤モデルが Amazon Bedrock で利用可能に",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/nova-2-foundation-models-amazon-bedrock/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS は本日、業界トップクラスの価格パフォーマンスで推論機能を提供する次世代の汎用モデルである Amazon Nova 2 を発表しました。Amazon Bedrock で現在ご利用いただける新しいモデルは次のとおりです。\n \n• Amazon Nova 2 Lite: 日常的なワークロード向けの高速でコスト効率に優れた推論モデル。\n \n• Amazon Nova 2 Pro (プレビュー): 複数のステップからなる非常に複雑なタスク向けの最もインテリジェントなモデル。\n \nAmazon Nova 2 Lite と Amazon Nova 2 Pro (プレビュー) は、前世代のモデルに比べて大幅に進歩しています。これらのモデルは、段階的な推論とタスク分解による拡張思考をサポートし、3 つの思考強度レベル (低、中、高) を備えています。そのため、デベロッパーは速度、インテリジェンス、コストのバランスを制御できます。また、コードインタープリターやウェブグラウンディングなどの組み込みのツールを利用できるほか、リモート MCP ツールもサポートされています。さらに、100 万トークンのコンテキストウィンドウにより、より豊かなインタラクションを実現できます。\n \nNova 2 Lite は日常のさまざまなタスクに使用でき、価格、パフォーマンス、速度の最適なバランスを実現します。先行アクセスを利用しているお客様は、カスタマーサービスのチャットボット、ドキュメント処理、ビジネスプロセスの自動化に Nova 2 Lite を活用しています。Nova 2 Lite は、Amazon Bedrock と Amazon SageMaker で教師ありファインチューニング (SFT) を使用してカスタマイズでき、Amazon SageMaker ではフルファインチューニングも可能です。Amazon Nova 2 Pro (プレビュー) は、マルチドキュメント分析、動画推論、ソフトウェア移行などの非常に複雑なエージェントタスクに使用できます。\n \nAmazon Nova 2 Lite と Nova 2 Pro (プレビュー) は現在、複数の場所でのグローバルなクロスリージョン推論を通じて、Amazon Bedrock 上でご利用いただけます。Nova 2 Pro はプレビュー段階にあり、Amazon Nova Forge のすべてのお客様が先行アクセスを利用できます。アクセスをご希望の方は、AWS アカウントチームまでお問い合わせください。\n \n詳細については、AWS ニュースブログ、Amazon Nova モデルの製品ページ、Amazon Nova ユーザーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "b9ca1f508426905fbc73fbfdeafd693ad9e6f878",
      "title": "AWS Lambda、複数ステップからなるアプリケーションと AI ワークフロー向けの永続関数を発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/lambda-durable-multi-step-applications-ai-workflows/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS Lambda は永続関数を発表しました。これにより、デベロッパーは、Lambda の開発体験のままで、信頼性の高い複数ステップからなるアプリケーションや AI ワークフローを構築できるようになります。永続関数は、自動的に進捗状況のチェックポイントを作成し、長時間実行中のタスクの実行を最大 1 年間中断し、障害から回復します。いずれも場合も、追加のインフラストラクチャを管理したり、カスタムの状態管理やエラー処理コードを作成したりする必要はありません。\n  お客様が Lambda を使用する理由は、イベント駆動型のプログラミングモデルのシンプルさと豊富な統合機能です。従来の Lambda 関数は存続期間の短い単一タスクの処理に優れていますが、注文処理、ユーザーオンボーディング、AI 支援ワークフローなどの複雑な複数ステップからなるアプリケーションを構築する場合、デベロッパーは、以前はカスタムの状態管理ロジックを実装するか、外部のオーケストレーションサービスと統合する必要がありました。Lambda 永続関数は、Lambda プログラミングモデルに「ステップ」や「待機」などの新しい操作を追加することで、この機会に対応しました。これにより、進捗をチェックポイントとして記録し、コンピューティング料金を発生させることなく実行を一時停止することが可能になります。このサービスは、状態管理、エラー回復、長時間実行タスクの効率的な一時停止と再開を処理するため、ユーザーはコアビジネスロジックに集中できます。\n  Lambda 永続関数は、米国東部 (オハイオ) で一般的に提供されており、Python (バージョン 3.13 と 3.14) と Node.js (バージョン 22 と 24) のランタイムをサポートしています。最新のリージョン対応状況については、AWS 機能 (リージョン別) ページをご覧ください。\n  永続関数 は、AWS Lambda API、AWS マネジメントコンソール、AWS コマンドラインインターフェイス (AWS CLI)、AWS Cloud Formation、AWS サーバーレスアプリケーションモデル (AWS SAM)、AWS SDK、AWS Cloud Development Kit (AWS CDK) を使用して、Python または Node.js ベースの新しい Lambda 関数に対して有効にできます。永続関数の詳細については、AWS Lambda デベロッパーガイドとリリースブログ投稿をご覧ください。料金については、AWS Lambda の料金をご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "1c5d4cbcb330df1a9810761a171b53cee7e1680d",
      "title": "Amazon S3 Tables が Apache Iceberg テーブルの自動レプリケーションのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/s3-tables-automatic-replication-apache-iceberg-tables/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon S3 Tables は、AWS リージョンとアカウント間の Apache Iceberg テーブルの自動レプリケーションをサポートするようになりました。この新機能により、すべてのスナップショットとメタデータを含むテーブル構造全体がレプリケートされ、クエリの待ち時間が短縮され、グローバルな分析ワークロードのデータアクセシビリティが向上します。\n  S3 Tables レプリケーションは、ターゲットテーブルバケットに読み取り専用のレプリカテーブルを自動的に作成し、ソーステーブルの最新の状態でバックフィルし、レプリカの同期を維持するために新しい更新を継続的に監視します。レプリカテーブルは、コンプライアンスとデータ保護の要件を満たすために、ソーステーブルから独立したスナップショット保持ポリシーと暗号化キーを使用して構成できます。レプリカテーブルは、Amazon SageMaker Unified Studio または Amazon Athena、Amazon Redshift、Apache Spark、DuckDB などの任意の Iceberg 互換エンジンを使用してクエリできます。\n  S3 Tables レプリケーションは、S3 Tables がサポートされているすべての AWS リージョンで利用できるようになりました。料金の詳細については、Amazon S3 の料金ページをご覧ください。S3 Tables の詳細については、製品ページ、ドキュメントにアクセスし、AWS ニュースブログをお読みください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "a40433bfe626278830e997251a8bf3d7593c1e00",
      "title": "AWS Security Hub がほぼリアルタイムのリスク分析機能とともに一般提供されるように ",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/security-hub-near-real-time-risk-analytics/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon Web Services (AWS) は、重要なセキュリティ問題に優先順位を付け、大規模な対応、セキュリティリスクの軽減、チームの生産性の向上に役立つ統合クラウドセキュリティソリューションである AWS Security Hub の一般提供を発表しました。一般提供に伴い、Security Hub には、ほぼリアルタイムのリスク分析、高度なトレンド分析、統合された有効化および管理、複数の AWS セキュリティサービスでの一元化された料金設定が含まれるようになりました。Security Hub は、Amazon GuardDuty、Amazon Inspector、AWS Security Hub CSPM からのセキュリティシグナルを相互に関連付けて強化することで重大なリスクを検出し、クラウド環境でアクティブなリスクをすばやく特定して優先順位を付けることができます。\n  Security Hub は、ほぼリアルタイムのリスク分析と高度なトレンド分析を提供するようになり、強化された視覚化とコンテキストエンリッチメントにより、相関するセキュリティシグナルを実用的なインサイトに変換できるようになりました。Security Hub は、個々のアカウントで有効にすることも、デプロイと管理を一元化して AWS 組織全体で有効にすることもできます。これらの新機能は、漏えい調査、セキュリティに焦点を当てたアセットインベントリ、攻撃経路の視覚化、チケットシステム統合による自動対応ワークフローなどの既存の機能を補完します。この一元管理により、複数のコンソール間で手動で関連付ける必要性が減り、潜在的な運用上の中断を最小限に抑えながら、大規模な合理化された修復を可能にします。また、複数の AWS セキュリティサービスにわたる料金を統合する合理化された価格設定により、コストの予測可能性が向上しました。このサービスは、攻撃者がどのように脅威、脆弱性、設定ミスを連鎖させて重要なリソースを危険にさらす可能性があるかを示すことで、潜在的な攻撃経路を自動的に視覚化し、より包括的な分析によってより深いリスクコンテキストを提供します。\n  Security Hub が利用可能な AWS 商用リージョンの詳細については、AWS リージョン表をご覧ください。このサービスは既存の AWS セキュリティサービスと統合されるため、運用上のオーバーヘッドを増やすことなく、より包括的なセキュリティ体制を実現できます。Security Hub の詳細を確認し、使用を開始するには、AWS Security Hub コンソールまたは AWS Security Hub 製品ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "c1205de8169c0dc279df2823e832d655ca0fbb78",
      "title": "Amazon RDS for Oracle/SQL Server は、追加のストレージボリュームを追加して最大 256 TiB のストレージのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/rds-oracle-sql-server-256-tib-storage-support/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon Relational Database Service (Amazon RDS) for Oracle/SQL Server は、データベースインスタンスあたりのストレージサイズを 4 倍にした最大 256 TiB をサポートするようになりました。お客様は、プライマリストレージボリュームに加えて最大 3 つのストレージボリューム (それぞれ最大 64 TiB のストレージ) をデータベースインスタンスに追加できます。追加のストレージボリュームは、アプリケーションのダウンタイムなしにデータベースインスタンスに追加、スケールアップ、または削除できるため、お客様は変化するワークロード要件に基づいて、時間の経過とともにストレージボリュームを柔軟に追加および調整できます。\n  ストレージボリュームを追加することで、お客様はプライマリボリュームで使用可能な最大ストレージサイズを超えてデータベースストレージをスケールし続けることができます。また、月末のデータ処理やローカルストレージからのデータのインポートなど、ストレージの追加が短期的に必要になった場合は、一時的にボリュームを追加し、不要になったら未使用のボリュームを削除できます。さらに、お客様はデータベースインスタンスに高性能のプロビジョンド IOPS SSD (io2) ボリュームと汎用 (gp3) ボリュームを組み合わせて使用することで、コストパフォーマンスを最適化できます。たとえば、一貫した IOPS パフォーマンスを必要とするデータを io2 ボリュームに保存し、アクセス頻度の低い履歴データを gp3 ボリュームに保存して、ストレージコストを最適化できます。\n  使用を開始するには、お客様は AWS マネジメントコンソール、AWS CLI、または SDK を使用して、新規または既存のデータベースインスタンスに追加のストレージボリュームを作成できます。詳細については、RDS for Oracle ユーザーガイドおよびRDS for SQL Server ユーザーガイドをご覧ください。お客様がストレージボリュームを増やすことでどのようなメリットが得られるかについて詳しくは、AWS ニュースブログ投稿をご覧ください。追加のストレージボリュームは、AWS のすべての商用リージョンと AWS GovCloud (米国) リージョンで利用できます。",
      "siteName": "AWS What's New"
    },
    {
      "id": "bed507903c709efbf7f89dc6080a86bd45a0881c",
      "title": "AWS AI Factory の紹介",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-ai-factories",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS AI Factory が利用できるようになり、お客様のデータセンターに迅速にデプロイ可能で高性能な AWS AI インフラストラクチャが提供されるようになりました。最新の AWS Trainium アクセラレーターと NVIDIA GPU、専用の低レイテンシーネットワーク、高性能ストレージ、AWS AI サービスを組み合わせることで、AI Factories は、単独で構築する場合と比較して、AI の構築を数か月または数年短縮できます。AWS AI Factory は、20 年近くにわたる AWS クラウドのリーダーシップに関する専門知識を活用することで、通常 AI の取り組みを遅らせるような調達、セットアップ、最適化の複雑さを解消します。\n \nAmazon Bedrock や Amazon SageMaker などの統合された AWS AI サービスを使用すると、個々のモデルプロバイダーと個別に契約交渉を行うことなく、主要な基盤モデルにすぐにアクセスできます。  AWS AI Factory は、お客様またはお客様が指定した信頼できるコミュニティ専用に構築された専用環境として動作し、より広範な AWS サービスと統合しながらも、完全な分離と運用上の独立性を確保します。このアプローチは、各国政府や企業がデジタル主権の要件を満たすのを支援しつつ、AWS クラウドの比類ないセキュリティ、信頼性、および機能の恩恵を受けることを可能にします。お客様がすでに取得済みのデータセンターのスペースと電力容量を提供し、AWS がインフラストラクチャをデプロイおよび管理します。 \n \nAWS AI Factory は、厳格なデータレジデンシー要件を備えた安全で分離された環境を求めるあらゆる業界の企業や政府機関に、高度な AI テクノロジーを提供します。これらの専用環境では、パブリッククラウドリージョンと同じ高度なテクノロジーを利用できるため、AI を活用したアプリケーションを構築したり、所有データを使用して大規模な言語モデルをトレーニングおよびデプロイしたりできます。AWS では、独自にキャパシティを構築するのに何年も費やすのではなく、デプロイのスケジュールを短縮できるため、インフラストラクチャの複雑化ではなくイノベーションに集中できます。 \n \nデータセンターに AWS AI Factory をデプロイする方法と、専用の AI インフラストラクチャを大規模に構築および維持してきた AWS の実績ある専門知識を活用して AI の取り組みを加速する方法の詳細については、AWS アカウントチームにお問い合わせください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "f3183a5beecc7d1b1c1f198a6d063fc72d682fa1",
      "title": "新しいコンピューティング最適化 Amazon EC2 C8a インスタンスの発表 ",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/compute-optimized-amazon-ec2-c8a-instances/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS は、コンピューティング最適化 Amazon EC2 C8a インスタンスの一般提供を開始したことを発表しました。C8a インスタンスは、最大周波数が 4.5 GHz の第 5 世代 AMD EPYC プロセッサ (旧コード名 Turin) を搭載しており、C7a インスタンスと比較してパフォーマンスが最大 30%、コスト効率が最大 19% 向上します。\n  C8a インスタンスは C7a インスタンスと比較して、メモリ帯域幅が 33% 広いため、レイテンシーの影響を受けやすいワークロードに理想的です。Amazon EC2 C7a インスタンスと比較すると、GroovyJVM の場合は最大 57% 高速になり、Java ベースのアプリケーションの応答時間が短縮されます。C8a インスタンスには、2 つのベアメタルサイズを含む 12 のサイズがあります。さまざまなインスタンスサイズが用意されているため、お客様はワークロード要件に正確に対応できます。\n  C8a インスタンスは AWS Nitro System 上に構築され、バッチ処理、分散分析、ハイパフォーマンスコンピューティング (HPC)、広告配信、高度にスケーラブルなマルチプレイヤーゲーム、ビデオエンコーディングなど、パフォーマンスが高く計算量の多いアプリケーションに最適です。\n  C8a インスタンスは、米国東部 (バージニア北部)、米国東部 (オハイオ)、および米国西部 (オレゴン) の AWS リージョンで利用できます。使用を開始するには、AWS マネジメントコンソールにサインインしてください。このインスタンスは、Savings Plans、オンデマンドインスタンス、スポットインスタンスでご購入いただけます。詳細については、Amazon EC2 C8a インスタンスのページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "f7295bc069919ea977e3f868e28e414b44d7e120",
      "title": "より迅速で低コストの生成 AI トレーニングを実現する Amazon EC2 Trn3 UltraServers の発表 ",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-trn3-ultraservers",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS は、第 4 世代 AI チップ Trainium3 を搭載した Amazon Elastic Compute Cloud (Amazon EC2) Trn3 UltraServers の一般提供を発表しました。これは、次世代のエージェンシー、推論、動画生成アプリケーションに最適のトークンエコノミクスを提供することを目的として構築された、最初の 3nm AWS AI チップです。\n  各 AWS Trainium3 チップは 2.52 ペタフロップス (PFLOP) の FP8 コンピューティングを提供し、メモリ容量は Trainium2 の 1.5 倍で、帯域幅は 1.7 倍に増加し、HBM3e メモリは 144 GBで、メモリ帯域幅は 4.9 Tb/s です。Trainium3 は、高度なデータ型 (MXFP8およびMXFP4) を備え、リアルタイム、マルチモーダル、推論タスクのためのメモリと計算のバランスが改善された高密度ワークロードとエキスパート並列ワークロードの両方向けに設計されています。\n  Trn3 UltraServers は、最大 144 個の Trainium3 チップ (合計 362 個の FP8 PFLOP) までスケールアップでき、EC2 UltraClusters 3.0 では数十万個のチップまでスケールできます。完全構成の Trn3 UltraServers は、最大 20.7 TB の HBM3e と 706 TB/秒の総メモリ帯域幅を提供します。次世代の Trn3 UltraServer は、Trn2 UltraServer のチップ間インターコネクト帯域幅を 2 倍にするオールツーオールファブリックである NeuronSwitch-V1 を採用しています。\n  Trn3 は、Trn2 UltraServers と比較して、最大 4.4 倍のパフォーマンス、3.9 倍のメモリ帯域幅、4 倍高いワットあたりのパフォーマンスを提供し、強化学習、Mixture-of-Experts (MoE)、推論、ロングコンテキストアーキテクチャなど、最先端スケールのモデルのトレーニングと提供において最適なコストパフォーマンスを実現します。Amazon Bedrock では、Trainium3 が最速のアクセラレーターであり、ユーザーあたりのレイテンシーは同程度で、メガワットあたりの出力トークンは 5 倍以上高く、Trainium2 の最大 3 倍のパフォーマンスを提供します。\n  新しい Trn3 UltraServers は AI 研究者向けに構築され、AWS Neuron SDK を搭載しているため、画期的なパフォーマンスを実現できます。PyTorch のネイティブ統合により、デベロッパーはモデルコードを一行も変更せずにトレーニングやデプロイを行うことができます。AI パフォーマンスエンジニア向けに、Trainium3 へのより深いアクセスを可能にしました。これにより、パフォーマンスのファインチューニング、カーネルのカスタマイズ、モデルのさらなる拡張が可能になります。イノベーションはオープン性によって成り立つため、私たちはオープンソースのツールやリソースを通じてデベロッパーと交流することに全力を注いでいます。",
      "siteName": "AWS What's New"
    },
    {
      "id": "ff09be0624885bdebfc790b5c7f7033ebd10ad7f",
      "title": "Amazon GuardDuty Extended Threat Detection が Amazon EC2 と Amazon ECS のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/guardduty-extended-threat-detection-ec2-ecs/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS は、AWS Fargate または Amazon EC2 で実行されている Amazon Elastic Compute Cloud (Amazon EC2) インスタンスと Amazon Elastic Container Service (Amazon ECS) クラスターを標的とする多段階攻撃を検出する新機能により、Amazon GuardDuty Extended Threat Detection をさらに強化したことを発表しました。GuardDuty Extended Threat Detection では、AWS 規模でトレーニングされた人工知能と機械学習のアルゴリズムを使用し、セキュリティシグナルを自動的に相互に関連付けて重大な脅威を検出します。ネットワークアクティビティ、プロセス実行時の動作、マルウェアの実行、AWS APIアクティビティにわたる複数のセキュリティシグナルを長期間にわたって分析し、他の方法では気付かれないような高度な攻撃パターンを検出します。\n  今回の発表により、GuardDuty は、AttackSequence:EC2/CompromisedInstanceGroup と AttackSequence:ECS/CompromisedCluster という2つの新しい重大度調査を導入しました。これらの調査結果は攻撃シーケンス情報を提供し、初期分析にかかる時間を短縮し、重大な脅威への対応により多くの時間を費やすことができるため、ビジネスへの影響を最小限に抑えることができます。たとえば、GuardDuty では、永続化を試みた疑わしいプロセス、暗号マイニングアクティビティ、リバースシェルの作成などを識別し、これらの関連イベントを 1 つの重大度検出結果として表示できます。各検出結果には、詳細な概要、詳細なイベントタイムライン、MITRE ATT&CK® の戦術と手法へのマッピング、修復のレコメンデーションが含まれています。\n  GuardDuty Extended Threat Detection は、GuardDuty のお客様には追加費用なしで自動的に有効になりますが、その検出の包括性は、有効にしている GuardDuty 保護プランによって異なります。Amazon EC2 インスタンスの攻撃シーケンスカバレッジと脅威分析を改善するには、EC2 の Runtime Monitoring を有効にします。侵害された ECS クラスターの検出を有効にするには、インフラストラクチャのタイプに応じて Fargate または EC2 のRuntime Monitoring を有効にします。\n  使用を開始するには、コンソールまたは API で GuardDuty 保護プランを有効にします。GuardDuty の新規のお客様は 30 日間の無料トライアルから始めることができ、Runtime Monitoring をまだ使用していない既存のお客様も 30 日間無料でお試しいただけます。追加情報については、ブログ投稿と Amazon Guard Duty 製品ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "24030b40dbfcd4ac0c379e17baef3dd7f346ea04",
      "title": "Amazon OpenSearch Service に GPU アクセラレーションと自動最適化ベクトルインデックスを追加",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-opensearch-service-gpu-accelerated-auto-optimized-vector-indexes",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon OpenSearch Service で GPU アクセラレーションを使用して、10 億規模のベクトルデータベースを 1 時間以内に構築できるようになりました。さらに、ベクトルインデックスを自動で最適化し、検索品質、速度、コストの最適なトレードオフを実現できるようになりました。\n  これまで、大規模なベクトルインデックスの構築には数日かかっていました。また、それらを最適化するには、専門家が何週間もかけて手動でチューニングする必要がありました。時間、コスト、労力が負担となり、イノベーションが遅れ、お客様はコストとパフォーマンスの最適化を諦めざるを得ない状況でした。今回のリリースにより、サーバーレスの自動最適化ジョブを実行して、最適化のレコメンデーションを生成できるようになりました。検索レイテンシーとリコール要件を指定するだけで、これらのジョブがインデックス設定 (k-NN アルゴリズム、量子化、エンジン設定) を自動的に評価します。その後、ベクトル GPU アクセラレーションを使用して、最適化されたインデックスを最大 10 倍高速に構築できます。インデックス作成コストは 4 分の 1 に削減されます。サーバーレス GPU により、ドメインまたはコレクションが動的に有効され、高速化されるため、料金が発生するのは高速化の効果が得られた場合のみです。なお、GPU インスタンスを管理する必要はありません。\n  これらの機能により、セマンティック検索、レコメンデーションエンジン、エージェントシステムなどの AI アプリケーションをより効率的にスケールできます。最適化された大規模なベクトルデータベースの構築を簡素化し、高速化することで、チームはより迅速にイノベーションを進められるようになります。\n  ベクトル GPU アクセラレーションは、米国東部 (バージニア北部)、米国西部 (オレゴン)、アジアパシフィック (シドニー)、欧州 (アイルランド)、アジアパシフィック (東京) の各リージョンで、ベクトルコレクションと OpenSearch 3.1 以上のドメインでご利用いただけます。ベクトル自動最適化は、米国東部 (オハイオ)、米国東部 (バージニア北部)、米国西部 (オレゴン)、アジアパシフィック (ムンバイ)、アジアパシフィック (シンガポール)、アジアパシフィック (シドニー)、アジアパシフィック (東京)、欧州 (フランクフルト)、欧州 (アイルランド) で、ベクトルコレクションと OpenSearch 2.17 以上のドメインでご利用いただけます。詳細はこちらをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "f79ec9ae7e2148835870cbae9f22bed1f04d8882",
      "title": "最大 35% の節約が可能になる Database Savings Plans の発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/database-savings-plans-savings",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS は本日、新しい柔軟な料金モデルである Database Savings Plans を発表しました。この料金モデルでは、1 年間にわたって一定の使用量 (USD/時間単位) を契約していただくと、最大 35% の節約が可能になります。なお、前払い料金は不要です。\n  Database Savings Plans は、サポートされるエンジン、インスタンスファミリー、サイズ、デプロイオプション、AWS リージョンに関わらず、対象となるサーバーレスインスタンスやプロビジョンドインスタンスの使用に自動的に適用されます。例えば、Database Savings Plan を使用することで、Aurora db.r7g インスタンスと db.r8g インスタンスの切り替え、欧州 (アイルランド) から米国 (オハイオ) へのワークロードの移行、Amazon RDS for Oracle から Amazon Aurora PostgreSQL、または RDS から Amazon DynamoDB へのモダナイズを行っても、Database Savings Plans が提供する割引料金のメリットを引き続き活用することができます。\n  Database Savings Plans は本日より、中国リージョンを除くすべての AWS リージョンでご利用いただけます。サポートされるのは、Amazon Aurora、Amazon RDS、Amazon DynamoDB、Amazon ElastiCache、Amazon DocumentDB (MongoDB 互換)、Amazon Neptune、Amazon Keyspaces (Apache Cassandra 向け)、Amazon Timestream、AWS Database Migration Service (DMS) です。\n  Database Savings Plans の使用は、AWS Billing and Cost Management コンソールから、または AWS CLI を使用して開始することができます。最大節約額を実現するには、コンソールで提供される購入推奨事項を使用して Savings Plans にコミットできます。さらにカスタマイズされた分析を行うには、Savings Plans 購入アナライザーを使用して、カスタム購入シナリオで実現可能なコスト節約額を見積もることができます。詳細については、Database Savings Plans の料金ページと AWS Savings Plans のよくある質問をご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "974b8b74a2d47bff5ae0628aa75ee98124fb7bd6",
      "title": "プレビュー版の Amazon Nova 2 Omni のご紹介",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-nova-2-omni-preview",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS は、新マルチモーダル推論と画像生成のためのオールインワンモデルである Amazon Nova 2 Omni を発表しました。これは、テキスト、画像、動画、音声の入力をサポートしつつ、テキストと画像の両方の出力を生成できる業界初の推論モデルです。これにより、マルチモーダル理解、自然言語を使用した画像生成と編集、音声書き起こしが可能になります。\n  従来のアプローチでは、異なる入力形式と出力形式をサポートする複数の専門モデルを組み合わせる必要がありましたが、Nova 2 Omni を使用することで複数の AI モデルを管理する複雑さが解消されます。これにより、複雑さとコストを軽減しながらアプリケーション開発を加速することができます。そのため、デベロッパーは、マーケティングコンテンツの作成やカスタマーサポート通話の書き起こしから、動画分析や視覚的支援によるドキュメンテーションまで、さまざまなタスクに取り組めるようになります。\n  このモデルは、100 万トークンのコンテキストウィンドウ、200 以上の言語によるテキスト処理、10 言語の音声入力をサポートしています。自然言語を使用して高品質の画像を生成および編集できるため、文字の一貫性の確保、画像内でのテキストレンダリング、オブジェクトや背景の変更が可能になります。Nova 2 Omni には、ネイティブな推論機能に基づく高度な音声理解が備わっているため、複数話者の会話の書き起こし、翻訳、要約を行えます。また、推論の深さや予算を柔軟に制御できるため、デベロッパーはさまざまなユースケースで最適なパフォーマンス、精度、コスト管理を実現できます。\n  Nova 2 Omni はプレビュー段階にあり、すべての Nova Forge のお客様が先行アクセスを利用できます。アクセスをご希望の方は、AWS アカウントチームにお問い合わせください。Amazon Nova 2 Omni の詳細については、ユーザーガイドをお読みください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "958e1cf2e3d1f7de628c21869eac732260bff4f0",
      "title": "Amazon Nova Forge: Nova を使用して独自のフロンティアモデルを構築",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-nova-forge-frontier-models-nova/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS は、Nova を使用して独自のフロンティアモデルを構築できる新しいサービス、Nova Forge の一般提供を開始しました。\n  Nova Forgeを使用すると、トレーニング前、トレーニング中、トレーニング後といったフェーズごとに初期の Nova チェックポイントから、SageMaker AI でのモデル開発を開始できます。所有データを Amazon Nova がキュレーションしたデータと組み合わせてモデルをトレーニングできます。また、Nova Forge でのみ利用可能なモデル開発機能を活用することもできます。これには、独自環境内で報酬関数を用いた Reinforcement Fine Tuning (RFT) を実行する機能や、組み込みの責任ある AI ツールキットを使ってカスタムの安全ガードレールを実装する機能が含まれます。Nova Forge を使用すると、組織独自の知識を深く理解し、専門性を反映するモデルを構築しつつ、推論などの一般的能力を維持し、破滅的忘却のようなリスクを最小限に抑えることができます。さらに、Nova Forge のお客様は、Nova 2 Pro や Nova 2 Omni などの新しい Nova モデルへの早期アクセスを利用できます。\n  Nova Forge は、本日より米国東部 (バージニア北部) の AWS リージョンで利用でき、今後数か月以内に他のリージョンでも利用できるようになります。Nova Forge の詳細については、AWS ニュースブログ、Amazon Nova Forge 製品ページ、または Amazon Nova Forge ユーザーガイドをご覧ください。本日より、Amazon Nova Forge コンソールから Nova Forge を利用できます。",
      "siteName": "AWS What's New"
    },
    {
      "id": "373bd87282aa9118eef224acc2a0ceb8bd4e0d18",
      "title": "Mistral Large 3 および Ministral 3 ファミリーが Amazon Bedrockで最初に発売",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/mistral-large-3-ministral-3-family-available-amazon-bedrock",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "お客様は、Amazon Bedrock で最初に発売された Mistral Large 3 および Ministral 3 ファミリーのモデルだけでなく、生産規模で生成 AI アプリケーションとエージェントを構築するためのプラットフォームである Amazon Bedrock で Voxtral Mini 1.0、Voxtral Small 1.0、Magistral Small 1.2 などの追加モデルを使用できるようになりました。\n \nMistral Large 3は最先端のオープンウェイトの汎用マルチモーダルモデルで、41B のアクティブパラメータと 675B の合計パラメータを特徴とするきめ細かな Mixture-of-Experts アーキテクチャを採用しており、信頼性と長期的なコンテキストの理解を目的として設計されています。14B、8B、3B モデルで構成される Ministral 3 ファミリーは、言語、ビジョン、インストラクションのバリエーションにわたって競合チェックポイントを提供し、デベロッパーがカスタマイズとデプロイに適したスケールを選択できるようにします。 Amazon Bedrock は、これらの最先端モデルを提供する最初のプラットフォームであり、お客様は Mistral AI の最新のイノベーションに早くアクセスできます。Mistral Large 3 は、256K のコンテキストウィンドウと強力なエージェント機能をサポートしているため、プロダクショングレードのアシスタント、検索拡張システム、複雑なエンタープライズワークフローに優れています。Ministral 3 ファミリーは、柔軟な導入オプションでこれを補完します。Ministral 3 14B はローカル展開向けの高度なマルチモーダル機能を提供し、Ministral 3 8B はエッジデプロイメントとシングル GPU 運用にクラス最高のテキストおよびビジョン機能を提供し、Ministral 3 3B は低リソース環境向けのコンパクトなパッケージで堅牢な機能を提供します。これらのモデルを合わせると、フロンティアインテリジェンスから効率的なエッジコンピューティングまで、あらゆる分野に及びます。\n \nこれらのモデルは現在 Amazon Bedrock で利用できます。利用可能な AWS リージョンの全リストについては、ドキュメントを参照してください。\n \nAmazon Bedrock でこれらのモデルの使用を始めるには、Amazon Bedrock Mistral AI ページをご覧ください",
      "siteName": "AWS What's New"
    },
    {
      "id": "c510b311a234be57ac4e047e2735bbe801dad16a",
      "title": "Amazon S3 で最大オブジェクトサイズが 50 TB に増加",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-s3-maximum-object-size-50-tb/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon S3 は、オブジェクトの最大サイズを従来の 5 TB の制限から 10倍の 50 TB に増加させました。これにより、高解像度ビデオ、地震データファイル、AI トレーニングデータセットなどの大きなオブジェクトの処理が簡単になります。50 TB のオブジェクトをすべての S3 ストレージクラスに保存でき、すべての S3 機能で使用できます。\n  AWS SDK の最新の AWS Common Runtime (CRT) と S3 Transfer Manager を使用して、大きなオブジェクトのアップロードとダウンロードのパフォーマンスを最適化できます。S3 のストレージ管理機能をこれらのオブジェクトに適用できます。たとえば、S3 ライフサイクルを使用してアクセス頻度の低いオブジェクトを S3 Glacier ストレージクラスに自動的にアーカイブしたり、S3 レプリケーションを使用して AWS アカウントまたはリージョン間でオブジェクトをコピーしたりできます。\n  Amazon S3 は、すべての AWS リージョンで最大 50 TB のオブジェクトをサポートします。大きなオブジェクトとの連携について詳しくは、S3 のユーザーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "196e96415a38a31cd5d837accae4231e1edfbc07",
      "title": "オペレーショナルエクセレンスを実現するフロンティアエージェントである AWS DevOps エージェント (プレビュー) の紹介",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/devops-agent-preview-frontier-agent-operational-excellence/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS DevOps エージェントのプレビューをリリースすることについてお知らせします。これは、インシデントを解決し、さらに事前に防止するフロンティアエージェントであり、AWS、マルチクラウド、ハイブリッド環境におけるアプリケーションの信頼性とパフォーマンスを継続的に向上させます。AWS DevOps エージェントは、経験豊富な DevOps エンジニアと同じように、リソースとその関係を学習し、オブザーバビリティツール、ランブック、コードリポジトリ、CI/CD パイプラインを使用し、それらすべてにわたってテレメトリ、コード、デプロイデータを相互に関連付けて、アプリケーションリソース間の関係を把握することで、インシデントを調査し、運用上の改善点を特定します。\n \nAWS DevOps エージェントはインシデントを自律的に優先順位付けし、平均解決時間 (MTTR) を短縮するためにチームを迅速な解決へと導きます。AWS DevOps エージェントは、午前2時でも、ピーク時でも、アラートを受け取った瞬間に調査を開始し、アプリケーションを最適なパフォーマンスにすばやく復元します。過去のインシデント全体のパターンを分析して、オブザーバビリティ、インフラストラクチャの最適化、デプロイメントパイプラインの強化などの主要領域を強化する実用的なレコメンデーションを提示します。AWS DevOps エージェントを使用すると、ワークフローを変更することなく、運用データやツールに含まれる新たなインサイトにアクセスできます。\n \nAWS DevOps エージェントは、米国東部 (バージニア北部) リージョンでのプレビュー中に追加料金なしで利用できます。詳細については、AWS ニュースブログを読み、はじめにをお読みください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "f0de5c3ebde7e0e23c32d433f2cd4b81038d7adb",
      "title": "Amazon Nova Act (GA) を使用して本番 UI ワークフローを自動化するエージェントを構築",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/build-automate-production-ui-workflows-nova-act/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon Nova Act が一般提供されることをお知らせいたします。Amazon Nova Act は、プロダクション UI ワークフローを自動化するための信頼性の高いエージェント群を開発および管理するためのデベロッパー向けの新しい AWS サービスです。Nova Act はカスタム Nova 2 Lite モデルを採用しており、比類のないコスト効率、価値実現までの時間の短縮、大規模な実装の容易さにより、高い信頼性を実現します。\n  Nova Act は、反復的な UI ワークフローをブラウザで確実に完了し、API やツールを実行し (PDFへの書き込みなど)、必要に応じて人間のスーパーバイザーにエスカレーションします。企業全体で繰り返しの多いプロセスを自動化する必要があるデベロッパーは、自然言語の柔軟性とより確定的な Python コードを組み合わせたワークフローを定義できます。Nova Act を使用する技術チームは、nova.amazon.com/act のオンラインプレイグラウンドですぐにプロトタイプ作成を開始し、Nova Act IDE 拡張機能を使用してスクリプトを改良してデバッグし、わずか数ステップで AWS にデプロイできます。\n  Nova Act は本日、米国東部 (バージニア北部) の AWS リージョンで利用できるようになりました。\n  Nova Act の詳細をご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "25641a74120bbef4c9a053c448adcf6fb74ec1d7",
      "title": "AWS が EC2 C8ine インスタンスをプレビュー",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-previews-ec2-c8ine-instances",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "AWS は、カスタムの第 6 世代インテル Xeon スケーラブルプロセッサー (Granite Rapids) と最新の AWS Nitro v6 カードを搭載した Amazon EC2 C8ine インスタンスのプレビューを開始します。これらのインスタンスは、データプレーンのパケット処理ワークロード専用に設計されています。\n  Amazon EC2 C8ine インスタンス設定では、前世代の C6in インスタンスと比較して、vCPU あたりのパケットパフォーマンスが最大 2.5 倍向上します。既存の C6in ネットワーク最適化インスタンスと比較して、インターネットゲートウェイを介して最大 2 倍のネットワーク帯域幅を提供し、最大 3 倍の Elastic Network Interface (ENI) を提供できます。小さなパケットサイズで高いパフォーマンスを必要とするパケット処理ワークロードに最適です。これらのワークロードには、セキュリティ仮想アプライアンス、ファイアウォール、ロードバランサー、DDoS 保護システム、および Telco 5G UPF アプリケーションが含まれます。\n  これらのインスタンスは、AWS アカウントチームからのリクエストに応じてプレビューできます。サインアップするには、アカウント担当者に連絡してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "b7a54695dec05538cc279cbfe1922373c95c65a2",
      "title": "Amazon EC2 M4 Max Mac インスタンスの発表 (プレビュー)",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-ec2-m4-max-mac-instances-preview",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon Web Services は、最新の Mac Studio ハードウェアを搭載した Amazon EC2 M4 Max Mac インスタンスのプレビューを発表しました。Amazon EC2 M4 Max Mac インスタンスは次世代の EC2 Mac インスタンスであり、Apple のデベロッパーは、最も要求の厳しいビルドおよびテストワークロードを AWS に移行できるようになりました。これらのインスタンスは、iOS、macOS、iPadOS、tvOS、watchOS、visionOS、Safari などの Apple プラットフォーム向けのアプリケーションを構築してテストするのに最適です。\n  M4 Max Mac インスタンスは AWS Nitro System を搭載しており、最大 10 Gbps のネットワーク帯域幅と 8 Gbps の Amazon Elastic Block Store (Amazon EBS) ストレージ帯域幅を提供します。これらのインスタンスは、16 コア CPU、40 コア GPU、16 コア Neural Engine、128 GB の統合メモリを搭載した Apple M4 Max Mac Studio コンピューター上に構築されています。EC2 M4 Pro Mac インスタンスと比較すると、M4 Max インスタンスは 2 倍の GPU コアと 2.5 倍以上の統合メモリを備えているため、インスタンス機能を特定のワークロード要件に合わせて選択できる選択肢が広がり、AWS での Apple シリコン Mac ハードウェアの選択肢がさらに広がります。\n \nAmazon EC2 M4 Max Mac インスタンスのプレビューの詳細の確認やアクセス権のリクエスについては、Amazon EC2 Mac ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "99f1555d6be2798950f92e70b5afa07122270d46",
      "title": "Amazon CloudWatch がオペレーション、セキュリティ、コンプライアンスデータの統合管理と分析を開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/amazon-cloudwatch-unified-management-analytics",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon CloudWatch は、AWS 環境とサードパーティのソース全体で運用、セキュリティ、コンプライアンスデータを統合できる新しいデータ管理および分析機能を提供します。DevOps チーム、セキュリティアナリスト、コンプライアンス担当者がすべてのデータに 1 か所からアクセスできるようになり、複数の個別のデータストアや複雑な (抽出、変換、ロード) ETL パイプラインを維持する必要がなくなりました。CloudWatch では、CloudWatch をネイティブに使用している場合も、Apache Iceberg 互換のツールを使用する場合も、お客様がこのデータからインサイトを取得する場所と方法について、これまで以上に柔軟に対応できるようになりました。\n  統合データストアの機能強化により、お客様は、地理的境界、事業単位、またはペルソナ固有の要件に合わせて、AWS アカウントやリージョンのログを簡単に収集して集計できるようになりました。AWS CloudTrail、Amazon VPC、Amazon WAF などの AWS ソースに対して AWS 組織全体での有効化が可能であり、Crowdstrike、Okta、Palo Alto Networks などのサードパーティソースのマネージドコレクターが用意されていることで、CloudWatch はより多くのログを統合しやすくします。お客様はパイプラインを使用して、セキュリティ分析用のOpen Cybersecurity Schema Framework (OCSF) などの標準形式にログを変換および付加し、より迅速なインサイト導出のためにファセットを定義できます。お客様は、追加のストレージ料金なしでデータをマネージド Amazon S3 Tables に保存でき、チームは、そのデータを Amazon SageMaker Unified Studio、Amazon Quick Suite、Amazon Athena、Amazon Redshift、または任意の Apache Iceberg 互換分析ツールでクエリできるようになります。\n  使用を開始するには、CloudWatch コンソールの「取り込み」ページにアクセスして、1 つ以上のデータソースを追加します。Amazon CloudWatch 統合データストアの詳細については、製品ページ、料金ページ、ドキュメントをご覧ください。リージョンごとの提供状況については、AWS ビルダーセンターをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "5a7a2ebf4052cc807c7b3b66e04c87cb9c9be62e",
      "title": "Amazon S3 バッチオペレーションによりパフォーマンスが向上",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/s3-batch-operations-performance-improvements/",
      "pubDate": "2025-12-02T13:00:00.000Z",
      "contentSnippet": "Amazon S3 バッチオペレーションでは、1 つのジョブで最大 200 億個のオブジェクトを処理する規模で、ジョブが最大 10 倍速く完了するようになり、大規模なストレージオペレーションが加速されます。\n  S3 バッチオペレーションを使用すると、ステージングバケットと本番バケット間でのオブジェクトのコピー、S3 ライフサイクル管理のためのオブジェクトのタグ付け、保存されたデータセットの内容を確認するためのオブジェクトチェックサムの計算など、大規模な操作を実行できます。S3 バッチオペレーションでは、追加の設定やコストなしで、数百万のオブジェクトを処理するジョブについて、オブジェクトの前処理、ジョブの実行、完了レポートの生成が最大 10 倍高速になりました。使用を開始するには、AWS マネジメントコンソールでジョブを作成し、オペレーションタイプと、バケット、プレフィックス、作成日などのフィルターを指定します。S3 はオブジェクトリストを自動的に生成し、必要に応じてアクセス権限ポリシーを含む AWS Identity and Access Management (IAM) ロールを作成し、ジョブを開始します。\n  S3 バッチオペレーションのパフォーマンス向上は、AWS 中国リージョンと AWS GovCloud (米国) リージョンを除くすべての AWS リージョンで利用できます。料金情報については、Amazon S3 料金ページの「管理とインサイト」タブをご覧ください。S3 バッチオペレーションの詳細については、概要ページとドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "aac7e53901b9e3a16d29f49a8d2b960976237a86",
      "title": "Amazon Bedrock AgentCore Runtime が双方向ストリーミングのサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/bedrock-agentcore-runtime-bi-directional-streaming/",
      "pubDate": "2025-12-02T08:00:00.000Z",
      "contentSnippet": "Amazon Bedrock AgentCore Runtime は双方向ストリーミングをサポートするようになりました。これにより、エージェントは会話の中断やコンテキストの変化に対応しながら、同時に聞き取りと応答を行うリアルタイムの会話が可能になります。この機能により、対話全体を通してコンテキストが維持される継続的な双方向のコミュニケーションが可能になり、会話の摩擦が解消されます。\n  従来のエージェントは、ユーザーが応答し終わるまで待ってから説明や訂正を行う必要があり、特に音声アプリケーションでは、会話の流れを断ち切り、不自然に感じるような停止と開始を繰り返す対話が発生していました。双方向ストリーミングは、継続的なコンテキスト処理を可能にすることでこの制限に対処します。これにより、音声エージェントは、ユーザーが会話の途中で中断、説明、方向転換を行うことができる自然な会話体験を提供できると同時に、応答性の向上によるテキストベースの対話を強化できます。AgentCore Runtime に組み込まれているこの機能により、リアルタイムストリーミング機能を構築するために必要だった数か月にわたるエンジニアリング作業が不要になり、デベロッパーは複雑なストリーミングインフラストラクチャの管理に煩わされることなく、革新的なエージェントエクスペリエンスの構築に集中できます。\n  この機能は、Amazon Bedrock AgentCore Runtime が利用可能なすべての 9 つの AWS リージョン (米国東部 (バージニア北部)、米国東部 (オハイオ)、米国西部 (オレゴン)、アジアパシフィック (ムンバイ)、アジアパシフィック (シンガポール)、アジアパシフィック (シドニー)、アジアパシフィック (東京)、欧州 (フランクフルト)、欧州 (アイルランド)) でご利用いただけます。\n  AgentCore Runtime 双方向ストリーミングの詳細については、ブログを読み、AgentCore のドキュメントにアクセスしたりしてください。使用を開始するには、AgentCore スターターツールキットをご利用ください。AgentCore Runtime の従量制料金では、エージェントの実行中に消費されたアクティブなリソースに対してのみ支払いが発生し、アイドル時間に対する費用や初期費用はかかりません。",
      "siteName": "AWS What's New"
    },
    {
      "id": "1bbed7b537b60f41f92babcf9ec132ef27574bb6",
      "title": "Amazon S3 Tables で Intelligent-Tiering ストレージクラスの提供が開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/s3-tables-intelligent-tiering-storage-class/",
      "pubDate": "2025-12-02T08:00:00.000Z",
      "contentSnippet": "Amazon S3 Tables では、Intelligent-Tiering ストレージクラスが提供されるようになりました。このクラスは、パフォーマンスへの影響や運用上のオーバーヘッドを発生させることなく、アクセスパターンに基づいてコストを最適化します。Intelligent-Tiering は、アクセスパターンの変化に応じて、テーブル内のデータを 3 つの低遅延アクセス階層にわたって自動的に移行し、ストレージコストを最大 80% 削減します。さらに、圧縮、スナップショットの有効期限、未参照ファイルの削除などのメンテナンス操作が S3 Tables で自動化されているため、データが上位層に移行することはありません。これにより、ストレージコストを節約しながらテーブルを最適化できます。\n  Intelligent-Tiering ストレージクラスでは、30 日間連続でアクセスされていないテーブルのデータは、自動的に低頻度アクセス層に移行されます (高頻度アクセス層よりもコストが 40% 低くなります)。90 日間アクセスされていないデータは、アーカイブインスタントアクセス層に移行されます (低頻度アクセス層よりもコストが 68% 低い)。テーブルを作成するときに Intelligent-Tiering をストレージクラスとして選択したり、テーブルバケット内のすべての新しいテーブルのデフォルトとして設定したりできるようになりました。\n  Intelligent-Tiering ストレージクラスは、S3 Tables が利用可能なすべての AWS リージョンで利用できます。料金の詳細については、Amazon S3 の料金ページをご覧ください。S3 Tables の詳細については、製品ページ、ドキュメントにアクセスし、AWS ニュースブログをお読みください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "f4ad1cbe6554c735479c9fb7d8284bd411fdb1fc",
      "title": "Amazon API Gateway に MCP プロキシサポートが追加",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/api-gateway-mcp-proxy-support/",
      "pubDate": "2025-12-02T08:00:00.000Z",
      "contentSnippet": "Amazon API Gateway はモデルコンテキストプロトコル (MCP) プロキシをサポートするようになりました。これにより、既存の REST API を MCP 互換のエンドポイントに変換できます。この新機能により、組織は自社の API を AI エージェントや MCP クライアントが利用できるようになります。Amazon Bedrock AgentCore Gateway サービスとの統合により、お客様は REST API をエージェント互換のツールに安全に変換するとともに、セマンティック検索によるインテリジェントなツール検出を可能にできます。\n  MCP プロキシ機能と Bedrock AgentCore Gateway サービスには、3 つの主なメリットがあります。1 つ目に、REST API がプロトコル変換を通じて AI エージェントや MCP クライアントと通信できるようになるため、アプリケーションを変更したり、追加のインフラストラクチャを管理したりする必要がなくなります。2 つ目に、二重認証による包括的なセキュリティを提供します。つまり、インバウンドリクエストに対するエージェント ID を検証すると同時に、アウトバウンドコールに対する REST API への安全な接続を管理します。最後に、AI エージェントはプロンプトコンテキストに最も合致する最も関連性の高い REST API を検索して選択できます。\n  この機能の料金については、Amazon Bedrock AgentCore の料金ページをご覧ください。Amazon API Gateway MCP プロキシ機能は、Amazon Bedrock AgentCore が利用可能な 9 つの AWS リージョン (アジアパシフィック (ムンバイ)、アジアパシフィック (シンガポール)、アジアパシフィック (シドニー)、アジアパシフィック (東京)、欧州 (ダブリン)、欧州 (フランクフルト)、米国東部 (バージニア北部)、米国東部 (オハイオ)、米国西部 (オレゴン) で利用できます。使用を開始するには、Amazon API Gateway のドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "e96adb778f7c06b618a1dd0ee438fc146271244e",
      "title": "Amazon SageMaker AI が AI 開発をより迅速に行うためのサーバーレス MLflow 機能を発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/sagemaker-ai-serverless-mlflow-ai-development/",
      "pubDate": "2025-12-02T08:00:00.000Z",
      "contentSnippet": "Amazon SageMaker AI は、AI モデル開発タスクをサポートするように動的にスケールするサーバーレス MLflow 機能の提供を開始しました。MLflow を使用すると、AI デベロッパーはインフラストラクチャのセットアップを待たずに実験の追跡、比較、評価を開始できます。\n  さまざまな業界のお客様が AI 開発を加速するにあたって、実験を追跡し、動作を観察し、AI モデル、アプリケーション、エージェントのパフォーマンスを評価する機能が求められています。ただし、MLflow インフラストラクチャを管理するには、管理者による追跡サーバーの継続的な維持およびスケール、複雑なキャパシティプランニングの決定、データを分離するための個別のインスタンスのデプロイを行う必要があります。このインフラストラクチャ運用の負担は、中核的な AI 開発からリソースを奪い、チームの生産性と費用対効果に影響するボトルネックを生じさせます。\n  今回の更新により、MLflow は動的にスケールして、要求の厳しい予測不可能なモデル開発タスクでは高速なパフォーマンスを提供し、アイドル時間にはスケールダウンするようになりました。また、管理者は Resource Access Manager (RAM) を使用してクロスアカウントアクセスを設定することで生産性を向上させ、組織の境界を越えたコラボレーションを容易にできます。\n  Amazon SageMaker AI のサーバーレス MLflow 機能は追加料金なしで提供され、SageMaker AI JumpStart、SageMaker Model Registry、SageMaker Pipelines などの使い慣れた Amazon SageMaker AI モデル開発機能とネイティブに連携します。お客様は自動バージョン更新により Amazon SageMaker AI 上の MLflow の最新バージョンにアクセスできます。\n  MLflow を搭載した Amazon SageMaker AI が、一部の AWS リージョンで利用できるようになりました。詳細については、Amazon SageMaker AI ユーザーガイドと AWS ニュースブログをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "24ea65fa69402bde36eb819e0c5a3d8c7aeca4bb",
      "title": "Amazon CloudWatch GenAI オブザーバビリティが Amazon AgentCore Evaluations 評価のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/cloudwatch-genai-observability-agentcore-evaluations/",
      "pubDate": "2025-12-02T08:00:00.000Z",
      "contentSnippet": "Amazon CloudWatch では、AgentCore Evaluations を通じて AI エージェントの品質評価を自動化できるようになりました。この新機能により、デベロッパーは実際の対話に基づいてエージェントのパフォーマンスを継続的に監視および改善できるため、チームはお客様に影響が及ぶ前に品質問題を特定して対処できるようになります。\n  AgentCore Evaluations には、有用性、ツール選択、応答精度などの重要な品質側面をカバーする 13 種類の評価機能が事前に組み込まれており、カスタムのモデルベースのスコアリングシステムもサポートしています。CloudWatch ダッシュボードで統一された品質メトリクスとエージェントテレメトリにアクセスでき、エンドツーエンドのトレース機能で評価メトリクスをプロンプトやログと関連付けて確認できます。この機能は、Application Signals、アラーム、機密データ保護、Logs Insights などの CloudWatch の既存の機能とシームレスに統合されます。この機能により、チームがカスタム評価インフラストラクチャを構築して維持する必要がなくなり、高品質の AI エージェントのデプロイが加速されます。デベロッパーは、CloudWatch GenAI オブザーバビリティコンソールの AgentCore セクションからエージェントフリート全体をモニタリングできます。\n \nAgentCore Evaluations は、米国東部 (バージニア北部)、米国西部 (オレゴン)、欧州 (フランクフルト)、アジアパシフィック (シドニー) で利用できるようになりました。使用を開始するには、ドキュメントと価格の詳細をご覧ください。基礎となるテレメトリデータには、標準の CloudWatch 料金が適用されます。",
      "siteName": "AWS What's New"
    },
    {
      "id": "d3e4629f221b4bd1c43811ceb9fa968d34cc1f73",
      "title": "Amazon SageMaker Catalog は、アセットのメタデータのクエリ可能なデータセットとしてのエクスポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/sagemaker-catalog-asset-metadata-queryable-dataset/",
      "pubDate": "2025-12-02T08:00:00.000Z",
      "contentSnippet": "Amazon SageMaker Catalog は、Amazon S3 Tables を介してアセットのメタデータを Apache Iceberg テーブルとしてエクスポートするようになりました。これにより、カスタム ETL インフラストラクチャを構築することなく、標準 SQL を使用して「先月登録されたアセットはどれくらいか?」、「どのアセットが機密として分類されてるか?」、「事業内容が記載されていないアセットはどれか?」といった質問に対して、カタログインベントリへ直接クエリを実行できるようになります。\n \nこの機能は、カタログアセットのメタデータをクエリ可能なテーブルに自動的に変換し、Amazon Athena、SageMaker Unified Studio ノートブック、AI エージェント、その他の分析ツールや BI ツールからアクセスできるようにします。エクスポートされるテーブルには、テクニカルメタデータ (resource_id、resource_type など)、ビジネスメタデータ (asset_name、business_description など)、所有権の詳細、タイムスタンプが含まれます。データはタイムトラベルクエリ用に snapshot_date ごとに分割され、SageMaker Unified Studio の aws-sagemaker-catalog バケットの下に自動的に表示されます。\n \nこの機能は、SageMaker Catalog がサポートされているすべての AWS リージョンで追加料金なしで利用できます。S3 Tables ストレージや Amazon Athena クエリなど、基盤となるサービスに対してのみ支払いが発生します。エクスポートされるテーブルに保持ポリシーを設定して、指定した期間より古いレコードを自動的に削除することで、ストレージコストを管理できます。\n  使用を開始するには、AWS CLI を使用してデータセットのエクスポートを有効にし、その後 24 時間以内に S3 Tables または SageMaker Unified Studio の [データ] タブからアセットテーブルにアクセスしてください。クエリは、Amazon Athena、Studio ノートブックを使用するか、S3 Tables Iceberg REST Catalog エンドポイントを介して外部の BI ツールに接続することで実行できます。手順については、Amazon SageMaker ユーザーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "e083dcdf40873bebb34dee6fd3dd18e22a73b575",
      "title": "新しいメモリ最適化 Amazon EC2 X8aedz インスタンスの発表",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/new-memory-optimized-amazon-ec2-x8aedz-instances",
      "pubDate": "2025-12-02T08:00:00.000Z",
      "contentSnippet": "AWS は、第 5 世代 AMD EPYC プロセッサ (旧コード名 Turin) を搭載した次世代のメモリ最適化インスタンスである Amazon EC2 X8aedz を発表しました。これらのインスタンスの最高 CPU 周波数は、クラウド上で最大の 5 GHz です。前世代の X2iezn インスタンスと比較して、最大 2 倍高いコンピューティングパフォーマンスを実現します。\n  X8aedz インスタンスは、最新の第 6 世代 AWS Nitro Cards を使用して構築されており、高いシングルスレッドパフォーマンスと大きなメモリ容量が必要な、物理レイアウトや物理検証ジョブなどの Electronic Design Automation (EDA) ワークロードやリレーショナルデータベースに最適です。5 GHz プロセッサとローカル NVMe ストレージの組み合わせにより、フロアプランニング、ロジック配置、クロックツリー合成 (CTS)、ルーティング、電力/信号インテグリティ解析など、メモリを大量に消費するバックエンド EDA ワークロードの処理を高速化できます。\n  X8aedz インスタンスは、メモリと vCPU の比率が 32:1 で、2～96 個の vCPU、64～3,072 GiB のメモリ構成を持つ 8 種類が用意され、2 つのベアメタル構成を含み、最大 8 TB のローカル NVMe SSD ストレージを利用できます。\n  X8aedz インスタンスは、米国西部 (オレゴン) およびアジアパシフィック (東京) リージョンで利用できるようになりました。X8aedz インスタンスは、Savings Plans、オンデマンドインスタンス、スポットインスタンスでご購入できます。使用を開始するには、AWS マネジメントコンソールにサインインしてください。詳細については、Amazon EC2 M8a インスタンスページまたは AWS ニュースブログをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "e816356b415ca468d2acf9a92a83da16c91fd6f5",
      "title": "AWS Transform がフルスタックの Windows モダナイズのための AI エージェントをリリース",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/aws-transform-ai-agent-full-stack-windows-modernization",
      "pubDate": "2025-12-01T15:00:00.000Z",
      "contentSnippet": "AWS Transform が、その機能を .NET モダナイズエージェントから拡張して、フルスタック Windows モダナイズエージェントが含まれるようになりました。これは、.NET アプリケーションとそれに関連するデータベースの両方を処理します。新しいエージェントは、.NET アプリケーションと Microsoft SQL Server データベースの Amazon Aurora PostgreSQL への変換を自動化し、それらを Amazon ECS または Amazon EC2 Linux 上のコンテナにデプロイします。AWS Transform は、運用コストを最大 70% 削減しながら、アプリケーションレイヤーとデータベースレイヤーにまたがるフルスタックの Windows モダナイズのスピードを 5 倍向上させます。\n  AWS Transform を利用すると、お客様は検出、変換、デプロイを自動化することで、フルスタックのモダナイズ工程を高速化できます。フルスタックの Windows モダナイズエージェントは、Amazon EC2 や Amazon RDS のインスタンス内の Microsoft SQL Server データベースをスキャンし、ソースリポジトリ (GitHub、GitLab、Bitbucket、Azure Repos) から.NET アプリケーションコードをスキャンして、カスタマイズされた、編集可能なモダナイズ計画を作成します。これは、SQL Server スキーマを Aurora PostgreSQL に自動的に変換し、データベースを新規または既存の Aurora PostgreSQL ターゲットクラスターに移行します。.NET アプリケーションの変換では、エージェントがソースコード内のデータベース接続を更新し、Entity Framework と ADO.NET 内に記述されているデータベースアクセスコードを Aurora PostgreSQL と互換性を持つように変更します。これらはすべて、人間の監督の下、統一されたワークフローで行います。変換されたコードはすべて新しいリポジトリブランチにコミットされます。最後に、変換されたアプリケーションとデータベースを新しい環境または既存の環境にデプロイして、変換されたアプリケーションとデータベースを検証できます。お客様は、作業ログの更新やインタラクティブなチャットを通じて変換の進捗状況を監視でき、詳細な変換のサマリーを次のステップの推奨事項や、AI コードコンパニオンへの簡単な引き継ぎに使用できます。\n  フルスタックの Windows モダナイズのための AWS Transform は、米国東部 (バージニア北部) の AWS リージョンで利用できます。\n  詳細については、概要ページと AWS Transform ドキュメントをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "91bb4e093f31e916bc31bebd9c622a8c0f430ff9",
      "title": "AWS Transform for mainframe がアプリケーションの再構築のサポートを開始",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/transform-mainframe-application-reimagining/",
      "pubDate": "2025-12-01T15:00:00.000Z",
      "contentSnippet": "AWS Transform for mainframe に、データとアクティビティの新たな分析機能が導入されました。これらの機能では、包括的なインサイトを抽出して、メインフレームアプリケーションの再構築を促進できます。これらのインサイトは、ビジネスロジックの抽出と組み合わせることで、レガシーアプリケーションを論理的なビジネス分野に分解する作業に役立てることができます。これらが一体となって、Kiro などのコーディングエージェントがアプリケーションをクラウドネイティブアーキテクチャに再構築するための包括的な仕様の基礎になります。\n  これらの新機能により、組織がレガシーワークロードを再構築できるようになり、自動化されたコードとデータ構造の分析、アクティビティの分析、技術ドキュメントの生成、ビジネスロジックの抽出、インテリジェントなコード分解を含む包括的なリバースエンジニアリングワークフローが構築されます。AWS Transform でのデータとアクティビティの詳細な分析を通じて、使用率やビジネス価値が高いアプリケーションコンポーネントを特定できます。そのため、チームはモダナイズの取り組みを最適化し、データに基づいたアーキテクチャ上の意思決定を行うことができます。\n  AI を活用したチャットインターフェイスでは、ユーザーが柔軟なジョブプランを通じてモダナイズアプローチをカスタマイズできます。これにより、事前に定義された包括的なワークフロー (モダナイズ全体、分析中心、ビジネスロジック中心) を選択したり、特定の目的に基づいて機能を独自に組み合わせたりできます。\n  AWS Transform for mainframe の再構築機能は現在、米国東部 (バージニア北部)、アジアパシフィック (ムンバイ)、アジアパシフィック (ソウル)、アジアパシフィック (シドニー)、アジアパシフィック (東京)、カナダ (中部)、欧州 (フランクフルト)、欧州 (ロンドン) の各リージョンで利用できます。\n  AWS Transform for mainframe によるメインフレームアプリケーションの再構築について詳しくは、AWS ニュースブログの記事または AWS Transform 製品ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "44c537e389fbb1286efdab3438d32d577ab83c2f",
      "title": "AWS Transform がエンタープライズ VMware への移行のための新しいエージェンティック AI 機能を追加",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/transform-vmware-agentic-ai-enterprise-migration/",
      "pubDate": "2025-12-01T08:00:00.000Z",
      "contentSnippet": "AWS Transform に、VMware の AWS への移行を自動化するための強力な新しいエージェンティック AI 機能が追加されます。移行エージェントは移行チームと協力してビジネスの優先事項を理解し、数千台のサーバーにまたがる数百のアプリケーションをインテリジェントに計画して移行することで、手作業による労力、時間、複雑さを大幅に軽減します。\n  エージェントが、AWS Transform 検出ツール、さまざまなサードパーティの検出ツールからのインベントリデータ、ドキュメント、メモ、ビジネスルールなどの非構造化データを使用して、オンプレミス環境を検出し、移行するアプリケーションに優先順位を付けることができるようになりました。インフラストラクチャ、データベース、アプリケーションの詳細を分析し、依存関係をマッピングし、所有権、部門、機能、サブネット、オペレーティングシステムなどのビジネス上および技術上の優先事項別にグループ化した移行計画を生成します。ハブアンドスポーク型の隔離されたネットワーク構成によるネットワークの生成、柔軟な IP アドレス管理オプションの提供、複数のアカウントへのデプロイ、AWS Landing Zone に対するネットワーク設定の生成、NSX、Palo Alto、Fortigate、Cisco ACI などのソース環境からの移行を行います。エージェントはサーバーを安全かつ反復的に AWS に順次移行し、デプロイ全体を通して明確な進捗状況を提供します。Windows と Linux x86 のサーバー、VMware、HyperV、Nutanix、KVM などのハイパーバイザー、ベアメタル物理環境も複数のターゲットアカウントに移行します。移行中は、ステップの繰り返しやスキップ、計画の調整が行われているかどうかという、意思決定の指針になる質問をエージェントに尋ねることができます。内部承認を簡素化するために、エージェントは移行計画と、ネットワーク、サーバー、アプリケーションのマッピングを含む詳細なレポートも生成します。\n  AWS Transform を使用すると、価値創出までの時間を短縮し、リスクを低減し、VMware 移行の複雑さを軽減できます。これらの新機能は、AWS Transform が提供されている AWS リージョンすべてで利用でき、16 の AWS リージョンへのサーバーとネットワークの移行がサポートされています。\n  製品ページとユーザーガイドで詳細を確認し、AWS Transform の使用を開始しましょう。",
      "siteName": "AWS What's New"
    },
    {
      "id": "68b8d349096c55692bb444970d8f764d6467a3c2",
      "title": "AWS Transform for mainframe が新しいテスト自動化機能を提供",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/transform-mainframe-testing-automation/",
      "pubDate": "2025-12-01T08:00:00.000Z",
      "contentSnippet": "AWS Transform for mainframe で、メインフレームのモダナイズプロジェクトを促進するためのテスト計画と自動化の機能が提供されるようになりました。新機能には、テスト計画の自動生成、テストデータ収集スクリプト、テストケース自動化スクリプトのほか、継続的デリバリーとリグレッションテスト用の機能テスト環境ツールが含まれていて、メインフレームのモダナイズプロジェクト中のテストと検証の高速化とリスク軽減に役立ちます。\n  これらの新機能は、モダナイズライフサイクル全体にわたるテストの主要な課題に対処し、通常、プロジェクト期間の 50% 以上を占めるメインフレームのモダナイズテストに必要な時間と労力を削減します。テスト計画の自動生成により、チームが事前の計画作業を減らすことができ、リスクの軽減とモダナイズの確実な成功に必要な重要な機能テストを調整できます。一方、テストデータ収集スクリプトが、メインフレームデータの収集というエラーが発生しやすく複雑なプロセスの進行を早めます。次にテスト自動化スクリプトが、テスト環境のステージング、テストケースの実行、期待される結果に対する結果の検証を自動化することで、テストケースのスケーラブルな実行を可能にします。\n  複雑なテストタスクを自動化し、希少なメインフレームの専門知識への依存を減らすことで、組織は一貫性のある自動化されたプロセスを通じて精度を向上させながら、確信的にアプリケーションをモダナイズできるようになりました。\n  AWS Transform for mainframe の新しいテスト機能は現在、米国東部 (バージニア北部)、アジアパシフィック (ムンバイ)、アジアパシフィック (ソウル)、アジアパシフィック (シドニー)、アジアパシフィック (東京)、カナダ (中部)、欧州 (フランクフルト)、欧州 (ロンドン) の各リージョンで利用できます。\n  AWS Transform for mainframe の自動テストの詳細と、それが組織のモダナイズの促進にどのように役立つかについては、AWS ニュースブログ、AWS Transform for mainframe 製品ページ、または AWS Transform ユーザーガイドをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "50dfde60b6a2addbcf8af73ccd8b74df6526000e",
      "title": "AWS Transform が .NET 変換機能を拡張して開発者エクスペリエンスが向上",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/transform-net-transformation-developer-experience/",
      "pubDate": "2025-12-01T08:00:00.000Z",
      "contentSnippet": "本日、AWS は、AWS Transform の .NET 変換機能の拡張と開発者エクスペリエンスの向上の一般提供を発表しました。お客様は、.NET Framework と .NET コードを .NET 10 または .NET Standard にモダナイズできるようになりました。新しい変換機能には、ASP.NET Core 上で Blazor に ASP.NET Web Forms を UI 移植する機能や、Entity Framework ORM コードを移植する機能が含まれます。AWS Toolkit for Visual Studio 2026 または 2022 で利用できる新しい開発者エクスペリエンスは、カスタマイズ可能で、インタラクティブで、反復型です。編集可能な変換計画、推定変換時間、変換中のリアルタイム更新、改訂された計画で変換を繰り返す機能、AI コードコンパニオンへの簡単な引き継ぎのための次のステップのマークダウンが含まれています。これらの機能強化により、AWS Transform はより多くの種類のプロジェクトに対応する最新の .NET へのパスを提供し、.NET と Visual Studio の最新リリースをサポートして、開発者が変換を監視して制御できるようにします。\n \n開発者は、強化された IDE エクスペリエンスにより、.NET のモダナイズを合理化できるようになりました。このプロセスは、カスタマイズ可能な変換計画を生成する自動コード分析から始まります。開発者は、パッケージ更新をファインチューニングするなど、変換計画をカスタマイズできます。変換全体を通して、透明性の高い進捗追跡と詳細なアクティビティログの利点を活用できます。完了すると、Linux の準備要件などの、残りのタスクの概要が記載された次のステップのドキュメントが開発者に届きます。タスクには、AWS Transform をさらに繰り返すか、Kiro などの AI コードコンパニオンツールを活用することで対応できます。\n \nAWS Transform は、米国東部 (バージニア北部)、アジアパシフィック (ムンバイ)、アジアパシフィック (ソウル)、アジアパシフィック (シドニー)、アジアパシフィック (東京)、カナダ (中部)、欧州 (フランクフルト)、欧州 (ロンドン) の AWS リージョンで利用できます。\n \nAWS Transform の使用を開始するには、AWS Transform ドキュメントを参照してください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "1b23688a4d36172a0c09e3c0434d6b8f41753170",
      "title": "AWS が組織全体のアプリケーションのモダナイズを加速する AWS Transform カスタムをリリース",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/12/transform-custom-organization-wide-modernization/",
      "pubDate": "2025-12-01T08:00:00.000Z",
      "contentSnippet": "AWS Transform カスタムの一般提供が開始され、エージェンティック AI を使用して組織固有のコードやアプリケーションの大規模なモダナイズを加速できるようになりました。AWS Transform は、Windows、メインフレーム、VMware などの変革を加速し、技術的負債を減らし、テクノロジースタックを AI 対応にする最初のエージェンティック AI サービスです。組織でレガシーシステムや時代遅れのコードが維持されている場合、技術的負債が蓄積され、ソフトウェア開発リソースの 20～30% を反復可能なクロスコードベースの変換タスクに割り当てなければなりません。さらに、このタスクは手動で実行する必要があります。AWS Transform では、バージョンアップグレード、ランタイムの移行、フレームワークの移行、言語翻訳の反復可能な変換を大規模に自動化できるため、多くの場合、自動化の専門知識がなくても実行時間を 80% 以上短縮できます。\n \nAWS Transform のカスタム変換エージェントは、構築済みのソリューションとカスタムソリューションの両方を提供します。Python や Node.js のランタイムアップグレード、Lambda 関数のモダナイズ、複数言語にまたがる AWS SDK の更新、Java 8 から 17 へのアップグレード (Gradle や Maven を含むあらゆるビルドシステムをサポート) など、一般的なシナリオに対応する変換をすぐに利用できます。チームは、組織固有のニーズに応じて自然言語、参照ドキュメント、コードサンプルを使用してカスタム変換を定義できます。ユーザーは自律的な変換をシンプルな 1 行の CLI コマンドでトリガーでき、スクリプト化したり、既存のパイプラインやワークフローに組み込んだりできます。エージェントは組織内で、開発者のフィードバックと実行結果から継続的に学習します。そのため、変換の精度を高め、エージェントのパフォーマンスを組織の優先事項に厳密に合わせることができます。このアプローチにより、組織は大規模な技術的負債に体系的に対処でき、開発者がイノベーションや影響の大きいタスクに集中している間に、エージェントが継続的に機能を向上させます。\n \nAWS Transform カスタムは現在、米国東部 (バージニア北部) の AWS リージョンでご利用いただけます。\n \n詳細については、ユーザーガイド、概要ページ、料金ページをご覧ください。",
      "siteName": "AWS What's New"
    },
    {
      "id": "29bd18ca11c9a2210a356afa62497c394c777987",
      "title": "Amazon Connect で AI エージェントの分析とモニタリングを改善",
      "link": "https://aws.amazon.com/jp/about-aws/whats-new/2025/11/amazon-connect-improved-analytics-monitoring-ai-agents",
      "pubDate": "2025-11-30T18:00:00.000Z",
      "contentSnippet": "Amazon Connect は、セルフサービスとエージェント支援エクスペリエンス全体にわたって AI エージェントに分析とモニタリングの機能を提供するようになりました。今回のリリースにより、AI エージェント主導の対話数、ハンドオフ率、会話ターン、平均処理時間などの主要なメトリクスを提供するカスタマイズしやすいダッシュボードを通じて、AI エージェントのパフォーマンスと顧客の成果を測定し、継続的に改善できます。バージョン間で AI エージェントのパフォーマンスを比較して最適な設定を特定し、インサイトを確認して AI エージェントが適切に機能している箇所と改善が必要な箇所を把握することもできます。さらに、今回のリリースでは、セルフサービスの問い合わせが感情スコアが低い人間の担当者に転送されたときにアラートを送信するなどの自動アクションをトリガーするルールを設定できます。Amazon Connect では、リクエストと応答のペイロードやツールの呼び出しなどの詳細情報を含む AI エージェントトレースも API 経由で提供されるため、AI エージェントのアクションと意思決定がわかりやすく、トラブルシューティングを迅速に行うことができます。\n  この機能は、Amazon Connect の AI エージェントが提供されているすべての AWS リージョンで利用できます。AI エージェント分析の詳細については、Amazon Connect の管理者ガイドを参照してください。クラウド上のサービスソリューションとしての AWS コンタクトセンターである Amazon Connect の詳細については、Amazon Connect のウェブサイトをご覧ください。",
      "siteName": "AWS What's New"
    }
  ],
  "lastUpdated": "2026-01-03T21:12:17.799Z"
}